{"id": 9, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/shadow-bat_67017376733921263", "title": "Shadow Bat", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Shadow Bat</h1><p>The smoke coming out from the walls gathered not far away from Evan and started to materialize</p><p>'A new monster is spawning' Evan thought feeling a sense of danger.</p><p>Just as he thought this, the smoke stopped coming out from the walls and a two meters long and one-meter-tall bat-like monster appeared before him.</p><p>The bat was pure black in colour, its two crimson colour eyes were shining brightly and a two-meter-long tail which was shaped like a claw was coming out from its back.</p><p>After appearing the bat immediately caught the smell of the blood, and looked in the direction of the dead wolf. </p><p>Evan was standing just a little distance away from the wolf and after seeing the bat coming there he started to back away, going toward the direction of the portal.</p><p>'Don't use echolocation' Evan thought while running away from there. </p><p>But his preyers were not heard by any gods as after not seeing the killer of the wolf the bat opened its mouth and released ultrasound. </p><p>As you all know bats navigate and find insect prey using echolocation. They produce sound waves at frequencies above human hearing, called ultrasound. The sound waves emitted by bats bounce off objects in their environment. Then, the sounds return to the bats' ears, which are finely tuned to recognize their own unique calls. </p><p>Even though Evan was running he was obviously slower than the ultrasound released by the bat. </p><p>If it was a normal bat, he could have avoided being caught by it by changing his posting again and again, but since it was not a normal bat it was obvious that its echolocation skill is far better than normal bats. </p><p>The sound waves bounced off after hitting Evan, and returned back to bat who was immediately able to find his location. </p><p>But when the bat flew at the location from where the sound bounced off earlier it did not see anyone there. </p><p>When the bat arrived there Evan was just fifty metres away from it, still running in the direction of the portal, but because of the invisibility potion, the bat wasn't able to see him with its eyes. </p><p>After not finding anyone there, the bat used echolocation once again. Sound waves once again spread throughout the entire hallway and it was once again able to find Evan's location. </p><p>When the bat looked at the location from where the sound bounced off just now, it didn't see anyone once again. </p><p>As the D rank monster the bat was not stupid, and immediately understood its enemy is using something that can hide him from its eyes. </p><p>The bat flew in the direction it sensed Evan earlier, and opened its mouth wide. </p><p>But instead of using echolocation to find his location, this time the bat screeched out loud in a high-pitched voice. </p><p>Evan who was running around seventy meters away felt a splitting headache and dropped to the ground while clutching his head when the bat screeched out loud. </p><p>'Fu*k' Evan can't help but curse and grit his teeth to not make any sound. </p><p>After five seconds the bat closed its mouth and stopped screeching, but Evan still wasn't able to stand up because he was feeling dizzy after the bat's attack. </p><p>While Evan was recovering from its attack, the bat once again used echolocation and found Evan's location who was on the ground. </p><p>Evan felt the sound waves bouncing off from his body and he knew the bat found his location once again. He wanted to stand up and run away from there, but the bat arrived there instantly and spit out a black liquid from its mouth covering Evan's entire body with it. </p><p>Evan who stood up with difficulty was stunned when he saw what the bat did, and wanted to know what kind of motherf*king octopus bat is this. </p><p>'Looks like I used up all of my luck when I got the third core earlier' Evan thought while looking at the bat who was hovering in the air, looking down on him with its crimson-red eyes. </p><p>Because of the black liquid now he was visible in the bat's eyes. </p><p>'It is good I don't have a game collection or anything else in this life, so even if I died I will not feel bad, right?' for some reason Evan's mind was very calm even though his life was in serious danger. </p><p>'Is this what people mean, when they say you won't feel anything when death will come for you?' Evan can't help but think when he felt his mind was very calm. </p><p>From above the bat opened its mouth to attack on him once again. </p><p>''Since my mind is so calm, I might as well try my best to survive. after all, I still want to eat something other than those nasty cup noodles''Evan mumbled as his grip around his sword tightened. </p><p>After opening its mouth, the bat released powerful sound waves in his direction. </p><p>Evan pressed his feet on the ground and jumped sideways dodging the sound waves at the last moment. Like an unstoppable force, the sound waves struck the ground, splitting it open and sending small pebbles flying everywhere. </p><p>After jumping away Evan looked around him because he knew he can't attack on the bat through normal means as long as it stays in the air.</p><p>When he looked around he saw many small stones which were created because of the sound wave attack of the bat. </p><p>Evan run towards the stones and grabbed two golf ball-sized stones from the ground. </p><p>Just as he grabbed the stones Evan felt something and jumped sideways without even looking at his back. Just as Evan jumped aside, a sharp claw passed from there barely missing him. </p><p>While jumping sideways Evan imbued some of his mana into one of the stones that he just picked up. </p><p>The stones glowed with faint blue light, and without waiting Evan threw the stone at the bat which was trying to fly away after it wasn't able to grab Evan with its claw.</p><p>The stone imbued with mana travelled like a meteorite and struck the bat right at the centre of its forehead. </p><p>Shriek -!! </p><p>The bat shrieked out in pain as the stone dug deeper into its skin and black blood flowed out from its forehead. </p><p>Because of the sudden attack, the bat lost its balance and started to fall down from the sky. </p><p>'Now is my chance' Seeing the bat was falling down from the sky Evan thought and charged towards it.</p>", "images": {}, "success": true, "cid": "67017376733921263"}