{"id": 6, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/shadow-wolf_66951569781878413", "title": "Shadow Wolf", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Shadow Wolf</h1><p>After spotting the sleeping monster, Evan cautiously approached it. </p><p>He stopped fifty meters away to carefully assess the situation. The creature before him was a two-meter-tall wolf covered in black metallic fur. Observing its formidable fur, Evan realized that it will be difficult for him to harm it with his sword. </p><p>He hesitated for a moment, unsure if his sword will work against the wolf or not. However, remembering his limited time, he steeled his heart and began walking towards it.</p><p>While walking, he felt his heartbeat accelerate because it was the first time he had used an invisibility potion. He wasn't sure if it will work against the wolf or not. </p><p>Although the potion's details mentioned that no one below C rank will be able to detect his presence, he still felt nervous because if the potion didn't work, he will be in big trouble. </p><p>Holding his sword tightly, he slowly approached the wolf, making sure not to make any sound.</p><p>When he was just ten meters away from the wolf, he suddenly noticed its eyelids flutter. Evan stopped in his tracks and held his breath, his body covered in cold sweat as he stared at the fluttering eyelids. </p><p>Fortunately, after a few seconds, the wolf's eyelids settled back to normal, and it continued sleeping.</p><p>Relieved that the wolf hadn't woken up, Evan let out a sigh and prepared to move forward once again. However, just as he was about to proceed, the wolf suddenly opened its eyes and looked around in confusion. </p><p>Evan, who was now just ten meters away from the wolf, almost had a heart attack at the sudden awakening. Luckily, he managed to control himself and refrained from screaming out loud.</p><p>The wolf looked around, clearly perplexed, but when it did not find anything unusual, it closed its eyes once more. </p><p>Evan waited for about a minute, making sure the wolf remained calm and didn't react. Satisfied that the wolf didn't show any signs of awakening, he cautiously resumed his approach. </p><p>He took slow steps, careful not to make any noise. Soon, he found himself only five meters away from the wolf, and it still hadn't noticed him.</p><p>When he was just two meters away, Evan tightened his grip on the sword and took a big step forward while slashing at one of the wolf's eyes. </p><p>Even though he was invisible, he chose to target the eye. </p><p>There were three reasons for this. First, that area was the only place not covered in fur. Second, standing so close, he feared that the wolf might be able to see him, but by destroying its eyes, it wouldn't be able to. Third, and most importantly, it will definitely inflict a great deal of pain.</p><p>\"Puchi!\"</p><p>The wolf howled in pain as Evan easily destroyed its left eye with a single slash, causing blood to spurt out. </p><p>The wolf tried to stand up but its movements were slow due to the sudden attack and intense pain. </p><p>Taking advantage of its sluggishness, Evan struck again, slashing at its second eye, destroying it as well making it blind. The wolf struggled to stand up, but fell down while withering in pain.</p><p>Evan didn't waste this opportunity and quickly thrust his sword at the wolf's chest. </p><p>But just as he expected, his sword wasn't able to pierce the wolf's skin due to its fur. However, he didn't give up and continued thrusting his sword at the same spot several times.</p><p>With his persistent attacks, he finally managed to inflict a deep wound in its stomach.</p><p>When he was about to thrust his sword for the tenth time, the wolf suddenly lifted its claw and slashed in his direction. </p><p>Evan stopped his attack and quickly jumped back, narrowly avoiding being sliced by the wolf's sharp claw. After leaping back, Evan moved away from the wolf, as he witnessed it standing up and slashing its claws around in an attempt to find him. Evan maintained a safe distance, observing the wolf's frantic but futile attacks.</p><p>After a minute of keeping his distance, Evan noticed the movements of the wolf started to become stiff. </p><p>\"So the paralyzing poison is finally taking effect,\" Evan muttered, realizing that the poison he had applied to his sword was finally working. </p><p>Gradually, the wolf's movements slowed until it eventually collapsed, paralyzed and unable to move.</p><p>With caution still in mind, Evan approached the motionless wolf. </p><p>He remained ready to retreat at any sign of danger. Yet, to his relief, the wolf lay still, completely immobilized by the poison. Since the wolf wasn't able to move because of the paralyzing poison, Evan easily ended its life.</p><p>Once the wolf was slain, Evan turned his attention to searching for the core. </p><p>With his sword, he carefully created an opening near its heart, since you can find the core of the monster near their heart. </p><p>Placing his hand inside the cavity, Evan began the search for the core, offering a silent prayer for success.</p><p>As his hand delved deeper, his fingertips brushed against something solid. </p><p>Filled with anticipation, Evan grasped the object and withdrew his hand. After withdrawing his hand when he examined his find, he discovered a small black sphere, about the size of a golf ball in his hand. </p><p>A surge of joy overwhelmed Evan, nearly causing him to burst out in laughter when he saw he got a shadow core just after killing the first monster. </p><p>\"It seems my E+ rank is finally proving useful now that I'm inside the dungeon,\" he exclaimed excitedly.</p><p>However, he quickly composed himself, knowing he can not afford to waste much time. </p><p>With two hours and forty-five minutes remaining before the potion's effects wore off, Evan pressed forward, delving deeper into the dungeon.</p><p>It didn't take long before he encountered another pair of monsters. </p><p>This time, two creatures lay before him—a small cat-like monster and a hyena-like creature—both fast asleep on the floor. </p><p>Assessing the situation, Evan made a decisive choice. He wanted to focus his attack on the cat-like monster first, as its defense appeared significantly weaker, and he thought he will be able to kill it with a single attack. </p><p>With this plan in mind, Evan initiated his approach toward the cat-like monster. </p><p>However, when he was just twenty meters away, he witnessed the cat suddenly awaken. Alarmed, Evan halted his advance, holding his breath while looking at the cat with his back drenched in cold sweat. </p><p>Slowly, the cat lifted its head, its gaze fixated in Evan's direction. </p><p>\"Don't tell me it can actually see me?\" Evan wondered, his mouth drying up as anxiety engulfing his body.</p><p>The next second he saw the cat stood up and, after a brief pause, started moving in his direction. </p>", "images": {}, "success": true, "cid": "66951569781878413"}