{"id": 8, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/danger-(part-2)_66996175953261380", "title": "Danger (Part 2)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Danger (Part 2)</h1><p>Evan made a hole near the heart of the hyena to look for the core, but he was disappointed because he didn't find any core this time.</p><p>Evan looked at the place where the body of the Neko-Chan was before the hyena blasted it away, and only saw blood and chunks of flesh there.</p><p>He tried to look around to see if he can find the core of the cat, but after five minutes when he didn't find anything he stopped looking for it.</p><p>\"The chances of getting a core from a monster are already very low, instead of wasting my time looking here, I should try to kill more monsters\" Evan said while sighing and started to walk deeper into the dungeon.</p><p>It is already been around forty five minutes since he enters the dungeon. Now he has only two hours and fifteen minutes left. </p><p>Feeling he doesn't have much time Evan increased his pace and walked even faster. </p><p>After one and a half hours Evan was sitting on the ground while panting heavily. Three black coloured rabbits who were two meters tall and had sharp claws were laying near him motionless. </p><p>There were deep cuts on their bodies and no life force can be felt from their bodies. </p><p>During this one and half hours, Evan killed seven monsters including these three rabbits. But from these seven monsters, he got only one core. </p><p>'Just two cores after all this time huh' Evan thought and shook his head. </p><p>Now he has only forty minutes left before the effect of the invisibility potion runs out. He is quite deep in the dungeon, and if he doesn't return now, it will be difficult for him to leave the dungeon once the effect of the potion runs out. </p><p>It will take him around thirty minutes to return to the portal of the dungeon, so Evan stood up and started to walk back. </p><p>\"Since now I have little experience fighting against these monsters, I might be able to gather more cores next time,\" Evan said while walking back. </p><p>After five minutes Evan stopped because he was a monster sleeping in front of him. Seeing the monster he was confused because he was sure that he killed all the monsters in this section of the dungeon earlier. </p><p>But then he remembered in dungeons, the monsters will respawn once again after some time you killed them. </p><p>The monster in front of Evan was the same wolf type monster he killed earlier after entering the dungeon. </p><p>'From here, it will take me around twenty five minutes to reach at the portal. I still have thirty five minutes left before the effect of the potion runs out, if I try my best I should be able to kill it in five minutes. Who knows I might get a core after killing it' Evan thought after seeing the wolf and made up his mind. </p><p>He slowly approached the wolf just like last time making sure not to alert it. </p><p>Soon Evan was just five meters away from the wolf, when he was five meters away he saw the nose of the wolf twitch. </p><p>Seeing its nose was twitching Evan stopped there and held his breath. After some time the nose of the wolf stopped twitching and returned to normal. </p><p>Evan once again walked forward and soon he was just two meters away from it. </p><p>After seeing the wolf was in his range of attack he didn't wait and just like last time slashed at one of its eyes. </p><p>But just as he slashed, he saw all the hairs on the wolf's body stand up and it tried to roll away from there. </p><p>But Evan was very close when he attacked on it so even though it tried, the wolf wasn't able to avoid the attack. </p><p>Red blood spurted out as the left eye of the wolf was destroyed. </p><p>Howl-!! </p><p>The wolf howled in pain and tried to stand up. Evan wanted to destroy the second eye of the wolf as well, but just as he tried to attack on it, he saw a cloud of black coming out from its body. </p><p>Without any hesitation, Evan stopped his attack and backed away from the wolf </p><p>When the cloud of black smoke touched the ground, the ground started to melt. Evan felt a chill running down his spine seeing how the black cloud melted the ground. </p><p>The cloud of black smoke expanded around the wolf, and covered two meters of area around it. </p><p>Seeing the cloud of smoke Evan knew that he can't approach the wolf. </p><p>\"I hope the paralyzing poison will soon take effect\" Evan muttered while standing far away from the smoke cloud. </p><p>After three minutes the black cloud started to disappear and he was once again able to see the wolf. </p><p>The left eye of the wolf was bleeding heavily and it was panting heavily. It was obvious that using that black cloud exhausted all of its mana. </p><p>After the smoke cloud disappeared the wolf tried to retreat, but just as it took a step back it fell to the ground feeling its body stiffing. </p><p>When Evan saw the wolf drop to the ground he knew that the poison was taking effect. He did not wait there any longer and charged towards it. </p><p>After coming before it he slashed at its second eye destroying it as well. </p><p>Howl -!! </p><p>The wolf howled in pain, but Evan ignored it and attacked on it with his sword again and again. </p><p>Since the wolf was not able to move because of the poison he easily killed it. </p><p>After killing it he looked for the core immediately. He made a small hole near its heart and when he looked there his eyes lit up because he found a shadow core there. </p><p>Seeing the core Evan was overjoyed, but he didn't waste his time there and quickly put away the core. </p><p>He wasted more than five minutes in killing the wolf and now he doesn't have much time left. </p><p>Evan was about to run away from there when suddenly black smoke started to come out from the walls of the dungeon. </p><p>Evan was stunned when he saw the black smoke and felt his heart tighten for some reason.</p>", "images": {}, "success": true, "cid": "66996175953261380"}