{"id": 5, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/shadow-kingdom-dungeon_66927745581499803", "title": "Shadow Kingdom Dungeon", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Shadow Kingdom Dungeon</h1><p>After leaving the city plaza, Evan once again hailed a taxi and asked the driver to take him to the Shadow Kingdom dungeon.</p><p>\"Now I only have two thousand credits left. If I don't find anything in the dungeon, I'll be doomed,\" Evan said and sighed.</p><p>The chances of obtaining a core after killing a monster are around twenty percent. Evan was hoping that within the three-hour time frame, he would be able to collect at least two cores.</p><p>If he managed to acquire two cores, he could sell one for thirty thousand credits and absorb the other one. With those thirty thousand credits, he would only need to gather another ten thousand to buy another invisibility potion and repeat the process.</p><p>\"I hope my E+ rank luck will shine a little in the dungeon,\" Evan muttered while looking out of the window of the taxi. \"It will be even better if I can get three cores there.\"</p><p>The Shadow Kingdom dungeon was located to the north of Astrate City. The hunter academy where Evan was studying, Astrate Academy, shared the same name as the city.</p><p>While sitting in the taxi, Evan closed his eyes and tried to remain calm. The Shadow Kingdom dungeon is one of the most dangerous D rank dungeons, but Evan had decided to enter it because it is very easy to find monster inside it. </p><p>The effect of his invisible potion will only last for three hours. If he enters another dungeon and cannot find the monsters within that time, it will be game over for him. So the Shadow Kingdom was the perfect place for his plan. </p><p>He will be lying if he says he is not nervous. This is his first time entering a D rank dungeon, and he is going alone, so it is natural for him to feel apprehensive.</p><p>The sword I brought from the academy looks quite good, I hope it will be able to pierce the defence of a D rank monster'</p><p>Evan brought his training sword with him. Normally students are not allowed to bring the training equipment of the academy outside, but last night Evan brought the sword with him sneakily.</p><p>He didn't feel anything wrong while steal*borrowing that sword because it is not like the academy will go bankrupt even if he break it by accident</p><p>After two hours, he finally reached his destination. He exited the taxi and paid the fare, nearly emptying his bank account.</p><p>Looking ahead, he saw a structure covered by high walls with armed guards stationed on them. Two guards stood at the entrance, engaged in conversation.</p><p>Evan took out his hunter card and walked toward the guards. When he approached them, they didn't pay much attention to him and simply asked for his hunter card.</p><p>However, upon seeing the details on Evan's card, one of the guards was momentarily stunned. He looked at Evan strangely and asked, \"You know this is not a F or E rank dungeon, but a D rank dungeon, right?\"</p><p>Evan had already anticipated this reaction, so he nodded and replied, \"Yes, I am aware that this is the D rank Shadow Kingdom dungeon.\"</p><p>\"Considering it's a D rank dungeon, there's a high possibility you'll die inside with your current power. Do you still want to enter?\" the guard asked once again.</p><p>Upon hearing the guard's warning, Evan nodded his head once more.</p><p>When the guard saw Evan still wanted to enter he shrugged his shoulders and allowed him to pass.</p><p>After passing through the gate Evan was able to see the entrance of the shadow kingdom dungeon. The entrance was a five-meter-high and three-meter-wide portal. He looked at the portal with a serious expression and took a deep breath before stepping forward.</p><p>As he entered the portal, he was immediately teleported into a dark hallway. Evan surveyed his surroundings, and noticed the floor and the walls of the hallways were black in colour.</p><p>Suddenly thinking about something Evan looked back and sighed in relief upon seeing the exit portal of the dungeon.</p><p>After confirming there was no monster in the hallway Evan opened the backpack he had brought and retrieved a sharp, metallic sword wrapped in cloth. Alongside the sword, he took out a small glass bottle filled with green liquid. The liquid inside was a paralyzing poison.</p><p>Evan carefully coated his sword with the paralyzing poison, intending to make it more effective against the dungeon monsters. With the sword prepared, he turned his attention to the hallway that led deeper into the dungeon. </p><p>After looking at the hallway which was leading deeper into the dungeon Evan retrieved the invisibility potion from his backpack.</p><p>After taking out the potion bottle he removed its cork and looked at it carefully. </p><p>\"All the novels that I read in my past life mentioned that the potions always taste like sh*t. I don't know how those authors know how the sh*t tastes like, but I hope I will not throw up after drinking it\" Evan muttered and drank the potion.</p><p>Gulp Gulp</p><p>\"It tastes like a chocolate smoothie,\" Evan remarked in surprise after drinking the potion.</p><p>\"I could probably drink this every morning,\" he thought to himself. However, when he considered the price of the potion and his nearly empty bank account, he felt like normal water tastes even better than chocolate smoothie.</p><p>As Evan consumed the potion, his body started to become translucent, and within ten seconds, he completely disappeared from where he was standing. He took a few steps to ensure the invisibility was working properly.</p><p>After confirming everything is fine, he didn't waste any time and started to walk deeper into the dungeon because he wanted to utilize these three hours properly.</p><p>And juts like what he had read about the Shadow Kingdom dungeon, just after walking a short distance down in the hallway, he spotted a sleeping monster on the floor. </p><p>After seeing the monster Evan took a deep breath and walked towards it carefully.</p>", "images": {}, "success": true, "cid": "66927745581499803"}