{"id": 7, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/danger-(part-1)_66973803200174106", "title": "Danger (Part 1)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Danger (Part 1)</h1><p>When the cat started walking towards Evan, the hyena-type monster that had been sleeping also woke up. </p><p>Upon witnessing this, for some reason, Evan couldn't help but curse the receptionist who had sold him the invisibility potion.</p><p>The cat-type monster slowly approached Evan's direction, carefully scanning its surroundings as if searching for something.</p><p>The cat monster was similar in size to a house cat, with a body covered in pitch-black fur like other shadow-type monsters. Its deep red eyes gleamed brightly. </p><p>'I hope this Neko-Chan isn't coming for me,' Evan thought, staying still, fully aware that if he were to die at its hands, he will not receive another transmigration ticket.</p><p>Unfortunately, the cat continued to approach his direction, stopping just two meters away from Evan. </p><p>In such close proximity, Evan began sweating profusely. The cat-type monster paused, sniffing the air and wearing a confused expression. </p><p>Evan glanced sideways at the hyena-type monster and noticed it also appeared confused, indicating its senses were much weaker than the cat's.</p><p>'Neko Neko go away come again another day--' to calm down his mind because of how close the cat type monster was standing to him, Evan started to sing a bullsh*t song inwardly.</p><p>Just as he began singing, the cat-type monster turned away and returned to its previous sleeping spot. </p><p>Relieved that the cat hadn't detected him, Evan finally released the breath he had been holding.</p><p>Soon, the cat settled back into its slumber, and the hyena followed suit. </p><p>After ensuring both monsters were sound asleep, Evan didn't immediately move. He waited for approximately five minutes before cautiously approaching the cat once again.</p><p>Soon Evan was just five meters away from the cat-type monster. As he reached this distance, the cat's nose twitched slightly. </p><p>This sight made Evan's heart skip a beat. Fortunately, the cat didn't wake up, and its nose returned to normal soon after.</p><p>Taking a deep breath, Evan cautiously moved closer to the cat. </p><p>When he was just two meters away, he didn't hesitate any longer. Gripping his sword tightly, he used the long blade of his sword to slash at the neck of the sleeping Neko-Chan.</p><p>Just as Evan slashed, the cat's eyes snapped open, and it attempted to leap away. </p><p>Despite its swift reaction, Evan's sword was faster. Before the cat could escape, the sword made contact with its neck. And just as Evan expected, the cat's defense was way weaker than the wolf he had slain earlier.</p><p>Upon contact with its neck, Evan's sword didn't pause for a second, swiftly severing the head from the rest of the body without resistance. </p><p>After killing the cat, Evan quickly turned around and saw that the hyena had already awakened. Its eyes widened as it gazed at the lifeless body of the cat.</p><p>To ensure his position remained concealed, Evan distanced himself from the cat's corpse. </p><p>After moving away when he looked back at the hyena, he noticed it was looking around with a confused look on its face, indicating its inability to detect him. </p><p>After confirming it can't detect him, Evan was about to move toward it, when he saw the hyena opened its mouth and launched a black energy ball towards the cat's body.</p><p>Boooomm-!! </p><p>The energy ball exploded upon impact, blowing away the cat's remains. </p><p>But after seeing it was unable to locate the enemy, the hyena began firing energy balls in all directions. </p><p>Witnessing this, Evan quickly increased the distance between them. However, by chance, the hyena shot an energy ball in his direction just as he was retreating.</p><p>Startled, Evan swiftly crouched down, narrowly avoiding the energy ball that landed ten meters away, leaving a small crater in the ground. </p><p>Evan gulped down his saliva after seeing the crater, he was sure that if that energy ball hit him earlier, the chances of him instantly dying were 99.99%</p><p>After barely avoiding death, Evan quickly stood up and put more distance between himself and the hyena. </p><p>The hyena continued shooting energy balls for the next five minutes, attempting to locate Evan, but it failed to find him.</p><p>After using its energy balls multiple times, the hyena was almost out of mana and was panting heavily. </p><p>When Evan noticed that it had stopped attacking and appeared completely exhausted, he began walking towards it.</p><p>Although exhausted, the hyena remained cautious, looking around with alert eyes. </p><p>Eventually, Evan was just ten meters away from it, and the hyena still hadn't noticed his presence.</p><p>'its senses are much weaker compared to that Neko-Chan,' Evan thought as he observed the hyena's obliviousness. </p><p>He gripped his his sword tightly, and approached the hyena. Even when he was merely three meters away from it, the hyena still failed to detect him.</p><p>Evan narrowed his eyes as all his senses heightened. He took a large step forward, and a light blue aura enveloped his sword. Instead of slashing, he used the sword like a spear and thrust it into the eye of the hyena, which reacted too late to defend itself.</p><p>Due to the use of mana during the attack, the sword easily pierced the hyena's eye, penetrating all the way to its brain, instantly destroying it. </p><p>The hyena didn't even have a chance to make a sound before its lifeless body dropped to the ground motionless.</p><p>Seeing the dead hyena, Evan finally felt a sense of relief and retracted his sword. </p><p>\"My mana reserve is truly awful. I used it for only a second and lost one-fifth of my mana,\" Evan shook his head in disappointment, realizing how much mana he had consumed.</p><p>'I need to increase my rank if I want to improve my mana reserve,' Evan thought and looked at the lifeless body of hyena wondering if he will get any core from it.</p>", "images": {}, "success": true, "cid": "66973803200174106"}