{"id": 2, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/what-do-you-want-to-sacrifice_66726249875170046", "title": "What do you want to sacrifice", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>What do you want to sacrifice</h1><p>\"So this is how I am going to die in this life,\" Evan said while lying on the floor of a dark hall. Blood continued to flow out from his back, where there was a claw mark that completely tore his flesh. The severity of his injuries indicated that the one who caused them was immensely powerful, as even his bones were visible through the wound.</p><p>His head was also bleeding, and it was evident from the injury that something very hard had struck his skull, fracturing the bone.</p><p>\"Since the day I opened my eyes in this world, I knew that my life would be pathetic. I thought I would die at the hands of some powerful beast or hunter. I even considered taking my own life for not being able to improve my own power. But I never imagined I would die from blood loss,\" Evan mumbled as his voice started to fade away and darkness began to engulf his vision.</p><p>\"I hope in my next life I will be able to enjoy a normal life, and I absolutely don't want to be born with a unique physique,\" Evan said before darkness completely consumed him.</p><p>Just as the darkness enveloped him, he heard a cold voice. \"What do you want to sacrifice?\"</p><p>Evan, whose vision was engulfed by darkness, heard the cold voice and struggled to open his eyes slightly, unable to move his head or look around to locate the speaker.</p><p>\"Who are you?\" Evan asked in a weak voice.</p><p>\"What do you want to sacrifice?\" But he received no answer, only the same voice repeating the question.</p><p>'Is this the voice of a devil, here to collect my soul as a sacrifice after I die?' Evan wondered upon hearing the word \"sacrifice.\"</p><p>\"What do you want to sacrifice?\" The voice echoed again, asking him what he wanted to sacrifice. </p><p>Barely able to think clearly due to the blood loss and recent events, Evan asked a different question this time. </p><p>\"What can I get after sacrificing something?.\" surprisingly this time he received an answer.</p><p>\"You can get anything, as long as the thing you sacrifice holds enough value,\" the voice replied in the same cold tone.</p><p>'I can get anything. This is the same line every devil says before asking someone to sacrifice their soul,' Evan thought, skeptical about sacrificing his soul to a devil despite his life's challenges. </p><p>However, he reasoned that if the voice was asking for a sacrifice, it meant it couldn't harm him if he refused.</p><p>'There's no way I'm going to sacrifice my soul to a devil, even though my life is a mess. I don't want to become a slave to a devil by sacrificing my soul. But what should I sacrifice? Since it's asking for something, it means it can't do anything to me if I don't sacrifice my soul,' Evan contemplated as his vision started to darken once again. The effects of blood loss began to show, and Evan knew that if he closed his eyes, he might never open them again. He pondered what he could sacrifice to heal himself and escape this predicament alive.</p><p>Then, Evan recalled why he found himself in this situation. All of it happened because he possessed something that hindered his power from improving.</p><p>'Although I don't know if this thing has enough value to heal my injuries, I won't lose anything by sacrificing this. On the other hand, it will benefit me since even if I die after sacrificing it, I can be assured that this thing will not follow me into the next life,' Evan decided, finally choosing what he would sacrifice.</p><p>\"I want to sacrifice my shadow physique,\" Evan said weakly, but he received no reply. Instead, black smoke neared him and covered his entire body. After ten seconds, the black smoke disappeared, and he heard the cold voice again.</p><p>\"What do you want in exchange for your physique?\"</p><p>\"Heal all of my injuries and give me some cores,\" Evan requested, although his initial intention was to heal his injuries. However, he also decided to ask for some cores. If the voice refused to grant him cores, he would back away. But if the voice agreed, he would be able to enhance his power.</p><p>Evan waited for a moment, and finally, the cold voice replied, \"Your physique holds enough value for this exchange. Commencing sacrificing ritual.\"</p><p>Suddenly, the entire hall glowed in a dark red color, and Evan, on the brink of passing out, heard the cold voice again.</p><p>\"You cannot sacrifice your physique in your current condition. If you sacrifice it without healing your body, you will die. Therefore, I will heal you first to complete the sacrifice. However, since I am healing you without receiving anything, you will only receive 50% of the cores I was going to give you initially.\"</p><p>Evan agreed without hesitation, as he never expected to receive any cores in the first place. In an instant, the black smoke engulfed his body once again, and he felt his body rapidly healing. Within five minutes, he was completely healed.</p><p>Evan checked his back and found it to be completely healed, along with his previously fractured head. There were no more injuries on his body.</p><p>\"Now, sacrificing your physique,\" Evan heard the cold voice once more, and the black smoke engulfed him again. However, this time, instead of feeling refreshed as before, Evan experienced excruciating pain, unlike anything he had ever felt.</p><p>\"Arghh!\" a scream filled with agony escaped his mouth as he felt his body being torn apart by an unseen force.</p><p>Unbeknownst to Evan, by sacrificing his physique, he awakened something within him that had been suppressed by his previous physique for years. </p><p>Even the one who made the exchange with Evan was unaware that by taking his physique, they had awakened something almost forgotten in history.</p><p>[12 hours ago]</p><p>RingRing*</p><p>Inside a small room, a boy was sleeping when suddenly his phone rang. He picked up the phone and heard the voice of another boy.</p><p>\"Evan, what are you doing today? Our group is going for a raid inside a dungeon. Do you want to come with us?\" Mike, one of Evan's classmates, asked.</p><p>\"I have to go somewhere today. You guys can go by yourselves,\" Evan replied, cutting the call without waiting for Mike's response.</p><p>After ending the call, Evan clenched his teeth. \"This bastard always tries to humiliate me by asking if I want to go into the dungeon with them, even though he knows that I can't increase my power with the help of those cores.\"</p><p>Evan tried to calm his mind, and stood up. He appeared to be around 18 years old, with jet-black hair and eyes. His pale white skin contrasted with his hair and eye color. Standing at approximately 180cm tall, he possessed a remarkably handsome appearance, considering his power level.</p><p>He attempted to forget the call he had just received and focused on the task at hand for the day.</p><p>Evan prepared a simple breakfast for himself which was pack of cup noodles. While eating, he glanced at his status window.</p><p>Name: Evan</p><p>Rank: F</p><p>Strength: F</p><p>Agility: F</p><p>Mana: F</p><p>Stamina: F+</p><p>Intelligence: F</p><p>Luck: E+</p><p>Charm: D</p><p>Skill: Shadow Walk</p><p>Physique: Shadow Physique</p><p>Title: ???</p><p>Job: None</p><p>Evan shook his head while observing his status panel. Only his charm and luck were ranked higher than F.</p><p>\"I should do what I can and wait for an opportunity to obtain some shadow cores to improve my rank. After all, I can only use shadow cores to enhance my rank, unlike others who can use any type of cores,\" Evan muttered with a bitter tone while looking at his status panel. His gaze briefly stopped at the section showing his physique before he closed the panel.</p><p>After finishing breakfast, Evan packed his backpack and made sure he hadn't forgotten anything. He then started walking towards the door of his room.</p><p>\"I hope everything will be fine, and I will be able to acquire at least one shadow core today,\" Evan said in a hopeful voice and left the room.</p>", "images": {}, "success": true, "cid": "66726249875170046"}