{"id": 3, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/evan_66881922055327432", "title": "Evan", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Evan</h1><p>\"Damm! How could I oversleep on the first day of my job? I worked so hard to get this job, and I really don't want to arrive late on my first day,\" Ray, a young man, said while running as if his life depended on it.</p><p>But he had to stop when he reached the main road because of the red light.</p><p>\"This cursed light is always green when I have free time, but now that I'm in a hurry, why is it red?\" Ray shouted, nearly throwing a stone to break the traffic light signal.</p><p>Ray stood there, glancing at his cheap wristwatch from time to time. After one minute, the signal finally turned green, and Ray dashed forward without waiting for even a second.</p><p>Horn-!</p><p>But just as he dashed forward, he heard a loud car horn. While still running, he glanced in the direction of the horn and saw a black car coming towards him at high speed.</p><p>Ray's mind went blank seeing the speeding car, and even before he could think of anything else, he felt his vision turning upside down.</p><p>For a moment, he didn't understand what had just happened. He tried to move his hands but found that he couldn't feel them.</p><p>Soon, he felt a warm liquid flowing down from his head, and his vision started to turn red.</p><p>He tried to move his body to understand what was happening, but he found that he couldn't even feel his body.</p><p>Warm liquid continued to drip from his face onto the ground, and a metallic smell assaulted his nostrils. He started losing consciousness, and his surroundings began to blur.</p><p>As his vision started to blur, Ray finally understood what had happened.</p><p>'Seriously, am I going to die like this?' Ray thought bitterly, 'I know I should have just stayed home and played video games instead of looking for a job. I didn't even get a chance to try the newly launched 'Lily's Secret' game.'</p><p>Soon, Ray lost consciousness, and his vision turned completely black.</p><p>\"Hmm,\" Ray opened his eyes and saw a familiar, yet unfamiliar, ceiling of the room.</p><p>Ray looked around and saw that he was lying on a bed in a small room.</p><p>\"Is this the hospital?\" Ray thought while trying to sit up. Surprisingly, when he tried to sit up, he didn't feel any discomfort that he expected to feel because of his earlier accident.</p><p>He raised an eyebrow, feeling strange about his situation. He looked around the room and saw that it was a small room with nothing but a bed and some daily necessities.</p><p>'This is not a hospital,' Ray instantly realized after inspecting the room. For some reason, while looking around the room, he found it quite familiar, even though he was sure that he had never seen this room before.</p><p>He tried to stand up and was able to do so without any problem. There was no discomfort even when he stood up.</p><p>\"How can my body be completely fine after that accident?\" Ray said out loud in a shocked voice, looking at the condition of his body. There wasn't even a scratch on his body, and his skin looked even better than before.</p><p>He looked around the room and, after spotting a mirror in the corner, he immediately walked towards it.</p><p>When he stood before the mirror and saw his reflection, his eyes widened.</p><p>\"Who the f**k is this dude?\" Ray mumbled while looking at his reflection.</p><p>Suddenly, he felt a splitting headache, and he dropped to the ground, clutching his head tightly.</p><p>\"Arghh!\" Some foreign memories started to flood his mind, and the headache intensified, causing him to cry out in pain.</p><p>Strange memories continued to appear for around five minutes. The pain was so severe that Ray almost lost consciousness once again.</p><p>After five minutes, the memories finally stopped flooding in, and the headache began to subside.</p><p>\"Evan,\" Ray muttered while lying on the floor. His entire body was drenched in sweat, and his heart was beating like a drum.</p><p>After around ten minutes, when his headache had completely disappeared, he finally stood up.</p><p>\"I can't believe it. Even though I was hit by car-chan instead of truck-kun, I still got a transmigration ticket,\" Ray muttered while looking at himself in the mirror.</p><p>The world he had transmigrated into was called the 'Arora World,' where people could use magic and skills with the help of mana.</p><p>\"Can I also use magic?\" Ray wondered, feeling excited. As an Otaku who had read dozens of novels, he accepted his situation very easily.</p><p>He checked the memories he had just received to find out if he could use skills or not. However, as he sorted through all the memories, his face turned grim.</p><p>In the Arora World, many people awakened special powers. Most people awakened their powers before turning sixteen years old. Evan had awakened his power when he was fourteen years old and joined the Hunter's Academy to train himself and learn more about superpowers.</p><p>Being an orphan, he was relieved when he awakened his power because not only did he awaken his powers, but he also awakened a physique called the Shadow Physique.</p><p>He possessed a skill called 'Shadow Walk' that allowed him to turn himself into a shadow. While using Shadow Walk, as long as he provided enough mana, he could even pass through barriers without being hindered by them.</p><p>After joining the academy, he learned how to improve his power. To do so, he had to use the cores of monsters.</p><p>Cores could be obtained by killing monsters in dungeons or in the wilderness. Cores were very rare, and only a few monsters dropped a core after being slain.</p><p>If you killed a fire-type monster, you could obtain a fire-type core from it. Similarly, killing a water-type monster would yield a water-type core. It didn't matter which type of core you obtained because you could improve your power by absorbing any type of core.</p><p>Usually, you could only absorb around 30% of the energy from a core, with the remaining energy dissipating into the surrounding environment. However, if you had a fire-type skill and absorbed a fire-type core, you could absorb around 50% of its energy.</p><p>But when Evan attempted to absorb a core for the first time after joining the academy, he found that he couldn't. His body inexplicably rejected all the energy he tried to absorb from the core.</p><p>At first, Evan thought that maybe the core he had absorbed was damaged, which was why he couldn't absorb it. However, the same thing happened when he tried to absorb a different core.</p><p>Evan was confused as to why he couldn't absorb the cores. He even asked the academy's teachers, but they too were perplexed by his situation, as they had never encountered something like this before.</p><p>For some time, Evan couldn't find the reason behind his inability to absorb the cores. But one day, he thought about his unique physique, the Shadow Physique.</p><p>Using his saved-up money, Evan bought a shadow-type core. To his surprise, when he absorbed it, he was able to absorb it effortlessly.</p><p>After this discovery, Evan decided to hunt shadow-type monsters to obtain their cores and improve his power. However, the lowest-ranked dungeon where he could find shadow-type monsters was at the D rank. As an F rank hunter, it was almost impossible for him to hunt them normally.</p><p>Even if he wanted to buy shadow-type cores, he couldn't easily afford them due to a lack of money.</p><p>\"My new life already ended even before it started,\" Ray muttered, feeling that he had received a defective body because he came here through car-chan instead of truck-kun.</p>", "images": {}, "success": true, "cid": "66881922055327432"}