{"id": 4, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/invisibility-potion_66905825947478452", "title": "Invisibility Potion", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Invisibility Potion</h1><p>Evan came out of his room and started walking towards the exit of the boys' dormitory of the academy. </p><p>It had been two years since Ray transmigrated into the Arora world. During these two years, he had completely replaced Evan and assumed his position in the academy. </p><p>Nobody suspected a thing because Evan had no friends there. Everyone in the academy looked down on him because, even after all this time, he was still an F Rank hunter and had been unable to increase his rank.</p><p>Ray, on the other hand, wasn't bothered by this. In fact, he was relieved that Evan had no friends since he didn't have to pretend when interacting with others. </p><p>During his time in the academy, Ray had attempted to increase his rank by purchasing shadow cores with the money he earned. However, only D rank or higher level shadow cores were available in the market, and a single D rank core cost around thirty thousand credits. To raise his rank from F to F+, Ray needed to absorb around five or six D rank cores.</p><p>Despite his efforts, Ray had only managed to buy two cores with the money he had saved over the past two years. </p><p>Now, he had saved up enough money to purchase one more core, but this time he had a different plan in mind. </p><p>In the past two years, he had also devoted time to learning swordsmanship. Although his talent with swords could be considered subpar, he had managed to master basic swordsmanship during that period.</p><p>Evan walked out of the academy and headed towards the nearby taxi station. When other students saw him, they either ignored him or looked at him with ridicule. Evan, however, didn't care about how they were looking at him since their opinion held no weight for him.</p><p>Currently, he was living in the academy as all students who joined were allowed to stay there for free. </p><p>However, the duration of their stay was limited to four years, and this was Evan's final year. </p><p>Upon reaching the taxi station, he hailed a taxi and asked the driver to take him to the city plaza.</p><p>As Evan sat in the taxi, he closed his eyes and contemplated his plans for the day. His objective was to purchase an 'Invisibility Potion' from the city plaza.</p><p>It was a Rank Two potion that could render its user invisible for three hours. After consuming this potion, no one below C rank would be able to detect him. Evan intended to enter a D rank dungeon called 'Shadow Kingdom' alone using that potion.</p><p>Over the past two years, he had taken on numerous jobs and hunted monsters in other low-level dungeons to save up money. However, the value of F and F+ rank cores was very low, and their drop rate was also not high. Consequently, despite his efforts, he hadn't been able to acquire enough cores to rank up even once.</p><p>Now, as it was his final year in the academy and he wouldn't be able to stay there any longer, Evan decided to try a different approach. </p><p>He planned to use the invisibility potion to hunt some D rank shadow monsters, although he was aware of the risks involved. Nevertheless, he believed it was the best way for him to increase his rank at this point.</p><p>After a fifteen-minute drive, the taxi driver stopped in front of a large building. Evan paid the fare and glanced at the building before making his way towards it. Upon entering, he took the elevator and arrived at the seventh floor, which housed a variety of herbs and potions.</p><p>Exiting the elevator, Evan approached the receptionist counter where a young man was standing.</p><p>Yup! A young man instead of a charming big sister. </p><p>Seeing the young man Evan gave the service of the city plaza a poor rating in his heart.</p><p>\"Good day, sir. How may I assist you?\" the young man greeted Evan with a professional smile on his face.</p><p>\"Do you have any invisibility potions?\" Evan inquired, stopping in front of the reception.</p><p>\"Allow me a moment to check our stock,\" the receptionist replied, looking at his computer screen. </p><p>After approximately ten seconds, he nodded and said, \"Currently, we have rank one and rank two invisibility potions available.\"</p><p>Evan nodded and asked for the rank two invisibility potion. The rank one potion only provided one hour of invisibility and it couldn't hide the user presence from D rank monsters.</p><p>Upon hearing Evan's request, the receptionist made a call, and soon a man brought a small box to the counter. </p><p>Seeing it was another male Evan couldn't help but think that the owner of the establishment had something against females which is why all the staff members are male.</p><p>After handing the box to the receptionist, the male staff member left. </p><p>The receptionist opened the box and retrieved a bottle filled with dark blue liquid. </p><p>After taking out the bottle, he handed it to Evan who touched the bottle, and its details appeared before him.</p><p>---) Invisibility Potion (Rank 2): After consuming this potion, the user becomes invisible for three hours, and no one below rank C can detect them.</p><p>Satisfied with the details, Evan nodded his head and asked its price.</p><p>\"This potion is our bestseller, and many people want to bu_,\"</p><p>\"Just tell me the price. I don't care if it's your bestseller or worstseller,\" Evan said, cutting off the receptionist's sales pitch, since he had no interest in listening to his professional bulls*it.</p><p>\"It is priced at forty thousand credits,\" the receptionist answered with a professional smile he was not offended even though Evan interrupted his passionate speech.</p><p>Evan cursed these people inside his mind for being robbers, but still purchased the potion.</p><p>\"Thank you for your purchase, sir,\" the receptionist said after Evan paid the money. </p><p>While crying inwardly because of his now empty bank account, Evan left the city plaza. His next destination is D rank shadow kingdom dungeon.</p>", "images": {}, "success": true, "cid": "66905825947478452"}