{"id": 12, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/a-new-physique-(part-2)_67109102471412423", "title": "A New Physique (Part 2)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>A New Physique (Part 2)</h1><p>Evan slowly opened his eyes, lying face-first on the cold floor of the hallway. He tried to sit up but felt completely exhausted, as if he had just run a marathon. With great effort, Evan managed to sit up and was initially confused about his overwhelming fatigue.</p><p>Gradually, memories of what had happened before he passed out flooded his mind. Evan scanned the hall for the black smoke but found nothing except a mound of dust in the distance. The statue and platform had turned to dust due to the black aura that had erupted from Evan's body.</p><p>Suddenly, Evan noticed something amiss. His vision seemed sharper than before, allowing him to see things more clearly. Confused, he remembered the cores the person who took his physique had given him. He glanced to his right, where he recalled the black smoke had dropped something.</p><p>There, near him, lay a ring. When Evan saw it, his heart skipped a beat. With trembling hands, he picked up the ring and examined it closely. After confirming its identity, he closed his eyes briefly and took a deep breath.</p><p>\"Hahaha!\" suddenly Evan burst into laughter. \"This is a storage ring! I can't believe that devil gave me a storage ring. I can easily sell it for a hundred thousand credits!\"</p><p>Storage rings are not rare in the Arora world, but only the wealthy could afford them. Evan, who barely had any money to buy one core, could never have imagined owning such a ring. Yet here he had obtained it for free.</p><p>Evan quickly placed a drop of blood on the ring to establish a link with himself. He then eagerly checked the number of cores the devil had given him.</p><p>When he checked the ring, Evan's jaw almost dropped to the ground seeing fifty D rank core inside the storage ring. </p><p>Evan almost died in his attempt to obtain three cores from the dungeon, but now he had a storage ring and fifty cores, all just for sacrificing his useless physique.</p><p>\"Was that devil a moron? He healed me and then gave me a stronger ring and so many cores just for that useless physique,\" Evan muttered, wearing an expression of disbelief.</p><p>\"Did he really take away my physique?\" Evan doubted, opening his status window.</p><p>Name: Evan</p><p>Rank: F</p><p>Monarch Core Rank: F</p><p>Strength: F</p><p>Agility: F</p><p>Mana: F</p><p>Stamina: F+</p><p>Intelligence: F</p><p>Luck: E+</p><p>Charm: D</p><p>Skill: Shadow Walk</p><p>Physique: Shadow Monarch Physique</p><p>Title: ???</p><p>Job: None</p><p>\"What is this monarch core rank?\" Evan questioned, noticing a new term in his status window. He continued reading until his gaze fell upon his physique.</p><p>\"This...?\" Evan exclaimed, shocked by the new name displayed in his physique details.</p><p>As he observed the Shadow Monarch Physique, additional information appeared in his status window.</p><p>--) Shadow Monarch Physique: One of the forbidden physiques that exist in the world. It allows you to form a monarch core inside your heart. The monarch core can absorb 100% of a core's power. While absorbing the core, there is a 3% chance you will receive a skill of the monster from which the core was extracted. </p><p>Boom!</p><p>After reading the details of his new physique, Evan felt like an explosion happened inside his mind. It was common knowledge that a person could only absorb a maximum of 50% of a core's power, but here he is reading he can absorb 100% power of the core with the help of his new physique, and there is even a 3% chance he will get a skill after absorbing the core. </p><p>\"It's just...\" Evan struggled to find words. Previously, his old physique had hindered his progress, preventing him from enhancing his power. Now, with his new physique, he could improve his abilities at an unprecedented speed.</p><p>But Evan quickly calmed himself down, realizing there are many things he didn't understand. Firstly, how did he acquire this new physique? Secondly, what exactly is a forbidden physique? Thirdly, what was this monarch core residing within his heart? Countless questions swirled in his mind, causing a throbbing headache as he contemplated the implications.</p><p>\"Wait, why can I see the details of this physique now?\" Evan suddenly spoke while looking at the details of his new physique. In the past, when he possessed the Shadow Physique, he could only see question marks. </p><p>Whenever he tries to look for its details, all his status window showed were question mark. </p><p>However, now, to his surprise, he can see full information regarding his new physique. Evan can't understand what had changed after losing his old physique.</p><p>\"The Monarch Core... I remember feeling like my heart would burst before I passed out. Was it because of this core?\" Evan wondered aloud, attempting to sense anything unusual within his heart.</p><p>Closing his eyes, he focused his mana on his heart, and a vivid image of his heart appeared in his mind. Within it, he could see a minute, pitch-black sphere, no larger than a grain of rice, slowly rotating.</p><p>\"So, this is the Monarch Core that allows me to absorb 100% of a core's power,\" Evan murmured skeptically, finding it hard to believe that such a tiny core could possess such extraordinary capabilities.</p><p>Evan gazed at the storage ring he had acquired from the devil and retrieved a red core—a fire core—likely extracted from a fire-type monster. All the cores within the storage ring were of D rank. Taking a deep breath, Evan held the core in his hand, to test whether he can now absorb non-shadow-type cores.</p><p>As he infused his mana into the core, wisps of orange fire-like energy materialized and swirled around it, gradually approaching Evan's body. </p><p>Evan Nervously observed the wisps, realizing that if his body absorbed them, it would signify that he can now absorb cores just like any other hunter. However, if he failed to absorb them, it would mean that nothing had truly changed for him.</p><p>The wisps drew closer to him and were eventually absorbed by his body. Evan's eyes sparkled with excitement as he saw his body successfully absorbed the energy of the core. </p><p>Within a minute, the core vanished, and Evan felt a slight surge in his power.</p><p>\"I was just able to absorb 30% of the core's power,\" Evan said while rasing an eyebrow. </p><p>\"Is this physique also a scam?\" he can't help but think when he was not able to absorb 100% enrgey of the core. </p><p> </p><p> </p>", "images": {}, "success": true, "cid": "67109102471412423"}