{"id": 18, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/mike_67248819099719803", "title": "Mike", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Mike</h1><p>is really you?\" Mike asked when he came near Evan.</p><p>\"Here he goes again, always trying to make the life of weak students hard,\" a student who was watching everything said when he saw Mike and his gang approaching Evan.</p><p>\"It's his fault for being weak. If he doesn't want to get harassed by them, he should work hard and increase his power,\" another student said without much care.</p><p>\"I still feel bad for other students who get bullied by these bastards.\"</p><p>\"Why don't you go there and help him if you feel bad for him?\"</p><p>\"I would have helped him if my rank was higher than theirs. Unfortunately, all four of them are also D-rankers. I would be digging my own grave if I mess with them alone,\" the student said while shaking his head.</p><p>\"If you know you can't do anything, then just shut your mouth and watch the show.\"</p><p>\"Are you alright? What happened to you? Your clothes are all stained in blood,\" Mike asked Evan after coming near him.</p><p>'What a good actor,' Evan thought when he saw how Mike was showing concern for him. If it were in the past, Evan would just listen to him silently without saying anything. But now that he had his Monarch Core that had already advanced to D-rank, he could easily crush Mike and his friends without any effort.</p><p>\"I am fine, thanks for your concern. I just went to the market to buy some stuff, but when the girls saw me, they all jumped on me like hungry lionesses. I had to go through a bloodbath to safely escape from them. That's why my clothes are stained in blood. Sigh, being too handsome is really troublesome,\" Evan said with a sigh and made a face as if he had suffered a great injustice.</p><p>Mike and the others who heard what Evan said were taken aback by his response and just looked at him dumbfoundedly. 'He went through a bloodbath to escape from girls? Does he really want us to believe this shit?' This was the only thought that came to everyone's mind.</p><p>\"Hahaha,\" Mike came out of his daze after hearing the laughter of the other students who were watching everything.</p><p>A cold light passed through Mike's eyes when he looked at Evan, who was staring at him calmly. He was a little confused because Evan had never talked back to him in the past. But just now, not only did Evan talk back to him, but he was even looking at him without any fear.</p><p>\"I see you have learned how to joke,\" Mike said with a cold smile.</p><p>\"Joke? What are you talking about?\" Evan asked with a puzzled expression.</p><p>\"He is pissing him off,\" one student said when he saw how Evan was provoking Mike.</p><p>\"You piece of shit, did you forget what happened last time when you talked back to us?\" Lucas, one of Mike's companions, said.</p><p>\"Oh! I did not expect to see an orc here in the Hunter Academy. What the hell are the security guards doing, letting an orc enter the academy?\" Evan said to Lucas when he heard him.</p><p>\"Hahaha,\" other students started to laugh after hearing this. Lucas was two meters tall, and his body was unusually muscular for a human. He really looked like an orc.</p><p>\"You bastard!\" Lucas was about to attack Evan when Mike stopped him and looked at Evan coldly. \"I don't know what happened to you, but if you don't want me to break your bones, you better apologize to us while I'm giving you a chance.\"</p><p>\"That's my line, you morons. If you don't want me to wipe the floor with all of you, you better apologize to me. Then I might consider letting you off,\" Evan said to Mike without bothering about his earlier warning.</p><p>\"What happened to him? Why is he acting like this?\" Most of the students were confused when they saw how Evan was behaving. </p><p>This was not the first time they had seen Mike and his gang mess with Evan. In the past, whenever Mike and his gang harassed him, he would silently do whatever they wanted him to do. But they were confused about what had happened to him that he was behaving like this.</p><p>\"Hahaha,\" Mike and his gang burst into laughter when they heard what Evan said. \"You want us to apologize to you? Did you hit your head or something?\" Mike asked while laughing.</p><p>\"Can't you four at least laugh like humans? I know your appearance is similar to monsters, but you guys can at least behave like humans,\" Evan said with an irritated voice because these muscleheads were laughing like idiots while standing in front of him.</p><p>\"You bastard, do you think I won't kill you if we are inside the academy?\" Mike said, grabbing the collar of Evan's tattered shirt.</p><p>Evan's expression turned cold when Mike grabbed his collar. \"Remove your dirty hands if you don't want to become bedridden for the rest of your life,\" Evan said in a cold voice.</p><p>When Mike heard this, he wanted to laugh, but when he looked into Evan's deep black eyes, he suddenly felt an ominous feeling. He wanted to let go of Evan's collar and take a step back, but when he remembered how weak Evan was, he dismissed that feeling.</p><p>Evan just looked at Mike coldly, and when he didn't let go of his collar, he was about to make his move when someone said, \"What is going on here?\"</p><p>Mike quickly released the collar of Evan's shirt and took a step back after hearing the voice.</p><p>Everyone looked in the direction from which the voice came and saw a girl walking toward Evan and Mike.</p><p>\"So the class president finally appeared,\" one of the students who was watching said.</p><p>\"Tch, the show was just starting to become interesting. I wanted to see what Evan would have done after talking like this,\" a student said in a dissatisfied tone when he saw what happened.</p><p>The girl who just appeared was the class monitor of the final year, and she was a C+ rank hunter named Valery.</p><p>Valery had light blue hair and deep green eyes. Her skin was as white as jade. She came near Mike and Evan and asked once again, \"What's going on here?\"</p><p>\"Nothing, we were just talking among ourselves,\" Mike said with a nervous tone when he saw Valery because even if all four of them worked together, they would not be able to do anything to her, as she was already a C+ rank hunter.</p><p>\"Mike, I think I already warned you not to harass other students,\" Valery said in a cold tone when she heard what Mike said.</p><p>\"But we didn't do anything. You can ask Evan,\" Mike said and looked at Evan with threatening eyes.</p>", "images": {}, "success": true, "cid": "67248819099719803"}