{"id": 16, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/testing-new-skills-(part-2)_67202045026814699", "title": "Testing New Skills (Part 2)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Testing New Skills (Part 2)</h1><p>Evan stopped 50 meters away from the lion. The monster had already noticed Evan, but it did not attack him immediately because it could sense a dangerous aura from him.</p><p>Evan smiled when he saw how cautious the lion was upon seeing him. If it had been before, the lion would have already attacked him without giving him a chance to catch his breath.</p><p>Roarrrr!!!</p><p>The lion roared at Evan upon seeing him smiling, although it could sense the danger he posed. As a monster with the primary instinct to kill, it couldn't endure any longer and charged toward Evan at full speed.</p><p>The lion was quite fast for a D rank monster, but when Evan saw it, he felt like the lion was moving in slow motion. As the lion charged toward him, Evan also moved.</p><p>\"Haste!\" Evan used his newly acquired skill, Haste, and his agility increased sharply. </p><p>But when he used haste to increase his agility, he wasn't able to control his speed properly and ran past the lion appearing behind it.</p><p>When Evan stopped, he felt like his head was spinning. Since he had just advanced to D rank with his monarch core and his prime core had also advanced to E rank, his agility had increased exponentially. </p><p>It was his first time using his newfound power, so he wasn't able to control it properly, and instead of appearing in front of the lion, he ended up appearing behind it.</p><p>\"Damm! I'll have to practice if I don't want to crash into something while running,\" Evan said when he realized he couldn't control his new power.</p><p>The lion, which was charging toward Evan, also stopped and quickly looked behind when it sensed Evan's presence.</p><p>Roar!!!</p><p>The lion roared once again and charged toward Evan once more. Evan took a deep breath and dashed toward the lion but didn't use the Haste skill this time to enhance his agility. He wanted to first control his natural speed.</p><p>Even without using the Haste skill, Evan was much faster than the lion. When he neared the lion, the monster used its front claw like a hammer to strike him, but Evan easily dodged the lion's claw with his agility and punched the lion in the face.</p><p>Roar!!!</p><p>The lion roared in pain as Evan's fist landed squarely on its face. Due to the impact, the lion was blasted ten meters away from him.</p><p>Evan was shocked by his own strength. Normally, an average D rank hunter would have a hard time fighting against a monster of the same rank. But here, he wasn't even using his full strength, but he was able to fight against the lion effortlessly.</p><p>\"Looks like the power the monarch core gave me when it advanced to a new rank is vastly different from the power that the prime core gave me,\" Evan said, impressed by his ability to fight against the lion without much effort.</p><p>Roar!!</p><p>The lion roared and stood up after being blasted away by Evan's punch. Suddenly, a black mist started to emanate from the lion, covering its entire body.</p><p>The mist began to solidify, forming armor that covered the entire body of the lion. Because of the armor, the lion's defense greatly increased, and with a loud roar, it dashed toward Evan once again.</p><p>Evan didn't care about the skill the lion had just used and pointed one of his fingers towards the incoming lion.</p><p>\"Shadow bullet,\" Evan muttered, and a dark bullet shot from his finger towards the lion at a frightening speed.</p><p>Since the lion was running towards him at full speed, it wasn't able to dodge the bullet. The bullet struck the lion in the center of its head.</p><p>The bullet easily pierced through the lion's armor, and even its tough skin couldn't stop the shadow bullet completely. The bullet dug deeper into the head of the lion and made a small hole at the center of its forehead.</p><p>Roarrrrr!!!!</p><p>With a loud roar, the charging lion dropped to the ground when the bullet struck it in the center of its forehead, and black blood spurted out from its forehead.</p><p>\"The power of Shadow Bullet is not bad,\" Evan remarked, observing how his bullet easily pierced through the lion's defense.</p><p>\"I think I can easily take care of any Rank D monster with my current power. I should finish off this lion so I can go back and eat something. After doing so much today, I'm starting to feel hungry,\" Evan said, dashing towards the lion, which was still roaring in pain because of the earlier bullet.</p><p>With his high agility, Evan reached the lion in the blink of an eye and once again used Shadow Bullet, but this time, Evan used three times more mana than before.</p><p>A sharp, two-centimeter-long bullet formed at the tip of Evan's finger, and he shot it at the lion. The bullet pierced through the lion's head, destroying its brain.</p><p>Roarrr!!!</p><p>With a loud, agonizing roar, the lion ceased to breathe and died. Evan looked at the lifeless body of the lion for a moment and remembered how just a few hours ago, he was struggling to fight against monsters of similar strength. But in a matter of hours, everything changed due to a single event.</p><p>As Evan contemplated how easily he had killed the lion, a small smile appeared on his face. \"I wonder what kind of expression those arrogant students from the academy will make when they find out about my current strength.\"</p><p>After killing the lion, Evan searched for its core, but unfortunately, he didn't find anything. Nevertheless, Evan was not disappointed and began walking toward the exit portal of the dungeon.</p><p>This time, he didn't encounter any monsters and safely arrived at the exit portal of the dungeon.</p><p>Evan took a deep breath and exited the dungeon, ready to start a new life where he wouldn't have to endure the mocking looks of others and could continue to improve his power.</p>", "images": {}, "success": true, "cid": "67202045026814699"}