{"id": 14, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/new-skills-(part-2)_67155470669904289", "title": "New Skills (Part 2)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>New Skills (Part 2)</h1><p>Evan continued to absorb the cores using his monarch core. When he absorbed his 12th core, which came from a wind-type monster, a notification appeared before him.</p><p>[You have learned the skill Haste.]</p><p>\"I didn't expect to learn a skill so soon,\" Evan said with a delighted voice as he looked at the details of his new skill.</p><p>---) Haste: While using the skill your agility will be increased by 20%.</p><p>Although Evan had hoped to acquire an attack-type skill, he wasn't disappointed with Haste. It was a simple yet excellent skill for enhancing his agility. And there were still many cores left for him to absorb.</p><p>After learning the skill, Evan continued to absorb more cores. Just as he absorbed two more cores after acquiring Haste, he felt his monarch core start to rotate faster and faster. </p><p>Suddenly, the mana from the surroundings began to flow towards him and enter his body.</p><p>A whirlpool of mana appeared above Evan's head as the surrounding mana moved towards him. After entering his body, the mana moved towards his heart and was absorbed by his monarch core.</p><p>Evan felt a slight pain in his heart, but he easily endured it. </p><p>The mana whirlpool above his head continued to gather mana near his body. After a minute, Evan felt his monarch core stop rotating.</p><p>Suddenly, his monarch core released a burst of energy, refining his body. Evan felt his body being strengthened to another level, and his mana capacity greatly increased.</p><p>Name: Evan</p><p>Rank: F</p><p>Monarch Core Rank: E</p><p>Strength: F</p><p>Agility: F</p><p>Mana: F</p><p>Stamina: F+</p><p>Intelligence: F</p><p>Luck: E+</p><p>Charm: D+</p><p>Skills: Shadow Walk, Haste</p><p>Physique: Shadow Monarch Physique</p><p>Title: ???</p><p>Job: None</p><p>\"My monarch core directly advanced to E rank instead of F+ rank,\" Evan said when he saw his status window. </p><p>\"But why haven't my stats changed? I can clearly feel that my strength, agility, and other attributes have greatly improved after my monarch core advanced to E rank.\"</p><p>Evan was confused when he saw that his stats hadn't changed, even after his monarch core advanced. </p><p>After thinking about it for some time, he reasoned that his stats will only change when his prime core advance. </p><p>It made sense to him because even before his monarch core formed inside his heart, his status window showed the level of his prime core. Since it was still F rank, it wasn't surprising that his stats hadn't changed.</p><p>\"Even if my status window doesn't show it, I can clearly feel that my body is much stronger now, and my mana capacity has increased significantly,\" Evan said, not dwelling too much on it since it didn't negatively affect him.</p><p>Evan glanced at his status window once again and his mouth twitched a little when he saw that his charm had increased to D+ after his monarch core advanced. </p><p>\"I wonder what those useless male students would do if they saw that I've become even more handsome,\" he mused.</p><p>Evan had often been bullied by both male and female students due to his handsome face. </p><p>For some reason, his charm was too high, even as an F ranker, causing many male students to be jealous. Being weak, he was often bullied because of it.</p><p>\"Well, I don't think anyone will be able to do anything to me now, since I can also improve my power,\" Evan said confidently. He closed his status window and continued absorbing more cores to further enhance his monarch core to D rank.</p><p>Suddenly, when Evan finished absorbing a core, a notification appeared before him. His eyes lit up with excitement as he saw he got another skill. </p><p>This time he got skill after absorbing a shadow core. </p><p>You have learned the skill Shadow Bullet.]</p><p>---) Shadow Bullet: You can shoot a bullet made of shadow using mana. The power of the bullet depends on how much mana you use to cast it. There is a 5% chance that the target will become blind for two seconds after being hit by Shadow Bullet.</p><p>Evan's eyes instantly lit up when he saw the details of the skill.</p><p>\"Awesome!\" he exclaimed after reading the details of the skill. </p><p>He had been hoping to acquire a skill that could help him with long-range attacks, and Shadow Bullet was just perfect for that.</p><p>Evan didn't stop after obtaining the skill. He continued absorbing more cores, and suddenly, when he had only eight cores left, he once again felt a slight pain in his heart. </p><p>A mana whirlpool which was larger than the previous whirlpool formed above his head, and mana started moving towards his body, being absorbed by his monarch core once again. The monarch core rotated faster and absorbed the mana from the whirlpool.</p><p>After some time, the monarch core stopped absorbing mana and released a burst of energy. </p><p>Evan felt his body being strengthened to a new level, and his mana capacity increased greatly. But it didn't end there. As his monarch core advanced to D rank, another notification appeared before him.</p><p>[Monarch core advanced to D rank. You have received the skill Shadow Storage.]</p><p>---) Shadow Storage: A special shadow space where you can store anything that is not alive. The size of the shadow storage depends on your core rank.</p><p>\"I can even acquire skills by advancing my monarch core level,\" Evan said in disbelief. </p><p>Obtaining a skill is very difficult, and only a few people had more than one skill. Yet here he was, having acquired three skills simply by absorbing some cores.</p><p>Evan looked at the remaining eight cores and, after careful consideration, decided to absorb them through his monarch core. </p><p>However, when he tried to absorb the core, he felt severe pain in his chest. The energy of the core approached his monarch core, but this time, his monarch core didn't absorb it. </p><p>When his monarch core did not absorbed the energy, the energy of the core moved towards his prime core and was absorbed by it.</p><p>And to Evan's horror, just as his prime core absorbed the energy, he noticed cracks started to appear all over his prime core, and he felt intense pain in his chest area.</p>", "images": {}, "success": true, "cid": "67155470669904289"}