{"id": 11, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/a-new-physique-(part-1)_67089033968271400", "title": "A New Physique (Part 1)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>A New Physique (Part 1)</h1><p>Evan was laying face first on the ground of the floor room. The hall room was completely dark and there was no light inside it, but it didn't matter to Evan whether the room was dark or bright because after taking that attack head on and crashing against the wall he was barely conscious. </p><p>Blood was flowing out from his wounds and a small puddle of blood formed beneath him. </p><p>Suddenly his blood started to move on its own like it was being attracted by something. </p><p>But because of darkness and his losing consciousness, Evan wasn't able to see it. </p><p>The blood moved deeper into the hall room where a small platform was located. At the centre of the platform, a white magic circle in the shape of an octagram was engraved, and a strange black statue was located at the back of the platform. </p><p>The statue was five meters tall, and its shape was similar to a human but a one meter long horn was coming out from its head. From the features of the statue it was hard to determine whether it was a statue of a male or female. </p><p>Evan's blood moved towards the centre of the platform and came into the contact with the octagram shaped magic circle. </p><p>Just as his blood touched the magic circle, the eight points of the octagram lit up and started to absorb Evan's blood. </p><p>When the magic circle started to absorb blood, its colour also started to change and In just one minute it turned into deep red from its original white colour.</p><p>When the colour of the magic circle turned deep red the eyes of the statue which was located at the back of the platform also lit up in light red colour. </p><p>Just as the eyes of the statue lit up, Evan who was about to pass out because of his injuries heard a voice </p><p>\"What do you want to sacrifice?\" </p><p>*****</p><p>Present Time... </p><p>\"Arghh\" a pain filled scream came out from Evan's mouth when he was engulfed by the black smoke once again. He never felt a pain like this before. He was feeling like someone was tearing him from the inside. </p><p>Suddenly the black smoke which was covering him started to seep inside him through his eyes, nose, mouth, ears and skin. </p><p>The pain of sacrificing his physique was so intense that the pain he felt after getting injured by the bat felt like child's play to him. Black tears started to come out from eyes his staining his face, he wanted to scream because of pain but wasn't able to because of smoke which was filling his mouth. </p><p>After thirty seconds Evan was on the verge of passing out because of the pain, just as he was about to pass out, the smoke started to come out from his body. </p><p>In less than five seconds all the smoke came out from his body and moved away from him. </p><p>\"I have successfully extracted your shadow physique\" Evan heard the same cold voice again. He was laying on the ground breathing heavily and his vision was blurry. </p><p>Evan wanted to curse this bastard, but wasn't even able to move his finger much less curse out loud. </p><p>\"Here are the cores that I promised to give you after taking your physique\" he once again heard the same voice and felt something dropping beside him. </p><p>Hearing the words cores Evan's eyes lit up, and he forgot about the pain he was feeling. </p><p>He wanted to check if he can absorb other cores now that he doesn't have his shadow physique. </p><p>He gathered all his strength and sat down with difficulty. After sitting down when he looked around, he saw black smoke which engulfed him earlier floating some distance away from him. </p><p>For some reason, he was able to see everything in the hall room even though there was no light. </p><p>But Evan didn't care about the black smoke, and was about to check whether he can absorb the other cores when he suddenly felt a sharp pain coming from his heart. </p><p>\"Arghh\" the pain was even more intense than the pain he felt while sacrificing his physique. </p><p>He resisted the pain for some time, but in the end, he passed out because of the pain. </p><p>Just as Evan passed out a black aura erupted from his body covering the entire hall room including the platform and the statue. </p><p>A terrifying pressure engulfed the entire hall room and the walls of the dungeon started to shake. </p><p>When the black aura touched the platform and the statue, both of them immediately turned into dust. </p><p>The black smoke which was hovering not so far away from Evan was also destroyed by the black aura. </p><p>THUMP!! THUMP!! THUMP!! </p><p>Evan's heart started to beat faster and faster in the silent room.</p><p>An illusionary black round ball size of rice grain started to form inside Evan's heart. The small ball was pitch black and was looking like it will engulf everything that will come near it. </p><p>Time continue to pass by and the illusionary black ball slowly started to turn solid. After around thirty minutes the illusionary black ball turned completely solid and was looking like a pitch black marble.</p><p>Just as the black ball turned solid, the black aura which was coming out from his body started to retreat and was swallowed by the strange black ball. </p><p>Even after the black ball was completely formed inside his heart Evan didn't wake up and continue to sleep. </p><p>Many changes appeared on his status window after he sacrificed his shadow physique, and the strange black ball formed into his heart. </p><p>And he will see those changes after waking up.</p>", "images": {}, "success": true, "cid": "67089033968271400"}