{"id": 19, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/mission-hall-(part-1)_67271544560217195", "title": "Mission Hall (Part 1)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Mission Hall (Part 1)</h1><p>When Evan saw how Mike was looking at him, he just sneered. But he also didn't want to involve anyone else in his matter, so he said, \"Yeah, these guys were just asking me for information about some monsters since they want to enter a dungeon. These muscleheads don't pay attention in class and are now asking me about it.\"</p><p>Valery was taken aback by Evan's response because in the past, Evan never said anything against Mike and others whenever they bullied him.</p><p>Although he did not say anything against them, she was still surprised that Evan didn't back away without saying anything.</p><p>There was just one simple reason why Evan never said anything about Mike and his gang. </p><p>He was well aware of his situation—the hunter academy is not a place where you can go and complain to your instructor whenever you get bullied. </p><p>As long as you don't cross the line, even instructors won't do anything. Valery is the monitor of the class, and if Evan complains about Mike to her, Mike and his gang will behave for some time but will harass him again later. </p><p>Besides, he did not want anyone else to get involved in his business, which is why he didn't mention that Mike was picking a fight with him.</p><p>\"You guys better pay attention in class next time. If not, and you come to me again for information about monsters, you will have to pay a price that you might not be able to afford,\" Evan said while patting Mike's shoulder.</p><p>Mike and his gang could only look at Evan with anger-filled eyes but couldn't say anything in front of Valery.</p><p>\"Well, since I've already given you information about the monsters, I'll be on my way,\" Evan said and started walking toward his dorm room.</p><p>'I swear you will regret this,'Mike thought while looking at Evan, who had already started to walk away.</p><p>\"I hope you won't give me a chance to use my authority as the class monitor,\" Valery said as she left.</p><p>\"The show was better than I expected,\" a student said when he saw the sour faces of Mike and his gang.</p><p>\"What show? I'm sure Evan dug his own grave by saying those things earlier. Do you think he'll be fine after saying all of those things to those guys?\" another student said.</p><p>Evan didn't care about what other students were thinking because he was already aware that Mike would try to mess with him again. </p><p>But with his current power, Evan was sure that he would have no problem taking care of Mike and his gang.</p><p>Soon, Evan reached his room. He first took a long bath and cleaned himself properly. While bathing, Evan was finally able to inspect his body.</p><p>His body was perfectly sculpted now compared to his previous skinny build, and his height had also increased by around five centimeters. </p><p>\"Did my body change this much because of the monarch core? I never read about anyone else's body changing this much just by advancing from F rank to D rank.\"</p><p>Evan came out of the bath and looked at himself in the mirror. </p><p>\"My hair turned completely pitch black, and the color of my eye pupils is also darker than before,\" Evan said, admiring himself in front of the mirror.</p><p>After seeing himself in the mirror, Evan wore some clothes and made some noodles to eat.</p><p>\"I will sell those cores tomorrow and definitely go to a restaurant,\" Evan said while eating the noodles with a sour face.</p><p>After eating the noodles, Evan finally lay down on the bed and took out his phone to search for information on how a person can obtain a unique physique. He was still confused about how he got his shadow monarch physique, so he wanted to look on the internet for answers.</p><p>According to the information available on the Internet, there are two know ways for people to have unique physiques.</p><p>First, a person can be born with a unique physique.</p><p>The second way is when a person awakens their ability, like Evan did at the age of fourteen. They can awaken a unique physique along with their ability.</p><p>There may be another way for people to obtain a unique physique, but there was no information on the internet apart from these two ways.</p><p>When Evan read this and thought about these two ways, his eyes opened wide in shock, as he finally realized something.</p><p>The previous Evan was born with a shadow physique, but he did not know about it until he awakened his ability at the age of fourteen because people can't see their status window before they awaken their ability.</p><p>Evan was born with a shadow physique, but after reading the information about physiques on the internet, Evan concluded that when he awakened his ability at the age of fourteen, he also awakened another physique along with his ability.</p><p>The physique he awakened with his ability was the shadow monarch physique. </p><p>But since he already had the shadow physique, a complicated issue occurred in his physique, and he wasn't able to absorb any core other than the shadow core.</p><p>This also explains how he got the shadow monarch physique after sacrificing his shadow physique. </p><p>Since he had two physiques, and he sacrificed one of them, the other physique naturally took over the entire body of Evan, and the problem of him not being able to absorb other cores was also solved.</p><p>\"Damn! To think I suffered this much because I had two physiques is quite absurd,\" Evan was lost for words after realizing this. </p><p>Normally, there is a very low chance that a person will have a unique physique, but he was suffering all this time because he had two physiques.</p><p>Of course, this was all what Evan thought. There may be other reasons why he got the shadow monarch physique, but after reading the details on the internet, Evan was at least eighty percent sure in his guess.</p><p>\"Forget it, who cares how I got this physique. I just have to think about how I can get more cores to improve the rank of my prime core. I want to advance my prime core to D rank before I absorb more energy through the monarch core. I don't want to break my prime core like last time again,\" Evan said while putting away his phone.</p><p>\"I don't want to enter a dungeon currently. I should take a mission from the mission hall of the academy tomorrow,\" Evan said and closed his eyes. He was pretty tired after all the things that happened to him today.</p>", "images": {}, "success": true, "cid": "67271544560217195"}