{"id": 13, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/new-skills-(part-1)_67132457413044137", "title": "New Skills (Part 1)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>New Skills (Part 1)</h1><p>--) Shadow Monarch Physique: One of the forbidden physiques that exist in the world, it allows you to form a monarch core inside your heart. The monarch core can absorb 100% of the power from a core. While absorbing the core, there is a 3% chance that you will receive a skill from the monster the core was extracted from.</p><p>Evan read the details of the physique once again to confirm that he hadn't misread them earlier. </p><p>After reading the details, Evan took out another core and attempted to absorb it. While absorbing the core he focused on the energy that he was absorbing.</p><p>As the energy entered his body, it moved towards his heart, but instead of being absorbed by his monarch core, Evan noticed that it was being absorbed by his prime core.</p><p>Similar to monsters, humans also have a core inside their bodies located near their hearts. Unlike monsters, who have cores specific to their types (e.g., fire monsters having a fire core), humans have a white core called the prime core. To improve their rank, humans must refine this core and increase its rank.</p><p>Currently, Evan's prime core is ranked F, which is why he is an F rank hunter.</p><p>When Evan absorbed the power of the core, he realized that instead of being absorbed by the monarch core, the energy of the core was being absorbed by his prime core.</p><p>\"How am I supposed to absorb energy with the monarch core?\" Evan pondered, puzzled by what he saw. He didn't know how to utilize his monarch core to absorb the energy from the core.</p><p>Evan took out another core and held it near his chest, where his heart was located, but nothing happened. He examined the core carefully and suddenly felt the urge to eat it.</p><p>\"I don't actually have to eat it, right?\" Evan questioned in disbelief when he felt the sudden urge to consume the core. </p><p>\"I would die if I ate a core,\" he recalled from his two years of learning. Eating a core directly would cause the unrefined energy within it to destroy his body from the inside.</p><p>To absorb the energy of a core, one must use mana to refine the core's energy before absorbing it to increase the rank of their core. Eating a core directly without refining it would likely result in death. This made Evan hesitant when he felt the urge to eat the core.</p><p>\"I won't swallow the core, I'll just put it in my mouth,\" Evan decided. And while hesitating, he placed a core in his mouth, ensuring not to swallow it because he knew that if his physique didn't work and he swallowed the core, he would die a horrible death.</p><p>As soon as Evan put the core inside his mouth and it touched his tongue, the monarch core in his heart, which was previously rotating slowly, suddenly picked up speed, as if it sensed something. </p><p>And just as the monarch core started rotating faster, the core in Evan's mouth began to melt.</p><p>Evan was shocked by the sudden turn of events, and before he could react, the core he placed in his mouth disappeared and transformed into pure energy that started moving toward his heart.</p><p>Evan could feel the energy of the core approaching his heart, but this time, instead of going to the prime core, the energy entered his heart and was absorbed by his rotating monarch core.</p><p>As the monarch core absorbed all the energy, Evan felt his body growing stronger. It was evident that the monarch core absorbed all the energy from the core without wasting any, unlike the prime core.</p><p>\"So, this physique really allows me to absorb 100% of a core's energy,\" Evan exclaimed with delight after successfully absorbing 100% of the core's energy.</p><p>But suddenly, Evan thought about something, and his eyes widened in shock. </p><p>\"It can't be, right?\" Evan said, his voice filled with disbelief. He took out another core and put it into his mouth, just as he had done before. The core transformed into pure energy and was absorbed by his monarch core.</p><p>Evan felt his body growing stronger once again after absorbing the core.</p><p>Encouraged by his success, Evan took out yet another core. </p><p>But this time instead of putting it in his mouth, Evan used his mana to refine it, and the energy of the core was absorbed by his prime core. He felt his body becoming slightly stronger, even though the progress was not even half as effective as with his monarch core.</p><p>\"I can truly enhance my power by increasing the ranks of both of my cores,\" Evan said excitedly. </p><p>Unlike others who could only grow stronger by increasing the rank of their prime core, Evan possessed two cores and could amplify his power through increasing the rank of both of his cores. This meant he would be far more powerful than a normal hunter of the same rank.</p><p>\"I will need to use more cores than regular people since I have to improve the ranks of two cores instead of one. But now that I can absorb any core just like others, it won't be a problem for me. Besides...\" Evan glanced at the storage ring in his hands and a smile appeared on his face. \"I think these cores are enough to increase the rank of my monarch core to D rank, since it can absorb 100% energy from a core.\"</p><p>Evan decided to prioritize increasing the rank of his monarch core first, because unlike his prime core it could absorb 100% of a core's energy. Additionally, there was a 3% chance that he would acquire a skill from a core, further enhancing his power.</p><p>With this decision in mind, Evan wasted no time and started putting cores, one after another, into his mouth.</p><p>When Evan absorbed the 12th core, the 3% chance of obtaining a skill from the core was finally triggered, and a notification appeared before him.</p>", "images": {}, "success": true, "cid": "67132457413044137"}