{"id": 17, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/coming-back-to-academy_67224907406177711", "title": "Coming Back To Academy", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Coming Back To Academy</h1><p>\"Looks like that kid died in the dungeon,\" the guard who had warned Evan when he entered the dungeon said.</p><p>\"Many ignorant people like him die every day because they overestimate themselves and enter dungeons that are of higher rank than they can handle,\" the other guard said, shaking his head.</p><p>\"According to the card he showed, he was a student of Astrate Hunter Academy. I wonder what they are teaching the students there.\"</p><p>\"You can't expect them to pay attention to every student. There are hundreds of people who awaken their abilities and join the Hunter Academy. If a student overestimates themselves and enters a dungeon that is higher level than them, you can't blame the academy for it.\"</p><p>\"I wonder if he informed his teachers that he would be entering a D rank dungeon,\" the guard said.</p><p>\"We already know his name. We'll do our duty and inform the academy about him if he doesn't come out before tomorrow,\" the second guard said, yawning.</p><p>Suddenly, the entrance portal of the dungeon flashed. When both guards, who were in conversation, looked at the portal, they saw a boy in tattered clothes stained with blood emerging from it.</p><p>Even though the boy was wearing tattered, blood-stained clothes, he still looked devilishly handsome. His pitch-black hair waved in the cold night wind. The guards were momentarily stunned as they observed Evan, for he looked completely different than before.</p><p>\"Who is this guy, and how did he enter the dungeon without us noticing?\" one of the guards asked upon seeing Evan.</p><p>\"Idiot, he's the same F-rank student who entered a few hours ago,\" the guard who had warned Evan replied. He remembered Evan's face clearly, and even though Evan looked completely different now, he could still recognize him.</p><p>\"What?\" the guard exclaimed, scrutinizing Evan's face. \"How the hell did his appearance change this much?\" he asked, his expression filled with astonishment as he, too, recognized Evan.</p><p>After emerging from the dungeon, Evan walked towards the gate where the guards were standing. When he approached them, he nodded at them with a small smile.</p><p>\"Hey, what happened to you?\" one of the guards asked Evan.</p><p>Evan was initially confused but then remembered that his appearance had changed significantly due to his core advancement. His once skinny body had gained muscle, and his height and charm had increased. In essence, he looked completely different from before.</p><p>\"I just got lucky, and my core advanced to E rank, which is why my appearance changed a little,\" Evan explained, scratching the back of his head.</p><p>The guards were stunned upon hearing this, as they had never seen someone's appearance change so drastically after advancing from F rank to E rank. However, they couldn't find any other reason for Evan's sudden transformation, so they were unable to say anything further.</p><p>\"You're lucky you didn't die in the dungeon. Next time, only enter a dungeon according to your rank,\" the guard advised when he noticed Evan's tattered and blood-stained clothes.</p><p>\"Thanks for the advice. I'll keep it in mind,\" Evan replied politely and began to walk away. This time, the guards did not stop him.</p><p>Evan waved his hand when he spotted a taxi, and the driver pulled over. \"Astral Hunter Academy,\" Evan requested.</p><p>\"Are you a student at the Hunter Academy?\" the driver asked as he drove towards the academy. He wasn't surprised by Evan's tattered clothes, as they were near the Shadow Kingdom Dungeon, and many hunters emerged with similar appearances after battling inside.</p><p>\"Yes, I'm in my final year,\" Evan replied to the taxi driver.</p><p>\"Sigh, I also wanted to become a hunter but wasn't able to awaken any ability,\" the driver lamented.</p><p>Evan did not say anything in response to the driver's remark, as he was already aware that very few people were able to awaken their abilities.</p><p>The driver fell silent after that, focusing on driving Evan to the academy. Meanwhile, Evan sat in the back, reflecting on the events that had transpired earlier that day. He was particularly puzzled about how he had acquired the Shadow Monarch Physique after sacrificing his Shadow Physique. He was certain that the person who had taken his physique was not the one who had bestowed the Shadow Monarch Physique upon him.</p><p>\"I'll have to find out how people can obtain a physique,\" Evan said to himself, thinking about looking into the details of the physiques once he returned to the academy.</p><p>\"Although my power is now even higher than that of a D ranker, the aura emanating from my body still reflects the strength of an E-ranker,\" Evan mused. </p><p>His Monarch Core was completely dormant, not emitting any aura, so anyone who saw him would assume he was an E-rank hunter.</p><p>Evan felt content with this fact, as he had no intention of revealing his Shadow Monarch Physique to anyone. The details he had come across described it as a forbidden physique, and he wanted to ensure that no one else knew about it.</p><p>After a two-hour journey, Evan finally arrived at the academy. He paid the taxi fare and stepped out of the vehicle.</p><p>\"I'm almost out of money. I'll have to sell these cores, or I won't even have enough to buy cup noodles,\" Evan sighed, contemplating his financial situation, as he entered the academy.</p><p>Inside the academy, there weren't many students around, as it was nighttime, and most of them were either training or asleep. </p><p>However, there were still a few students who caught sight of Evan. With his strikingly handsome face and blood-stained, tattered clothes, he stood out.</p><p>\"Who's that guy? Is he also a student?\" one male student wondered upon seeing him.</p><p>\"He might be a new student who forgot to bring spare clothes when he entered a dungeon,\" another student speculated.</p><p>\"I think I've seen him somewhere before,\" a student remarked, staring at Evan. Suddenly, his eyes widened, and he exclaimed, \"Isn't he that trash Evan?\"</p><p>As the other students heard this, they, too, were taken aback. They looked at Evan's face and recognized him, as Evan was famous throughout the academy for being the weakest student.</p><p>\"What happened to him?\" the students murmured in shock, witnessing Evan's dramatic transformation.</p><p>Anticipating this reaction, Evan simply ignored them and continued walking toward his dorm room.</p><p>\"Evan?\" However, Evan stopped in his tracks when he heard someone call his name from behind. A cold glint flickered in his deep black eyes upon hearing the voice.</p><p>Evan turned around and saw four individuals approaching him. The person who had called him was a muscular man, resembling a bodybuilder, and he walked at the front of the group. The other three men followed closely behind, appearing like third-rate street thugs who extorted money from people.</p><p>\"Mike,\" Evan muttered the name of the muscular man as he recognized him.</p>", "images": {}, "success": true, "cid": "67224907406177711"}