{"id": 15, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/testing-new-skills-(part-1)_67178682535431218", "title": "Testing New Skills (Part 1)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Testing New Skills (Part 1)</h1><p>Evan's prime core absorbed all the energy that he wanted to refine through his monarch core. When his prime core absorbed all the energy, it became filled with many cracks, and Evan started panting heavily due to the pain in his chest area.</p><p>\"What the hell was that?\" Evan said after some time, when the pain in his chest area lessened a bit.</p><p>Evan checked his prime core and was horrified to see many cracks all over it. Quickly, he took out another core from his storage ring, refined it using his mana, and used the energy of the core to heal his prime core.</p><p>As the refined energy approached his prime core, it started to heal the cracks. When he absorbed all the energy of the core, all the cracks on his prime core disappeared, and it also advanced to F+ rank.</p><p>Evan let out a sigh of relief when the cracks on his core were healed, and his prime core advanced to F+ rank. His prime core had almost shattered because it couldn't handle the unrefined energy that Evan had absorbed directly.</p><p>\"Why did my monarch core stop absorbing more energy?\" Evan was confused by this sudden turn of events. He opened his status window and looked at his progress.</p><p>Name: Evan</p><p>Rank: F+</p><p>Monarch core rank: D</p><p>Strength: F+</p><p>Agility: F+</p><p>Mana: F+</p><p>Stamina: F+</p><p>Intelligence: F+</p><p>Luck: E+</p><p>Charm: C</p><p>Skill: Shadow Walk, Haste, Shadow Bullet</p><p>Physique: Shadow Monarch Physique</p><p>Title: ???</p><p>Job: None</p><p>After seeing his status window and how his monarch core directed the energy towards his prime core, Evan concluded that to increase the rank of his monarch core, he first had to increase the rank of his prime core.</p><p>\"I still have some cores left in my storage ring. These cores should be enough to advance my prime core to E rank,\" Evan decided to improve the rank of his prime core since he was unable to absorb energy using his monarch core.</p><p>At first, Evan thought that his monarch core would advance easily since it could absorb 100% of the energy from a core. But when he started absorbing, he found out that even though his monarch core could absorb 100% of the energy, it still required more cores than his prime core.</p><p>However, Evan was not bothered by this because he could feel that every time his monarch core advanced, he received a great boost in power that his prime core could never provide.</p><p>Evan absorbed his remaining cores, and as he expected, his prime core advanced to E rank when he finished absorbing all the cores he had received after sacrificing his shadow physique.</p><p>When his prime core advanced to E rank, Evan felt his body being strengthened to another degree, and he couldn't help but let out a sigh of satisfaction as he felt the boundless power coursing through his body.</p><p>Name: Evan</p><p>Rank: E</p><p>Monarch core rank: D</p><p>Strength: E</p><p>Agility: E</p><p>Mana: E</p><p>Stamina: E</p><p>Intelligence: E</p><p>Luck: D</p><p>Charm: C</p><p>Evan checked his stats and was surprised to see that his charm had not increased after his prime core advanced to E rank. </p><p>He closed his status window and finally stood up after finishing absorbing all the cores.</p><p>Evan felt a little odd when he stood up because his height, which was previously 180cm, had now increased to 185cm. But he quickly adjusted to it and looked at the crumbled wall from which he had fallen into the odd hall room.</p><p>Evan examined the hall room but found nothing other than a small mountain of dust that had formed after the statue and the platform had turned into dust because of the black aura that erupted from his monarch core when it was formed.</p><p>Not finding any trace of the person who had spoken to him, Evan started walking outside the hall room.</p><p>However, Evan had to close his eyes for some time after coming out because the hallway was too bright, and he felt like he was looking directly at the sun. </p><p>After a while, his eyes adjusted to the light, and when he looked back at the hall room behind the crumbled wall, he was surprised to find that the entire room was completely dark. Yet, he could still see everything clearly.</p><p>\"I also gained night vision,\" Evan thought when he realized he could see even in complete darkness.</p><p>As he emerged from the hall room through the crumbled wall, he saw the corpse of the bat that had almost killed him with its last attack.</p><p>Once his eyes were fully adjusted to the light, Evan approached the bat's corpse. His sword was stuck in its head, indicating that the bat had died from the sword attack Evan had delivered at the last moment.</p><p>Evan went near the bat's corpse and pulled out his sword.</p><p>To his surprise when he looked for the core, he found a core inside the bat's body. </p><p>Happily, he put the core away in his storage ring along with the other three cores he had obtained earlier by killing monsters. </p><p>He hadn't absorbed these cores because, although he now had enough strength to enter the dungeon without the invisibility potion, he still wanted to sell some cores to earn a little money. His bank account had almost emptied when he purchased the invisibility potion to enter the dungeon.</p><p>\"I think my days of living on cup noodles are over now,\" Evan said with an emotional tone. For the past two years, he had been forced to eat cup noodles every day while saving money.</p><p>\"After selling the cores, I will definitely go to the most famous restaurant to eat something,\" Evan said, starting to walk towards the exit of the dungeon.</p><p>When Evan was just 700 meters away from the exit portal, he saw a lion-like monster, two meters tall, blocking his way. However, instead of feeling the fear he had felt when he saw the bat, this time Evan didn't even flinch and continued to walk towards the lion with steady steps. For some reason, when he saw the shadow lion monster, he didn't feel an ounce of threat from it.</p><p>Evan also wanted to test his current power, so he calmly walked towards the lion. When the lion sensed Evan's presence, it looked in his direction. As its deep yellow eyes met Evan's pitch black eyes, for some reason, the lion felt the shadow power inside its body tremble, as if it had been affected by those deep black eyes.</p>", "images": {}, "success": true, "cid": "67178682535431218"}