{"id": 10, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/fight-to-death_67062487832380591", "title": "Fight To Death", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Fight To Death</h1><p>While running towards the falling bat, Evan imbued some mana into the second stone in his hand, and just like before threw it towards the falling bat.</p><p>The stone hit the bat right at the centre of its stomach blowing out all the air from its lungs.</p><p>Even though like last time the stone wasn't able to pierce through its defence, the pain of being hit by mana imbued stone still made it shriek in pain.</p><p>Thump!!</p><p>With a loud thumping sound, the two meters long bat dropped to the ground.</p><p>Just as it dropped to the ground Evan came before it wanting to slash it with his sword. </p><p>But after dropping from the sky, the bat reacted fast enough and swept at Evan with its two meters long tail. </p><p>Evan didn't think that the bat will recover so soon after getting hit by stones and dropping from the sky, so he was not prepared for the sudden attack. </p><p>Seeing the claw like tail coming towards him like a whip, Evan lifted his sword in front of him trying to block the attack. </p><p>The tail of the bat clashed against the sword and Evan felt a terrifying force transmitted to his hands through the sword. </p><p>The power of the D rank bat was too much for Evan who was just an F rank hunter. </p><p>Because of the powerful impact, Evan was sent flying backwards, he felt his hands turning numb because of the impact and he was sure that if the impact was a little more powerful his hands would have been fractured. </p><p>After being blasted away Evan crashed five meters away from the bat feeling a terrible pain all over his body. </p><p>'It was just a casual attack from its tail, but it nearly broke the bones of my hands even though I blocked it with the sword' Evan thought while trying to stand up. </p><p>A faint tickle of blood was coming out from the corner of his mouth, and a metallic taste filled his mouth. </p><p>While trying to stand up he looked at the bat and saw it already recovered from the impact of dropping from the sky. </p><p>Even though its forehead was still bleeding because of his earlier stone attack, it was clear that this injury was nothing for the bat. </p><p>After recovering, the bat flapped its wings and flew up once again. From above it glared at Evan with its crimson-red eyes which were filled with coldness. </p><p>When Evan saw the bat once again fly up he can't help but curse inwardly feeling extremely annoyed. </p><p>Suddenly the bat flapped its wings and disappeared from its place. The speed of the bat was so that even before Evan can react it arrived before him slashing at his neck with its sharp claw. </p><p>Evan's eyes trembled seeing the bat suddenly appear before him and he tried to step aside.</p><p>Because of his quick reaction, the claw of the bat missed his neck but slashed at his shoulder. </p><p>\"Arghh\" Evan cried out in pain as blood spurted out and a large portion of his shoulder was ripped apart. </p><p>Because of the impact of the claw, Evan lost his balance while trying to dodge the attack and fell to the ground face-first. </p><p>Even though he was feeling a burning sensation on his shoulder e quickly tried to stand up after falling down. </p><p>But before he can stand up the bat dived down towards him from the sky and dug its sharp claw into his back. </p><p>\"Arghh\" Evan cried out in pain as the bat started to absorb his blood through its claw. </p><p>Evan tried to escape from it, but it attached itself to his back through its sharp claw. </p><p>He was already losing blood because of the wound on his shoulder, so when the bat started to absorb his blood he started to feel dizzy. </p><p>Even though he already expected he won't be able to escape from the bat after it discovered him, Evan was still unwilling to die just like this. </p><p>\"Fu*k you, even if I am going to die here, I will take you with me\" Evan suddenly shouted in a rage-filled voice and used his skill shadow walk. </p><p>---) Shadow Walk :- Your body will turn into a shadow and you can pass through any barrier or restrictions without being hindered.</p><p>The next second the bat dropped to the ground when Evan suddenly disappeared. </p><p>After freeing himself from the bat Evan quickly returned back to normal because his skills consumes too much mana, and if he runs out of mana he will start to feel dizzy. </p><p>In his current condition if he runs out of mana Evan was sure that he will definitely pass out.</p><p>After returning to normal, Evan used his sword and stabbed at one of the eyes of the bat. </p><p>The bat was still confused because of Evan's earlier disappearance and wasn't able to react on time. </p><p>Shriek -!! </p><p>The bat shrieked out in pain as one of its eyes exploded and red blood flow out uncontrollably. </p><p>But Evan didn't stop there and quickly pulled back his sword. </p><p>There was a big hole in his back and blood was flowing out from it without stopping, his shoulder was also wounded and was bleeding heavily. </p><p>But Evan ignored all of this and poured his remaining mana into his sword. </p><p>A light blue layer of mana appeared around his sword and Evan slashed at the neck of the bat with maddened eyes. </p><p>The bat felt the danger of death from Evan's sword and at the last moment used its long tail to stop the sword. </p><p>The sword and tail clashed once again, and Evan felt his hands turning numb. </p><p>But unlike last time he wasn't sent flying, instead, the tail of the bat was severed into two because of the increased power of his sword. </p><p>Shriek -!!</p><p>The bat shrieked in pain as the fountain of red blood erupted from the severed tail of the bat. </p><p>Evan used almost all of his mana in his earlier attack, and now he started to feel dizzy. </p><p>But he knew it is a crucial moment so he forced himself to not pass out, and stabbed at the second eye of the bat with his shaking hands. </p><p>The bat was still shrieking in pain because of its severed tail and didn't react on time and its second eye was also destroyed by Evan. </p><p>After stabbing the sword Evan was almost on the verge of passing out because of his low mana and injuries. </p><p>'Just one more attack and it should be over' Evan thought with a fuzzy mind and was about to attack once again when the bat suddenly opened its mouth. </p><p>Even though he was dizzy Evan quickly reacted and thrust his sword inside the open mouth of the bat using all of his mana. </p><p>Although he reacted quickly and his sword dug deeper into the mouth of the bat, it was still able to release powerful sound waves from its mouth. </p><p>Evan was standing very close to the bat and had no chance of dodging its attack.</p><p>The sound waves struck Evan like a tsunami, and he was sent flying backwards like a broken kite and his body clashed against the dungeon wall. </p><p>The speed at which Evan clashed against the wall was so fast that the wall of the dungeon wasn't able to handle the impact and crumbled upon impact. </p><p>Evan fall inside the gap which appear after the wall of the dungeon crumbled and found himself laying on the cold floor of a hall room.</p>", "images": {}, "success": true, "cid": "67062487832380591"}