{"id": 22, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/first-mission_67329020097782357", "title": "First Mission", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>First Mission</h1><p>Since we will be working with each other until this mission ends, let's introduce ourselves. I am George, a D-rank hunter,\" one of the hunters who came from the association said.</p><p>\"I am Dean, also a D-rank hunter.\"</p><p>\"James, D-rank,\" James replied with a flat voice.</p><p>\"I am Evan, an E-rank hunter,\" Evan said without much interest.</p><p>Everyone was surprised after hearing Evan's rank, but the most surprised person was obviously James because everyone in the academy knows that Evan is an F-rank hunter.</p><p>\"You are quite brave to take on a mission like this when you're just an E-rank hunter,\" Dean said after hearing Evan's rank.</p><p>\"You can say that,\" Evan replied to Dean with a light smile.</p><p>\"You are from the academy, right? You must be quite famous in the academy with this kind of face,\" George said with a jealous voice when he saw Evan's handsome face.</p><p>When Evan heard this, his eyes twitched. \"Yeah, I'm pretty famous in the academy,\" Evan said, as everyone in the academy knows about him. After all, he got the title of the weakest hunter in the academy.</p><p>\"So, what do we have to do? This is my first time doing a mission like this. I thought the van would be slower, and we would have to protect it against monsters. But looking at the speed of the van, I'm sure even a D-rank monster would have a hard time catching up,\" Evan asked with a confused voice.</p><p>\"Oh, it's your first mission. Well, let this senior give you a brief summary then,\" Dean said with an old man-like expression.</p><p>\"It will take us two days to reach our destination, and they can't drive continuously for two days. They will eventually stop to rest, and that's when there is a high chance that monsters will attack them.\"</p><p>\"Monsters are one thing, but there are also bandits who rob merchants whenever they get a chance. These bandits are more dangerous than monsters because, unlike monsters, they can use tools that can negate the barrier and other functions of this van.\"</p><p>Evan was surprised and a bit concerned that they might have to face a bandit higher than D rank, but after hearing Dean's next words, Evan relaxed.</p><p>\"Although these bandits are dangerous, you will not find anyone higher than D rank since the association clears these areas every month.\"</p><p>\"And it's not impossible for monsters to catch up with us even when we are going at a pretty fast speed. There are some monsters like Sky Eagles and Forest Tigers who can easily catch up with us with their speed,\" George added when Dean finished his explanation.</p><p>Evan nodded and understood what they had to do during the mission. Everyone stopped talking after this. George and Dean closed their eyes and did not say anything.</p><p>James sat silently, not saying anything after introducing himself to George and Dean.</p><p>Evan looked outside from the window with a bored look, but suddenly he saw someone following them.</p><p>Evan looked carefully and saw five monsters chasing the van. Their speed was also quite fast, and they looked like hyenas. All five monsters were two meters tall, and their fur was light brown.</p><p>\"There are five monsters chasing us,\" Evan said while looking out the window.</p><p>Dean opened his eyes and looked outside. \"These are wild hyenas. Although they are fast, they will not be able to catch us.\"</p><p>Evan nodded when he heard this because he could also see that the speed of the hyenas was getting slower as time passed. Unlike the van that runs with the help of cores, the monsters were spending their stamina to catch them.</p><p>\"If you're bored, you can look outside using that,\"</p><p>:</p><p>Evan heard George's voice, and saw him pointing his finger towards the roof of the van.</p><p>When Evan looked at the roof of the van, he saw a slider there. Evan stood up, pushed the slider forward, and brought his head outside the roof of the van.</p><p>The barrier of the van was currently deactivated to save energy. Only when a monster came near the van did they activate the barrier.</p><p>Evan felt the cold morning wind as he brought his head outside the van. \"The air is quite fresh here,\" Evan said, enjoying the cold wind.</p><p>Evan was enjoying the view when he suddenly saw another group of hyenas start to chase after them. He glanced at James and the other hunters to confirm that they weren't looking outside.</p><p>Once he confirmed they weren't looking, a smile appeared on Evan's face. \"Since I'm getting bored, I should practice with Shadow Bullet.\"</p><p>Evan pointed his finger towards one of the hyenas chasing them. \"Shadow Bullet.\"</p><p>A pitch-black small bullet formed before Evan's pointed finger and shot toward one of the hyenas at lightning speed.</p><p>Swish!</p><p>The bullet arrived before the hyena in the blink of an eye and pierced through its forehead. However, Evan didn't use much mana in the bullet, so it didn't penetrate too deep. Nevertheless, the running hyena dropped to the ground when the bullet struck it.</p><p>Howl~~~</p><p>[The blinding effect of Shadow Bullet activated. Your target is blinded for two seconds] </p><p>A notification appeared before Evan informing him about the blinding effect of his shadow bullet.</p><p>Evan was surprised when he saw that even the blinding effect of his Shadow Bullet activated.</p><p>--- Shadow Bullet: You can shoot a bullet made of shadow using mana. The power of the bullet depends on how much mana you use to cast it. There is a 5% chance that the target will become blind for two seconds after being hit by Shadow Bullet.</p><p>The hyena howled in pain upon being struck by the bullet. The loud howl caught the attention of George and the others, who quickly looked outside.</p><p>\"What happened?\" Dean asked, looking at Evan, as he was the only one looking outside.</p><p>\"Nothing. That hyena suddenly fell while running and crashed against a rock,\" Evan replied without looking at them.</p><p>When Dean and the others heard this, they stopped looking outside and closed their eyes once again.</p><p>\"I completely forgot that they will definitely make a loud sound after getting hurt,\" Evan said, sighing in relief.</p><p>He didn't use Shadow Bullet again, and after six hours of continuous travel, the driver finally stopped the van to take some rest.</p>", "images": {}, "success": true, "cid": "67329020097782357"}