{"id": 25, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/night-fight-(part-1)_67375255135518274", "title": "Night Fight (Part 1)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Night Fight (Part 1)</h1><p>\"I never saw an E-rank hunter as powerful as you,\" Henry said to Evan. He had already come out from the van along with his driver after Evan took care of the monsters.</p><p>\"Thanks,\" Evan replied to him without much interest. Only Henry was talking with Evan. Dean and George, who were previously chatting with hik casually were now looking at him warily.</p><p>Evan understood their situation. If he was in their place, he would also feel suspicious of someone who, as an E-rank, killed three D-rank monsters without breaking a sweat.</p><p>But currently, he could not care less about them because he was thinking about the thin black layer that appeared on his sword earlier.</p><p>'Just what was that black energy? The power of my attack increased too much because of it,' Evan thought to himself. He had already checked his status window, but there was no information about that black energy.</p><p>'Is this also related to my Monarch Core?' Evan thought and sighed because there were still many things that were unclear about his new physique.</p><p>'Forget it. There are too many things that I don't know about this Monarch Core. I will eventually figure out everything,' Evan thought and stopped dwelling on the black energy.</p><p>\"When will we leave from here?\" Evan asked Henry.</p><p>\"Let's rest for one more hour before leaving.\"</p><p>\"Alright,\" Evan nodded and continued to guard their surroundings. He felt quite awkward because, after witnessing his strength, other hunters were looking at him warily.</p><p>'I bet they must be thinking I was hiding my strength to backstab them later and rob their belongings,' Evan thought, rubbing his temples.</p><p>\"Alright, let's go. We still have quite a distance to cover,\" Henry shouted as his driver packed up the barbecue and other equipment.</p><p>After five minutes, everyone sat down in the van, and it started moving toward Oklima City.</p><p>\"I know why you guys are suspicious and looking at me like this, but I have no intentions of harming you. So stop treating me like your lifelong enemy,\" Evan said to the others after the van started moving again.</p><p>Dean and George hesitated for a bit upon hearing Evan's words. When Evan saw this, he sighed and did not say anything.</p><p>\"Although I didn't talk to him much in the academy, I can say that he's a good person. So you should stop being suspicious of him, or we might be in danger while facing other monsters,\" James suddenly spoke up, his eyes still closed.</p><p>When George and Dean heard this, they looked at each other and nodded. \"Alright, we will trust you, but I hope you won't do anything suspicious.\"</p><p>\"Don't worry, I just wanted to take a break from the academy and collect some cores. I don't have any other motives for coming here,\" Evan assured them.</p><p>\"Collect some cores? With your strength, you can easily collect cores from a D-rank dungeon,\" Dean commented upon hearing Evan's words.</p><p>\"My situation is a bit complicated, so don't mind me,\" Evan replied without explaining further. After all, he couldn't reveal that just two days ago, he was an F-rank hunter who couldn't increase his power due to his physique.</p><p>James listened quietly but did not say anything.</p><p>\"By the way, I saw you using two skills when you were fighting those monsters. Did you get a skill book in the past after clearing a dungeon, or did you awaken two skills at the same time?\" George asked curiously, trying to change the atmosphere.</p><p>Dean and James also looked at Evan curiously because it was very rare for people to have more than one skill.</p><p>While it's possible to get a skill book as a reward after clearing a dungeon, it is extremely rare and can be sold for millions of credits, depending on the type of skill. Dean and George, as normal hunters can't even imagine buying a skill book.</p><p>\"Yeah, I got lucky last time when I cleared a dungeon and received a skill book,\" Evan said with a slight smile. There was no way he was going to tell anyone that he could obtain skills just by absorbing the energy of the cores.</p><p>He knew his life would be in danger if other people knew about his physique, which could essentially turn the evolving system of Arora's world upside down. That's why Evan did not use his Shadow Bullet skill during the fight since it would be suspicious if he used too many skills.</p><p>\"I also cleared some dungeons with my friends, but we never received a skill book,\" Dean said in an envious tone after hearing Evan's explanation.</p><p>Both Dean and George believed Evan's story that he obtained his skill from the dungeon. Only James looked at him suspiciously because, like everyone in the academy, he knew that Evan had never gone into a dungeon with anyone.</p><p>But even if he was suspicious, there was nothing he could do about it.</p><p>The rest of the day passed without any problems, and soon the sun was about to set.</p><p>\"Let's make camp here since the sun is about to set,\" Henry announced, and no one objected since setting up camp in the dark would be challenging.</p><p>The van came to a stop, and everyone got out. \"You two, guard here. Evan and I will check the surroundings,\" George said to Dean and James after stepping out of the van.</p><p>\"Be careful; it will be dangerous since it's already getting dark,\" George warned Evan seriously.</p><p>Evan nodded in understanding. However, he wasn't concerned because even in the darkness, he can see clearly, thanks to his Monarch Core. In fact, he felt like his vision is even better during the nighttime.</p><p>'A true Monarch physique,' Evan thought when he realized he could see in low light without any problems.</p><p>Evan and George began scanning their surroundings. They positioned themselves about a hundred meters apart to cover more ground and provide mutual assistance if needed.</p><p>Evan gripped his sword tightly, keeping a watchful eye on his surroundings. Despite his strength, he knew that arrogance and complacency can be his downfall if he don't remain vigilant.</p><p>Suddenly, Evan heard the sound of someone approaching from his right side. He quickly turned his gaze in that direction, and just as he did, a rabbit leaped out from the bushes.</p><p>The rabbit appeared normal in size, but what set it apart from regular rabbits was the horn protruding from its head.</p><p>\"A horned rabbit,\" Evan exclaimed, surprised to see a horned rabbits since they are quite rare.</p><p>According to what Evan had read on the Internet, the meat of horned rabbits is very delicious, but they are notoriously difficult to catch due to their exceptional evasiveness.</p><p>Without wasting any time, Evan aimed his finger at the horned rabbit and unleashed a Shadow Bullet. Since the rabbit was merely an E-rank monster, it couldn't dodge the bullet and died instantly as the projectile pierced through its brain.</p><p>\"Looks like I'll finally get to taste what horned rabbit meat is like,\" Evan said as he picked up the small body of the rabbit. </p>", "images": {}, "success": true, "cid": "67375255135518274"}