{"id": 20, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/mission-hall-(part-2)_67294614188516464", "title": "Mission Hall (Part 2)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Mission Hall (Part 2)</h1><p>The next day, after breakfast, Evan came out from the boys' dormitory and headed towards the mission hall.</p><p>The mission hall is the place where students of the hunter academy can take on different types of missions and earn mission points. There are many types of missions available in the mission hall of the academy.</p><p>Most of these missions are issued by normal people who are not hunters. These missions are not very dangerous because their primary purpose is to train and teach the students.</p><p>Evan arrived at a two-story building where many students were entering and exiting. He went inside the building and saw several receptions where students were talking with the receptionists and choosing the most suitable missions for them.</p><p>Evan approached a male receptionist and asked, \"Do you have any D-rank missions?\"</p><p>\"Can you show me your hunter card provided by the academy?\" the receptionist asked, as he could only show missions after confirming Evan's rank.</p><p>Evan handed his hunter card to the receptionist. When the receptionist saw that Evan was an F rank hunter, he looked at him weirdly and said, \"Sorry, but with your current rank, I can't show you D-rank missions. They will be very dangerous for you, and even the person who issued the mission may face problems because of this.\"</p><p>\"I understand, but I have already advanced to E-rank. I just haven't updated my card because I was busy. According to the rules, I can accept missions that are one rank higher than mine, right?\" Evan calmly replied upon hearing the receptionist's concerns.</p><p>\"Can you please place your hand on this orb so I can confirm your rank?\" The receptionist took out a white orb the size of a football and placed it in front of Evan.</p><p>Evan was already aware of this orb. It could show his rank when he placed his hand on it. Though he wasn't sure how it worked, the book mentioned that the orb would react to the energy of his prime core and display his current rank.</p><p>Evan placed his hand on the ranking orb and felt a strange energy entering his body through it. The energy travelled towards his prime core and, after rotating around it, returned to the orb.</p><p>When the energy returned, the orb lit up and displayed the letter 'E' in green. The receptionist put away the orb and said, \"Alright, I can show you the D-rank missions. Please wait a moment.\"</p><p>The receptionist took out some papers and filtered the D-rank missions suitable for Evan. He then handed them to him.</p><p>Evan took the papers and looked at the missions:</p><p>--) Bring the five teeth of a fire sabertooth tiger. Reward: 15 mission points.</p><p>--) Eliminate the members of the hawk bandit group. Reward: 15 mission points.</p><p>--) Collect five stalks of moon grass from the night forest. Reward: 20 mission points.</p><p>--) Exterminate goblins near the Stellar region. Reward: 15 mission points.</p><p>Bring - - -</p><p>There were many missions, and most of them offered a reward of 15 mission points. Evan could use these mission points to purchase weapons, potions, cores, and other items from the academy.</p><p>The Rank Two Invisibility Potion that Evan bought with thirty thousand credits could be obtained with 50 mission points.</p><p>Evan looked through the missions but couldn't find one to his liking. However, he suddenly spotted a mission and stopped:</p><p>--) Safely transport the goods to Oklima City from Astrate City. Reward: 20 mission points.</p><p>\"Oklima City... If I'm not mistaken, I'll have to pass through the wild region to reach there. I'll likely encounter many monsters living in the wilderness if I choose this mission,\" Evan thought as he read the mission details.</p><p>Evan contemplated for a while and finally decided to accept the mission. \"I would like to accept this mission,\" Evan said, handing the paper back to the receptionist.</p><p>\"Are you sure? Although this is a D-rank mission, the difficulty is very high. There are many D-rank monsters in the wild region,\" the receptionist warned upon seeing Evan's choice.</p><p>\"Yes, I'm sure. Can you provide me with the mission details?\" Evan replied confidently.</p><p>The receptionist didn't say anything in response. He looked at his computer for the mission details. After finding the information, he printed it out and handed it to Evan. As Evan glanced at the details, his eyebrows raised. \"There will be three other hunters accompanying me, and the mission will start tomorrow,\" he noted.</p><p>Evan hadn't expected other hunters to be involved, but upon careful consideration, he realized it was only natural. In the wild region, numerous monsters lurked, and a single hunter couldn't handle everything alone unless they were of very high rank.</p><p>\"Let's go to the market and buy some things that will help me on this mission,\" Evan thought to himself. After thanking the receptionist, he left the mission hall.</p><p>Instead of returning to his room, Evan left the academy and took a taxi to the city plaza, where he had previously purchased the invisibility potion.</p><p>Evan had come to sell the cores he had saved after killing the monsters in the Shadow Kingdom Dungeon. He entered the plaza and took the lift to the tenth floor, where people buy and sells the cores.</p>", "images": {}, "success": true, "cid": "67294614188516464"}