{"id": 23, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/these-d-rank-monsters-are-too-weak-(part-1)_67347491678383127", "title": "These D-Rank Monsters Are Too Weak (Part 1)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>These D-Rank Monsters Are Too Weak (Part 1)</h1><p>\"Let's take a short break here,\" Henry said to Evan and the other hunters after stopping the van.</p><p>\"Evan and I will stay here to protect Henry and the cargo. You two should scout our surroundings,\" George said to James and Dean after coming out from the van.</p><p>\"Alright,\" Dean said and went to scout their surroundings along with James.</p><p>\"What kind of monsters can attack us here?\" Evan asked while guarding the cargo.</p><p>\"There are many types of monsters you can encounter here. But most of them will be around E rank. And if I'm not wrong, there is a pond not so far away from here. So there is a high possibility that we can encounter water-type monsters here,\" George said while looking at their surroundings carefully.</p><p>James and Dean returned after twenty minutes. \"We scouted two hundred meters around us. There were just some E-rank monsters. We took care of them without any problems,\" Dean said after coming back.</p><p>\"That's good. If nothing goes wrong, we should be able to leave from here without facing any monsters,\" George said after hearing Dean.</p><p>\"Hey, guys, lunch is ready. Come here,\" Evan and the others heard Henry's voice. </p><p>When Evan looked in their direction, he saw Henry and his driver had set up a small barbecue stand and were grilling some meat.</p><p>What is this? </p><p>Are these people nuts? Or I am the odd one here? </p><p>Evan thought with a speechless expression when he saw Henry and his driver doing a barbecue in this wilderness.</p><p>He looked at George wanting to say this is not good for them to barbecue like this, but when he saw George's normal expression he closed his mouth. </p><p>'Looks like I am the odd one here.'</p><p>\"You two go and eat first. We will keep watching until you finish,\" George said to James and Dean since they had just come back after scouting their surroundings.</p><p>Evan and George kept watching their surroundings for monsters until Dean and James came back after eating.</p><p>\"Are transportation missions supposed to be this easy?\" Evan asked while eating.</p><p>\"Nope, most of the time you will have to face monsters whenever you stop in the wilderness. I am surprised that no monster has come to bother us even though we have been here for more than an hour,\" George said while eating a large chunk of meat.</p><p>Howl! Howl! Howl!</p><p>Just as George said howls of wolves rang out one after another. </p><p>\"Looks like I jinxed it,\" George said with a speechless look on his face.</p><p>Just as George finished speaking, everyone heard the howls of wolves. \"Get ready to fight. A pack of wolves is coming towards us. They will be here in twenty seconds,\" Dean shouted after hearing the howls.</p><p>\"You guys go inside the van. We will take care of these monsters,\" George said to Henry and the driver, who quickly rushed towards the van after hearing the wolf howls.</p><p>\"How many are there, Dean?\" George asked after he and Evan came back near the van with Dean and James.</p><p>\"If I'm not wrong, there should be three wolves,\" Dean said while holding his sword.</p><p>'is this his ability?' Evan thought to himself when Dean was able to tell how many wolves will be attacking them.</p><p>\"You two can take care of one wolf,\" George said to Evan and James. \"Dean and I will take out the other two.\"</p><p>Evan and James nodded and didn't say anything. </p><p>'Even if there are more than three, it should be no problem for me to take care of them,' Evan thought while looking in the direction from which they heard the wolves howl.</p><p>After twenty seconds, Evan finally saw three wolves coming towards them with rapid speed. The wolves were two meters tall, and their fur was completely green. All three wolves were looking at them with their deep yellow eyes which were filled with bloodlust.</p><p>\"Be careful while fighting against them. They are wind wolves, and their agility and reaction speed is quite fast. If you give them even a single opportunity, they will not miss it,\" Dean said to everyone after seeing the wolves.</p><p>Upon seeing the wolves, Evan extended his hand forward, and a sword shot out from his shadow, which he caught without any problem.</p><p>\"What the hell was that?\" George, who was standing near Evan, asked when suddenly a sword came out from the ground.</p><p>\"Just one of my skills,\" Evan replied while looking at the sword.</p><p>\"Dude, at least tell me beforehand if you're going to do something like this. I thought there were bandits who attacked us by taking advantage of the situation,\" George said while shaking his head. Anyone would be scared if a sword suddenly emerged from the ground.</p><p>James was holding a spear surrounded by purple lightning, George was using a long sword, and Dean was the only one who was bare-handed.</p><p>\"Let's kill these bastards so I can eat my lunch,\" George said and was about to charge towards the wolves when he heard </p><p>\"Haste!\"</p><p>Swish!</p><p>With a swift motion, Evan, who was standing beside him, disappeared. When he looked towards the three wolves, George saw Evan suddenly appear in front of one of the wolves and slash his sword at its neck.</p><p>Evan's sword was shining in a light blue color, indicating that he was using mana to increase the power of his attack.</p><p>Evan's speed was too fast. When he slashed the sword, George and the others couldn't see his slash clearly. They only saw Evan moving his hand slightly while holding the sword.</p><p>Thud!</p><p>The next second, the eyes of James and the others popped out from their sockets when they saw the head of the wolf standing in front of Evan severed cleanly, and its body dropped to the ground lifelessly.</p><p>The entire area fell into dead silence as everyone witnessed what had just happened.</p><p>\"What the hell did I just see?\" Dean asked with a dumbfounded voice when he saw how a D-rank monster was killed with just a single strike. </p><p>The shocking thing was that since Evan used mana while killing the wolf, they could all tell from his aura that he is still an E rank hunter.</p>", "images": {}, "success": true, "cid": "67347491678383127"}