{"id": 26, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/night-fight-(part-2)_67398473208615320", "title": "Night Fight (Part 2)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Night Fight (Part 2)</h1><p>\"What is that?\" George asked Evan when he saw him holding something in his hand.</p><p>\"A horned rabbit. I heard they taste great,\" Evan replied, handing the rabbit to George.</p><p>\"Yeah, I've heard the same, but why are you giving this to me?\"</p><p>\"I don't know how to cook,\" Evan said, walking back towards James and Dean, who were guarding the van along with Henry.</p><p>'Do I look like a chef?' George thought, following Evan.</p><p>George passed the rabbit to the driver, who was in charge of cooking their food. The driver was ecstatic upon seeing the horned rabbit since he had never eaten one before as well.</p><p>As there were six people in the group, the driver prepared a rabbit stew. When Evan tasted the stew, he felt an overwhelming sense of happiness. </p><p>'It's a hundred, no, a thousand times better than cup noodles.' it was a shame that Evan had been surviving on cup noodles for the past two years, lowering his food standards, so he couldn't help but compare everything that he ate to them.</p><p>\"I'll take the first watch. You guys can rest,\" Evan said after everyone finished dinner.</p><p>\"Alright, I'll take a shift with you,\" George replied and stood up. </p><p>Dean and James went back into the van to sleep. The van was spacious enough for everyone, including Henry and his driver, to sleep comfortably.</p><p>Although they set up a campfire, they didn't pitch tents as it will be risky for Henry and his driver to sleep outside, considering the potential danger of monster attacks during the night.</p><p>As it was nighttime, George found it challenging to see clearly. Although D-rank hunters had better eyesight than normal humans and could somewhat see in the dark, it was still difficult for George to discern his surroundings.</p><p>The only source of light was the campfire, burning not far from the van.</p><p>Evan, was completely unaffected by the darkness. He looked around with a bored expression. His enhanced vision allowed him to see clearly in low light.</p><p>Evan and George remained vigilant, keeping a watchful eye on their surroundings. After four hours, Dean and James emerged from the van.</p><p>\"You guys can go now. We'll take over guard duty,\" Dean said, stretching his body.</p><p>Evan entered the van and lay down, covering himself with a blanket he had retrieved from his storage ring.</p><p>Feeling exhausted from the day's activities, Evan quickly drifted off to sleep.</p><p>\"Wake up! We're under attack!\" Evan's sleep was short-lived as he heard Dean's shout. George also woke up, along with Henry and his driver. </p><p>Evan and George hurriedly exited the van leaving behind Henry and his driver.</p><p>Once outside, Evan saw no monsters nearby. \"Dude, why are you shouting? I don't see any monsters here.\"</p><p>\"They'll be here soon,\" Dean said gravely. When Evan heard this, he recalled how Dean had sensed the wolves earlier, even before they had arrived near them.</p><p>\"How many are there?\" George asked, his voice filled with concern.</p><p>\"I don't know, but there are at least twenty.\"</p><p>\"What?\" George was shocked by the number of monsters.</p><p>\"Are you sure?\" George asked again, seeking confirmation.</p><p>Dean remained silent, his gaze fixed on what lay ahead. The others also turned their attention in that direction.</p><p>Evan wasn't sure if Dean could see in the darkness, but as he followed Dean's line of sight, he noticed a horde of monsters running toward them.</p><p>The monsters were still two hundred meters away when Evan spotted them.</p><p>Surprised for a moment, Evan shook his head and reassured the others, \"Don't worry, all of these monsters are just E-rank.\"</p><p>Dean and the others, who had been looking ahead with seriousness were taken aback by Evan's words. Before they could inquire further, the horde of monsters reached them, and the others could now see that they were indeed all E-rank monsters.</p><p>\"I almost had a heart attack when you said there were twenty monsters,\" George said with relief. </p><p>\"Let's take care of them quickly.\" George charged toward the incoming horde of monsters, wielding his longsword.</p><p>James also sprang into action, charging at the monsters with his spear crackling with purple lightning.</p><p>Evan and Dean remained behind to protect the van from any potential monster attacks.</p><p>George confronted a horse-like creature rushing toward him and swiftly swung his longsword, slicing the creature in two with a single strike, his muscles bulging with power.</p><p>'Wow, that sword must be quite expensive,' Evan thought, his gaze filled with envy as he observed George's weapon.</p><p>He glanced at the shabby sword in his own hand, which he had stole* \"borrowed\" from the training ground of the academy and his eyes can't help but twitch. </p><p>'I'll buy a good weapon once I earn some money.'</p><p>Crackling with lightning, James impaled a panda-like monster with his spear. The creature convulsed, electrified by the thunderous arcs, and succumbed to the attack.</p><p>Suddenly, a tiger-like beast leaped over George and bounded toward Evan.</p><p>Reacting swiftly, Evan moved forward with superior agility and swiftly dispatched the tiger with a single fluid motion.</p><p>\"This is strange,\" Dean mumbled to himself.</p><p>\"What's strange?\" Evan asked, raising an eyebrow.</p><p>\"I'm not sure, but it feels like these monsters are running away from someone.\"</p><p>\"Why do you say that?\" Evan asked rasing an eyebrow.</p><p>\"I've been a hunter for over five years, and I've never seen such a diverse group of monsters attacking together. Usually, when facing a larger horde, the monsters are all of the same type. But here, they're different—tigers, horses, bears—it's as if they're not attacking us but trying to escape from something.\"</p><p>As Evan pondered Dean's words, he scrutinized the monster horde more closely. And found Dean was right, all the monsters seemed focused on fleeing, not engaging in combat with them.</p><p>Suddenly, Dean's expression changed, and he said, \"I can sense two more presences coming toward us.\"</p><p>\"Stop your attacks, quickly!\" Evan shouted to James and George when he heard Dean's revelation. </p><p>\"These monsters are running away from something. They're not here to attack us. Don't waste your strength fighting them.\"</p><p>Confused, George and James complied, halting their assaults and retreating from the monsters.</p><p>The monsters, did not pay any attention to Evan and the others, ran past them as if they were driven by an urgent need to escape.</p><p>\"What the hell is going on?\" George asked, perplexed by the spectacle of the monsters fleeing.</p><p>\"Two more presences are approaching us. I'm not certain, but if I'm right, these monsters are running away from those two presences,\" Dean explained, his voice filled with gravity.</p><p>\"If these E-rank monsters are fleeing, then those presences must be at least D-rank,\" James remarked with a serious tone.</p><p>'I just hope they're not C-rank monsters,' Evan thought, preparing himself for a fight.</p>", "images": {}, "success": true, "cid": "67398473208615320"}