{"id": 24, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/these-d-rank-monsters-are-too-weak-(part-2)_67352459344923174", "title": "These D-Rank Monsters Are Too Weak (Part 2)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>These D-Rank Monsters Are Too Weak (Part 2)</h1><p>'What the hell happened?' Evan thought when he saw how easily he killed a D-rank monster. </p><p>\"Is a D-rank monster supposed to be this weak?\" Evan was shocked that he was able to sever the head of a D-rank beast with a normal sword.</p><p>He looked at the sword in his hand, which was still shining in blue light because of his mana, and noticed a very thin black layer mixed with the blue layer of mana.</p><p>The black layer was so thin that Evan was sure that if his eyesight hadn't improved after obtaining the monarch core, he wouldn't have noticed it.</p><p>'Is my attack this powerful because of this black energy mixed with my mana?' Evan thought as he observed the thin black layer.</p><p>Howl!</p><p>\"Be careful!\" Evan snapped out of his dazed state after hearing Dean's shout. When he looked at the other two wolves, he saw that one of them was already in front of him, slashing at his neck with its front claw.</p><p>Evan was still using the haste skill, so he saw everything in slow motion. He lifted his sword and parried the wolf's claw with his sword. As he parried the claw, he was pushed back a little due to the wolf's running momentum.</p><p>But because of his high agility he was able to react quickly, and before the wolf could regain its balance after the failed attack, Evan slashed his sword at the wolf's shoulder blade.</p><p>Howl!</p><p>The wolf howled in pain as its shoulder was almost severed from the rest of its body, and a fountain of blood erupted from the wounded shoulder.</p><p>\"Watch out!\" Evan was about to attack the wolf once again when he heard George shout again and without hesitation, he jumped sideways.</p><p>Just as he jumped sideways, a green blade passed by his previous location and hit a tree not far away from him.</p><p>The tree split in two when the blade struck it. Cold sweat appeared on Evan's back seeing the result of the wolf's attack. </p><p>'I should pay more attention to my surroundings while fighting.' He thought while thinking he need more fighting experience.</p><p>\"What the hell is going on? From his aura, I can clearly feel that this guy is an E rank hunter, so how can he fight against these D rank monsters like this?\" Dean said with a voice filled with shock.</p><p>\"Hey, you guys are from the same academy. Do you know what's going on?\" George asked James, who was looking at Evan with his mouth wide open.</p><p>George and Dean didn't know Evan, but James was well aware that Evan was the weakest student in the academy, and everyone called him trash.</p><p>\"Just what happened to this guy?\" James asked himself as he watched Evan take care of D rank monsters without any problem.</p><p>'Just a few days ago, I saw how Mike and some other students were bullying him. Was he pretending all this time?' James thought feeling his eyes were not working properly.</p><p>\"Hey, are you listening?\" James snapped out of his thoughts after hearing Dean's voice.</p><p>\"I never talked to him in the academy, so I don't know about him,\" James replied, not revealing what he knew about Evan since he was also unsure of what was happening.</p><p>After evading the wind blade, Evan looked at the wolf that had attacked him and charged toward it with agility much faster than a D rank hunter.</p><p>The wind wolf was an agility-based monster, so somehow it was able to spot Evan when he appeared before it, the wolf used its front claw to strike at Evan like a hammer. However, instead of dodging the claw, Evan used his sword to clash with the wolf's claw.</p><p>Puchi!</p><p>When Evan's sword, covered in a blue layer of mana, clashed with the wolf's claw, it sliced through it like a hot knife through butter.</p><p>Howl!</p><p>The wolf howled in pain, and even before it could react, Evan once again slashed his sword at the wolf's neck. Although Evan wasn't able to sever the neck of the wolf with a single attack this time, he followed up with another slash, completely severing the head of the wolf.</p><p>After killing it, Evan turned his attention to the remaining wolf, which was trying to stand up but failing miserably due to its shoulder being almost severed from Evan's earlier attack.</p><p>Evan calmly walked toward the wolf and killed it with a single slash. James and the others looked at Evan as if they were looking at a monster.</p><p>Evan ignored them and began searching for cores. After looking at all the wolves he only obtained one core from the three wolves.</p><p>He dropped the core and his sword on the ground, and both items suddenly disappeared upon touching the ground.</p><p>Evan wasn't considering sharing his cores with anyone because the mission details stated that he could keep the cores of the monsters he hunted for himself.</p><p>After taking care of everything, Evan calmly walked toward George and the others.</p><p>\"Who are you?\" Dean asked Evan when he approached them.</p><p>\"Didn't I already tell you? I'm Evan, an E-rank hunter,\" Evan replied.</p><p>\"E-rank my ass! Even a D-rank hunter can't kill those monsters like this,\" George exclaimed, looking at Evan in disbelief.</p><p>\"I just have some skills that improve my fighting power for a limited time,\" Evan explained without going into much detail.</p><p>\"Oh, what kind of skill can improve your power by two ranks?\" Dean asked sarcastically, thinking Evan is a high rank hunter who joined this low level mission to mess with them.</p><p>\"I don't think I have any reason to tell you guys about my skills,\" Evan retorted, feeling irritated by their questions.</p><p>\"Well, you don't have to tell us about your skills, but since we're going to work as a team, you should have at least inform us that you can easily handle D-rank monsters,\" Dean persisted.</p><p>\"Oh, if an E-rank hunter came before you and said, 'Hey, I can kill D-rank monsters easily,' would you believe him?\" Evan rolled his eyes in response.</p><p>Dean wanted to say something, but no words came out of his mouth because he knew he would never believe such a claim.</p><p>\"Sigh, I'm sorry I overreacted,\" Dean apologized after realizing the futility of his argument.</p><p>\"Don't worry, I understand what you thinking. But you don't have to worry about that since I have no intention of harming any of you,\" Evan said to them as he walked toward the barbecue table where he had been eating his lunch.</p><p>James watched Evan, lost in his own thoughts, while George and Dean pondered over something.</p><p>Evan paid no attention to them because he had never intended to hide his power from the beginning. His main purpose for joining this mission was to take a break after two years and collect some cores if possible.</p><p>If he conceal his power, how will he gather enough cores? </p><p>'Ihope I'll be able to obtain sufficient cores to advance my rank to E+,' Evan thought to himself as he enjoyed his steak.</p>", "images": {}, "success": true, "cid": "67352459344923174"}