{"id": 27, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/black-ogre-(part-1)_67422104101904948", "title": "Black Ogre (Part 1)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Black Ogre (Part 1)</h1><p>Soon, Evan and the others could hear the sound of heavy footsteps approaching them.</p><p>Evan focused on the direction from which the monsters had come earlier. </p><p>After ten seconds, he finally saw two humanoid figures coming towards them. They were still one hundred meters away, so the others were unable to see them clearly, but they could hear the sound of approaching footsteps. Evan, with his enhanced vision, was the only one able to see them distinctly.</p><p>Evan's eyes widened in recognition as he saw the two three-meter-tall humanoid monsters with long horns protruding from their heads, dark black skin, and a single deep red eye in the center of their faces. </p><p>\"What the hell? How can Black Ogres be here?\" Evan exclaimed, shocked by their presence.</p><p>The others turned to look at Evan with shocked expressions, but before they could ask any questions, the two Black Ogres reached their vicinity.</p><p>As the others saw the hideous three-meter-tall monsters, their faces grew pale. </p><p>\"No wonder those monsters were running away,\" Dean remarked, taking deep breaths trying to regain his composure. </p><p>Everyone present, except for Evan, were experienced hunters, so they quickly snapped out of their initial shock.</p><p>\"It's fortunate that these Black Ogres are only D+ rank,\" George said, tightly gripping his longsword.</p><p>\"Even so, it will be extremely difficult to defeat them,\" James added, his gaze focused on the Black Ogres with a serious expression.</p><p>Black Ogres were among the most dangerous monsters due to their abnormal skills and innate abilities. Each Black Ogre possessed the innate ability called Devouring, which allowed them to consume other life forms and increase their own power.</p><p>Unlike humans, who required cores to improve their strength, Black Ogres can devour any life form and augment their own abilities. </p><p>The reason the other monsters had been fleeing from the Black Ogres was also due to this ability. If caught by a Black Ogre, one would experience a slow and agonizing death, being eaten alive by the monstrous creature.</p><p>Although the Black Ogres were only D+ rank, even C-rank hunters struggled when facing them due to their formidable defense. Moreover, these monsters possessed Skill Regeneration, allowing them to quickly heal from injuries.</p><p>If it were any other monster, Evan and the others would not be as concerned. However, Black Ogres were an entirely different matter.</p><p>As Evan observed the Black Ogres, he wasn't certain if he could defeat them due to their abnormal defense and regenerative abilities. </p><p>Nevertheless, he was confident that his life was not in immediate danger, as the agility of Black Ogres was notoriously low, which meant he can aways retreat if needed.</p><p>\"I'll take care of one of them. You guys focus on the other,\" Evan said to George and the rest of the group.</p><p>No one objected to Evan's plan, as they had already witnessed his ability to single-handedly dispatch three D-rank monsters earlier.</p><p>Evan moved a bit farther away from the van and hurled a stone toward one of the Black Ogres. When the stone struck the ogre, it turned its attention toward Evan and began approaching him.</p><p>The second ogre continued its advance toward George and the others.</p><p>'Alright, I hope this shabby sword can penetrate the tough defense of the Black Ogre,' Evan thought, hoping that the black energy he saw earlier will help him once again. He tightly gripped his sword, and soon a light blue layer of mana along with a faint black layer covered his sword.</p><p>Krlrlek!!!</p><p>The Black Ogre emitted a strange sound as it neared Evan. \"Sorry, but I didn't learn the ogre language in the academy,\" Evan said as he charged toward the Black Ogre.</p><p>Standing at three meters tall, the ogre loomed like an adult being approached by a child. As the ogre spotted Evan charging at it, it raised its hand and attempted to crush Evan, using its hand like a hammer.</p><p>Swiftly, Evan leaped and evaded the ogre's attack, slashing at its arm with his sword. Due to its low agility, the ogre couldn't defend itself and was struck by Evan's sword.</p><p>Kaaaa!!!</p><p>The ogre howled in pain as a deep wound appeared on its arm. Evan was taken aback by the result. Earlier he had been able to decapitate wolves with a single slash. Yet now, he found that he couldn't even sever the ogre's arm. </p><p>\"As expected, its defense is on a completely different level compared to other monsters,\" Evan muttered, realizing the ogre's formidable resilience.</p><p>Krreirk!!!</p><p>The ogre bellowed, and suddenly the deep wound on its arm began healing at an incredible speed. </p><p>\"Dammit! Its regeneration skill will be a pain in the ass,\" Evan cursed as he witnessed the rapid healing of the ogre's wound.</p><p>Abruptly, the ogre's eye glowed red, and Evan felt a sense of impending danger. Reacting swiftly, he moved backward, activating his Haste skill to enhance his agility.</p><p>Just as Evan distanced himself from the ogre, a beam resembling red laser shot out from the ogre's eye. Evan quickly jumped sideways, narrowly evading the beam that tore through multiple trees.</p><p>'If I hadn't backed away in time and used Haste skill, I would have been hit by that beam,' Evan thought, feeling a chill running down his spine.</p><p>After releasing the beam, the ogre momentarily closed its eye. Seizing the opportunity, Evan charged towards the ogre once again and swiftly reached to its right leg.</p><p>With a swift slash of his sword, Evan struck the ogre's right leg.</p><p>Swish!!!</p><p>Dark black blood spurted from the leg where Evan's blade had cut deep, yet he didn't stop there. </p><p>\"Shadow bullet!\" Evan unleashed a shadow bullet at the same spot where he had slashed with his sword.</p><p>Puchii!!!</p><p>The bullet pierced deep into the ogre's leg, causing a fountain of black blood to gush forth.</p><p>Kaaaa!!!!</p><p>The ogre shrieked in agony as the shadow bullet lodged in its leg.</p><p>Evan prepared to strike again, but suddenly, his body froze, rendering him unable to move. Before he could react, the ogre delivered a powerful punch to his chest.</p><p>Sent flying like a broken kite, Evan crashed against a tree, coughing up blood upon impact.</p><p>\"What the hell just happened?\" Evan tried to stand ignoring the searing pain in his chest. His ribcage was nearly fractured from the ogre's devastating blow.</p><p>'Why did my body suddenly stop moving?' Evan thought, looking at the black ogre with a painful expression on his face.</p><p>As he looked at the ogre, Evan noticed that its previously red eye had turned pitch black, and the wound on its leg, inflicted by him earlier, was rapidly healing.</p>", "images": {}, "success": true, "cid": "67422104101904948"}