{"id": 28, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/black-ogre-(part-2)_67445519995162122", "title": "Black Ogre (Part 2)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Black Ogre (Part 2)</h1><p>\"I always wanted to fight against a black ogre!\" George shouted while slashing at the ogre's chest. His muscles bulged out, and a crimson aura emanated from his body. His long sword released ice energy, freezing the surrounding air.</p><p>Kaaa!</p><p>The ogre screamed in pain as a deep wound appeared on its chest. Surprisingly, an icy layer formed around the wound, slowing down its healing.</p><p>\"You were shocked when you saw the black ogre earlier, and now you're saying you always wanted to fight them?\" Dean said and punched the ogre in the stomach. Dean was bare-handed, but his whole body was surrounded by earth armor, making him resemble a humanoid golem.</p><p>James, surrounded by purple lightning, attacked the ogre while running circles around it, diverting its attention. George and Dean took advantage of the distraction caused by James to launch their own attacks.</p><p>Krikkkk!</p><p>Suddenly, the ogre shifted its attention from James to Dean and caught his arm when he tried to strike its leg.</p><p>\"Dean!\" George shouted, attempting to free him by slashing at the ogre's arm. However, before he could do anything, the ogre's eye lit up, and a laser beam pierced through Dean's tough earth armor.</p><p>\"Argh!\" Dean cried out in pain as the laser beam pierced his shoulder. After firing the laser beam, the ogre briefly closed its eye. George and James seized the opportunity and quickly attacked the arm of the ogre that was holding Dean.</p><p>The crimson aura emanating from George's body intensified, causing his muscles to bulge as if they were about to explode.</p><p>Haaaa!</p><p>With a warcry, George swung his long sword at the ogre's arm, severing it as if it were made of tofu.</p><p>Dean collapsed to the ground after his arm was freed. James rushed over and helped Dean to move away from the ogre.</p><p>George, after his attack, stepped back from the ogre and coughed up a mouthful of blood. He had pushed his body to the limit with that last strike.</p><p>The ogre cried out in pain after losing its arm. Due to the additional ice damage inflicted by George's special sword, the arm of ogre regenerated very slowly. Even a black ogre couldn't regrow a severed limb quickly.</p><p>George retrieved a healing potion from his belongings and quickly drank it. Then he approached James, who was giving a healing potion to Dean.</p><p>Dean's earth armor was completely broken near his shoulder, and he was bleeding profusely. Dean drank the healing potion, knowing that his wound will take time to fully heal, but at least the bleeding will be stopped because of the effect of the potion.</p><p>\"This bastard is quite tough,\" George remarked as he approached Dean and James.</p><p>They all turned their attention to Evan, who was still fighting the remaining ogre alone. </p><p>\"Is that guy really an E-rank hunter?\" Dean asked when he saw how Evan was holding his ground against the ogre.</p><p>\"His condition doesn't look good. Although he's dealing some damage, it's not enough to defeat it due to its regeneration skill,\" James observed as he witnessed the ogre healing itself rapidly after each attack from Evan.</p><p>\"Forget about him for now. We need to quickly kill this ogre since there are three of us. Then we can help him,\" George said, urging them to focus on the task at hand. Once again, they charged toward the ogre.</p><p>Just as James and Dean diverted their attention from Evan, the eye of the ogre he was facing turned pitch black. It used another skill that froze Evan's body in place.</p><p>Because of this skill, Evan was unable to move and was struck by the ogre, crashing against a tree.</p><p>\"Just how many skills does this damn ogre have?\" Evan muttered when he saw the ogre's black eye. He looked at his sword and saw that it was filled with cracks and couldn't be used anymore.</p><p>'I should have stolen a better sword from the academy,' Evan thought as he examined the condition of his sword.</p><p>He put away his sword and drank a healing potion to heal his injuries.</p><p>'Looks like I'll have to rely on my bare hands,' Evan said inwardly, as he charged towards the ogre once again.</p><p>As Evan neared the ogre, he once again felt his body being restricted by an external force just like last time. </p><p>\"Do you think your trick will work on me again?\" Evan shouted and activated his skill, Shadow Walk.</p><p>---) Shadow Walk: Your body will turn into a shadow, allowing you to pass through any barriers and restrictions without hindrance.</p><p>Suddenly Evan disappeared from sight while running towards the ogre. The black ogre was taken aback, looking around with its pitch-black eye but unable to locate Evan.</p><p>In an instant, a black shadow materialized behind the ogre, transforming into Evan.</p><p>After appearing behind the ogre using his Shadow Walk skill, Evan closed his fist and delivered a powerful punch to the ogre's knee joint.</p><p>His monarch core began to rotate at full speed, gathering mana around his fist. When his fist struck the ogre's knee joint, it buckled, and the ogre fell to its knees.</p><p>Evan didn't stop there. He gathered mana around his legs, preparing for another strike. With a burst of power, he jumped up and delivered a forceful punch to the back of the ogre's head.</p><p>The impact caused the ogre to fall face-first onto the ground. Sensing an opportunity, Evan swiftly used Shadow Walk once again, appearing in front of the fallen ogre.</p><p>Evan pointed his finger at the ogre's eye and utilized around fifty percent of his mana to create a shadow bullet.</p><p>A jet-black bullet formed at Evan's finger, which he shot directly into the ogre's eye.</p><p>Puchii!</p><p>The bullet pierced through the ogre's eye, reaching to its brain and destroying it in one fell swipe. </p><p>Everything happened so quickly that the ogre didn't even get a chance to cry out before its life force disappeared after Evan destroyed its brain.</p><p>Since Evan had activated Shadow Walk skill, only ten seconds had passed and he killed the black ogre. Without his shadow walk skill that allows him to move ignoring the restrictions, it would have been significantly more challenging to defeat the ogre while it was using its restrictive abilities.</p><p>After killing the ogre, Evan sat down on the ground, panting heavily. He had used over seventy percent of his mana in just ten seconds, taking a toll on his body.</p><p>'I hope this ogre gave me a core, and when I absorb it with my monarch core, I'll gain one of its skills,' Evan thought as he looked at the lifeless body of the ogre.</p>", "images": {}, "success": true, "cid": "67445519995162122"}