{"id": 21, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/leaving-the-city_67317990604980695", "title": "Leaving The City", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Leaving The City</h1><p>Evan arrived at the 10th floor of the plaza. Unlike the seventh floor, where potions were being sold and bustling with people, there were very few individuals on this floor since not many people sells monster cores.</p><p>Evan approached one of the receptionists after reaching at the 10th floor, seeing Evan the receptionist asked him politely, \"How can I help you?\"</p><p>\"I want to sell these shadow cores.\" Evan said while taking out four shadow cores.</p><p>The receptionist's eyes lit up upon seeing the cores. \"Sure, we can offer you thirty thousand credits for each shadow core.\"</p><p>Evan had already checked the price of cores on the internet before coming, and he was satisfied with the receptionist's offer. He sold the cores and received one hundred and twenty thousand credits in return.</p><p>After selling the cores, Evan went to the seventh floor to buy some healing and mana potions. He knew the chances of getting injured during his mission is quite high, so having potions will be beneficial.</p><p>Once he purchased the potions, Evan left the plaza and headed to buy some food items and other necessities for the journey.</p><p>By the time he finished all his errands, it was already evening. \"I should dine at a restaurant tonight since I'll be going on a mission tomorrow,\" Evan said to himself.</p><p>He went to one of the best restaurants in Astrate city and enjoyed a meal. Afterward, Evan returned to the academy early to rest, as he will be departing for Oklima city the following day.</p><p>The next day, Evan took a taxi and made his way to the city gate, where he was scheduled to meet the other three hunters and the merchant who issued the mission.</p><p>Having never left Astrate city before, Evan was unaware of the exact situation outside the city. However, based on the information he had gathered from the internet, leaving a city was considered dangerous due to the presence of many monsters.</p><p>In the Arora world, most cities were protected by barriers that prevented monsters from approaching. However, once someone left the city, they lost the protection of these barriers and had to rely on their own strength to defend against monsters.</p><p>Merchants who needed to travel from one city to another to sell their goods often issued missions in hunter associations to hire hunters for protection. The hunter association collaborated with the academy to provide low-danger missions to students for training purposes.</p><p>Evan was more concerned about the other hunters who will be joining him on this mission. He knew they will be from the hunter association and likely quite powerful.</p><p>'It should be fine. According to the mission details, all three of them will also be D rank hunters. Even if something happens, I should be able to handle them,' Evan thought to himself. Even though he was aware that teamwork is crucial, especially during the mission to safely transport the goods to Oklima city, he also knew that humans are more dangerous than monsters in this world.</p><p>Soon, Evan arrived at the city gate, where he was supposed to meet the other hunters and the merchant. He noticed several vehicles parked there, resembling vans, but longer in size, ranging from five to ten meters.</p><p>These vans were a combination of science and magic, powered by monster cores. They even had protective barriers to ward off monsters.</p><p>\"Let's see where van number Ko90 is,\" Evan said as he scanned the area. After five minutes, he finally spotted van number Ko90.</p><p>The ten-meter-long van was made of black, steel-like metal, with weapons installed and a futuristic appearance compared to vehicles from modern Earth.</p><p>Evan noticed a middle-aged man standing near the van and assumed he must be Henry, the one who issued the mission. The man was dressed in a business suit.</p><p>\"Hi, are you Evan?\" the middle-aged man asked when he saw Evan approaching.</p><p>\"Yes, I am.\"</p><p>\"Can you show me your hunter card?\" Henry asked.</p><p>Evan showed Henry his hunter card, which now displayed his updated rank as an E rank hunter. The receptionist at the mission hall had updated it the day before when he picked up the mission.</p><p>After inspecting Evan's card, Henry nodded. \"You're the first one to arrive. The others should be here soon.\"</p><p>\"It will take us two days to reach Oklima city, right?\" Evan asked Henry while waiting for others.</p><p>\"Yes, is this your first time leaving the city?\" Henry inquired.</p><p>\"Yes, I've never left Astrate city before. It'll be my first time venturing outside,\" Evan replied.</p><p>\"No need to worry too much. The hunter association clears most of the high-rank monsters on a monthly basis. We won't encounter any monsters higher than D rank during our journey,\" Henry assured Evan.</p><p>Evan waited for a few more minutes until he spotted two men approaching. Both of them were D rank hunters. 'They must be the hunters from the association,' Evan thought as he observed them closely. They appeared to be around thirty years old and experienced.</p><p>\"Hello, I'm George, and this is Dean,\" one of the hunters introduced themselves as they approached Henry.</p><p>\"Nice to meet you. I'm Henry. Can you guys show me your hunter cards?\" Henry requested.</p><p>\"Here,\" both George and Dean handed their hunter cards to Henry. After confirming their identities, Henry nodded and said, \"Alright, we'll depart as soon as the last hunter arrives. Ah, it seems he's here.\"</p><p>Evan looked towards the approaching figure and was surprised to see that the last hunter was also a student of the academy.</p><p>\"James,\" Evan recalled his name. James was also an orphan, and Evan remembered that Mike and his gang often targeted him for bullying. James was not very sociable and rarely interacted with others at the academy, so Evan didn't know much about him.</p><p>\"Are you James?\" Henry asked as James joined them.</p><p>James nodded and handed his hunter card to Henry, who checked it and then said, \"Now that everyone is here, we should leave. My name is Henry, and your mission is to protect me and my cargo until we reach Oklima city and return to Astrate city.\"</p><p>\"We'll be taking a route cleared by the hunter association every month, so we won't encounter any monsters higher than D-rank.\"</p><p>\"Any questions?\"</p><p>When no one asked any questions,Henry nodded in response. \"Okay, let's depart then.\"</p><p>The van was divided into three sections. Henry went to the front section where the driver was located. In the middle section, the goods that Evan and the other hunters had to protect were placed. The largest section at the back was where all four hunters took their seats.</p><p>Once everyone was settled, the driver started the van, and they left Astrate city behind.</p>", "images": {}, "success": true, "cid": "67317990604980695"}