{"id": 29, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/oklima-city-(part-1)_67468000659300222", "title": "Oklima City (Part 1)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Oklima City (Part 1)</h1><p>'I am still not strong enough,' Evan thought while looking at the corpse of the black ogre. \"I am almost out of breath just after fighting against a D+ rank monster.\" Evan stood up and looked at George and the others who were still fighting against the black ogre.</p><p>Evan felt a little disappointed that he hadn't been able to kill the black ogre easily, despite it being just a D+ rank monster. He had thought that with his monarch core at D rank and his prime core currently at E rank, he should be able to handle a C rank monster.</p><p>However, after the battle with the black ogre, he realized he still had a long way to go in terms of strength.</p><p>\"I was also not able to control my power properly and wasted too much mana during the fight. I should have trained a little more before accepting this mission.\" Evan's power had increased significantly, but he found it hard to control his power properly during the fight, leading to a wastage of mana.</p><p>Actually, it was already a miracle that Evan had managed to kill a black ogre alone. Black ogres were famous for their regeneration and defense; even a C-rank hunter would struggle to defeat one due to its abnormal skills.</p><p>One could tell this just by looking at George and the other hunters, who were still trying to kill the second black ogre. Even with three of them fighting together, they were not able to bring it down yet.</p><p>\"I should help them so we can leave this damned place,\" Evan muttered, and moved towards George and the other hunters.</p><p>\"How the hell can it still move around?\" George shouted in an irritated voice. After cutting off one of the black ogre's arms, it should have been easier for them to attack it.</p><p>However, since Dean had been injured earlier, they were still struggling even though the ogre's body was filled with numerous injuries. Thanks to George's sword, which froze the wounds of the ogre, its regeneration skill wasn't working properly.</p><p>\"This ogre is like a cockroach that you can't kill,\" Dean remarked as he attacked the ogre's leg with a rock-made club.</p><p>James used his lightning spear to slow down the movements of the black ogre, but it was evident that their condition was not good.</p><p>All of them started to get tired, on the other hand the ogre seemed to have endless stamina.</p><p>\"Damm! We can't go on like this; we need to deal a fatal blow if we want to kill it,\" James shouted while stabbing his spear at the stomach of the black ogre.</p><p>\"It's not easy to deal fatal damage to this bastard because of its defense and regeneration,\" Dean said in a frustrated tone.</p><p>Suddenly Evan appeared behind the ogre like a shadow and punched its knee joint. Due to the sudden attack, the ogre fell to its knees after losing its balance.</p><p>\"Get ready to attack its eye!\" Evan shouted, and then he jumped up and punched the back of the ogre's head.</p><p>Even George and the others were startled by Evan's sudden appearance behind the ogre. They were not able to see him moving behind the ogre because of his shadow walk skill. However, they didn't miss the chance that Evan provided them.</p><p>Because of Evan's punch, the ogre fell face-first to the ground. George was the first to come before the ogre and slashed at its eye with his long sword.</p><p>Puchi!!!</p><p>The eye of the black ogre burst apart due to George's sword slash. As George burst the eye of the ogre, James arrived, surrounded by purple lightning.</p><p>James used his spear and stabbed the eye of the ogre.</p><p>Crackle!!</p><p>Lighting crackled around James's spear, and because the defense of the ogre was very weak in that area, his spear pierced all the way to its brain.</p><p>The lighting from the spear cooked the ogre's brain, and the foul smell of rotten, cooked meat permeated the area.</p><p>\"This bastard is finally dead,\" George said, and he sat down on the ground.</p><p>\"We should leave from here; other monsters will soon come after smelling the blood,\" James said to the others after they killed the black ogre.</p><p>Everyone nodded after hearing him. \"George, can you lend me your sword for a moment? Mine broke during the fight. I want to look for the core, but the skin of this ogre is quite tough,\" Evan said with an embarrassed tone.</p><p>\"Sure,\" George willingly gave his sword to Evan, recognizing that without Evan's help, it might have taken them much longer to defeat the black ogre.</p><p>James and the others also searched the body of the second black ogre, as well as the bodies of the other E-rank monsters they had defeated earlier.</p><p>Evan approached the black ogre that he had killed and used George's long sword to search for the core near its heart.</p><p>Evan's eyes lit up when he found a purplish-black core near the heart of the black ogre. \"I hope that when my prime core reaches D rank and I absorb this with my monarch core, I will gain one of the black ogre's skills,\" Evan mumbled to himself. The skills possessed by the black ogre were incredibly powerful, and he wanted to acquire them.</p><p>After taking the core, Evan used his shadow storage skill, causing the body of the ogre to suddenly sink into the ground.</p><p>Evan could sell the body of the black ogre at a good price, as people could use it to create weapons and other items.</p><p>He didn't know how much space his shadow storage skill had, so he was not sure about storing the body of the ogre, but luckily, he was able to store the whole body without any problem.</p><p>\"Your skill is quite impressive. People usually have to buy expensive storage rings to store monster bodies for selling, but you can effortlessly keep them with your skill,\" Dean said when he witnessed the black ogre sinking into the ground.</p><p>Dean and the others also found a core in the body of the second black ogre. Evan attempted to store the second ogre's body using his shadow storage, but he was not able to store it.</p><p>\"Looks like I'll have to increase the level of my core if I want to store more things in it,\" Evan said, shaking his head.</p><p>\"Henry, let's leave now. Other monsters will soon arrive come here because of the scent of blood,\" George said to Henry, moving towards the van.</p><p>Henry nodded, and they soon left for the Oklima city once again.</p>", "images": {}, "success": true, "cid": "67468000659300222"}