{"id": 34, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/kill_67583756755596259", "title": "Kill", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Kill</h1><p>Evan wasn't worried about being trapped in the barrier because he knew, he could leave the barrier whenever he wanted with his shadow walk skill.</p><p>---) Shadow Walk :- Your body will turn into a shadow and you can pass through any barrier or restrictions without being hindered.</p><p>But Evan was hesitating a little because of James who is also a student of the hunter academy. Till now he only showed shadow storage and haste skill to other hunters.</p><p>He didn't show them his shadow walk and shadow bullet skill because it will be too suspicious for him to have so many skills. If it was only George and Dean who don't know about him he can still use any skill without much problem.</p><p>But James is already aware about Evan that he is the weakest hunter in the academy. It is already quite strange that he can kill D-rank monsters without any problem while being only E-rank, now if he shows other skills it will be quite troublesome.</p><p>He doesn't want to reveal the existence of his monarch core to anyone or he might get into some problems because of it.</p><p>\"Don't kill them I will transfer the money\" Evan heard the shout of Henry and saw he was about to transfer the money to the bandits.</p><p>'Is this guy an idiot, it is already clear they will kill us even after he transferred the money to them' Evan thought while shaking his head because there is no way these bandits will leave them alive.</p><p>'Guess I have no choice' seeing he there is no other way he finally made up his mind and decided to use his shadow walk skill 'that guy is mute and doesn't talk to other students so I think it will be fine'.</p><p>Evan used shadow walk skill and suddenly turn into a shadow, he went towards the barrier and easily passed through it without any problem.</p><p>Just as Evan passed through the barrier he felt his mana decrease by a considerable amount. </p><p>'so it will take a large amount of mana if I want to pass through a barrier' Evan thought when he lost a large amount of mana after passing through the barrier.</p><p>\"What the hell was that?\" George asked while looking at the place where Evan was standing just a moment ago.</p><p>\"Where is he?\" Dean asked while looking around them.</p><p>\"Arghhh\" suddenly they heard a painful scream of Drew and saw somehow Evan appeared behind him and stabbed his sword in his heart.</p><p>\"H... How\" Drew asked with a trembling tone while blood came out from his mouth.</p><p>\"Ask papa lucifer when you meet him\" Evan said coldly and pulled back his sword. He didn't feel anything after killing a human because they were the first who tried to kill him, so there is no way he will let them live after they tried to kill him.</p><p>'I am not a naive person who will hesitate to kill someone just because they are human, monsters and humans are the same in this world. I will kill anyone who will try to harm me' he thought when he saw Drew drop to the ground and his life ended.</p><p>After killing Drew, Evan looked at David coldly who was looking at the cold corpse of Drew without any emotion on his face.</p><p>\"You bastard\" Oliver the short archer shouted and shot an arrow towards Evan. Evan used haste skill and easily dodged the arrow.</p><p>After dodging the arrow he first charged toward Oliver. Even before the archer can react Evan came before him and grabbed him by the shirt, after grabbing him, like he is throwing some kind of garbage he used his abnormal strength and threw Oliver towards the barrier in which George and others were trapped.</p><p>Just like what Dean said earlier, Oliver was not stopped by the barrier and crashed before Dean and others.</p><p>After throwing Oliver inside the barrier Evan ignored him and once again looked at David who was still standing in the same place.</p><p>\"You are quite strong\" David said after Evan threw Oliver inside the barrier.</p><p>Evan raised an eyebrow when he saw how David was still calm despite the fact that Drew and Oliver is already out.</p><p>\"You don't look bothered by the death of your subordinates.\" Evan said after seeing David's reaction.</p><p>\"They are just disposable tools for me\" David said without changing his expression \"since they are dead I will just find new ones\".</p><p>\"A bandit is just a bandit in the end\" Evan said without much surprise because he never expected to see any loyalty among them.</p><p>\"But you are wrong about one thing\" Evan cracked his neck and said.</p><p>David raised an eyebrow and asked \"what is it?\"</p><p>\"You will not be able to find any new tools because you are also going to join them\" Evan said and charged toward David using haste skill.</p><p>Even though David was a D+ rank hunter, Evan's was too fast after using haste skill for him to react on time.</p><p>Evan clasped his hand and threw a punch at David's face, but just as his punch connected with David's face, Evan's eyes trembled because he felt like instead of hitting David's face, he just punched an unshakeable iron wall.</p><p>Evan looked at the face of David and saw his face skin take the sheen color of metal before his punch connected with his face.</p><p>Even before Evan can understand what was going on he felt danger like never before and without hesitation, he used shadow walk.</p><p>Just as Evan turned into a shadow David's fist which was covered in silver-like metal missed him.</p><p>Evan moved backward in his shadow form and after arriving ten meters away from David he stopped using the shadow walk skill.</p><p>When Evan once again looked at David he saw, somehow David's skin turned into a silver color metal and he looked like a metallic golem instead of a human. Spikes-like blades were coming out from his arms that looks quite sharp.</p><p>\"Do you think I become the leader of this group without doing anything? What did you say just now you will kill me, let me see how you are going to kill me. With the defense that my skill provides forget about killing me you won't even able to leave a scar on my skin \"David said to Evan while laughing.</p><p>When Evan saw how David turned into a metallic golem his expression didn't change and he looked at his nether steel sword with a smirk.</p><p>---) Nether Steel Sword (D-rank) :- A sword made from nether steel it is very sharp and can cut through even the hardest metal. Because of nether steel, the flow of mana is improved by 20%.</p><p>' Let's see if this sword can cut through his skin' Evan thought and without saying anything once again shot towards David.</p><p>According to details of his sword it can cut through even the hardest metal without even using mana. So what will happen if Evan used his mana that was even more powerful because of the strange black energy that was mixed in it.</p><p>Evan came before David who was still surprised because of his high agility and slashed at him while imbuing his mana in the sword.</p><p>\"Fool stop struggling, you can't harm me\" David shouted and used his arm to block the slash of the sword.</p><p>A light blue layer of mana mixed with a faint black layer shined around the nether steel sword and when it clashed against the metallic arm of David, a hand flew into the sky and red blood spurted out.</p>", "images": {}, "success": true, "cid": "67583756755596259"}