{"id": 32, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/bandit-attack-(part-1)_67537592836488629", "title": "Bandit Attack (Part 1)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Bandit Attack (Part 1)</h1><p>Henry's eyes twitched when he saw the hotel bill. Everything was fine except the food bill, and when he asked about it, he finally found the culprit who ate the food of an entire football team.</p><p>\"How the hell did he eat the food worth seven thousand credits?\" Henry paid the bill with a bleeding heart while cursing Evan for being a Snorlax.</p><p>\"Alright, let's go,\" Henry said to Evan and others after paying the bill and left the Four Seasons Hotel. While leaving, Henry was looking at Evan like he is his lifelong enemy. Evan already noticed this but ignored him because he was already aware of how costly his dinner was last night.</p><p>They all came near the city gate where Henry's driver was waiting for them. Just like previously, Evan and the other hunters sat down at the back of the van, and they all left Oklima City.</p><p>\"Hey, did you do something wrong? I felt like Henry was looking at you strangely?\" Dean asked Evan after they left the city.</p><p>Evan's mouth twitched when he heard this because he was aware of why Henry was looking at him like this, but for obvious reasons, he can't tell them about it.</p><p>\"I don't know, maybe he is not feeling good,\" Evan said, making an ignorant face as if he didn't know anything.</p><p>When Dean heard Evan don't know anything, he shrugged his shoulders because he asked out of curiosity.</p><p>After six hours, the van suddenly stopped moving, and the driver activated the barrier of the van.</p><p>\"There are some monsters in the way; we can't move forward before you guys clean them,\" Evan and the other hunters heard Henry's voice after the barrier of the van was activated.</p><p>They came out of the van and saw seven tiger-like monsters blocking their way. Three tigers were three meters tall, while four tigers were two meters tall, they had light yellow skin and black stripes all over their bodies, resembling the Bengal tiger.</p><p>\"Three D-rank and four E-rank forest tigers,\" George said after seeing the monsters.</p><p>'Let's check out the power of this new baby,' Evan thought after taking out his Nether Steel Sword.</p><p>'Haste!' Even before George and others could react, Evan used haste skill and charged towards the tigers alone.</p><p>\"Hey, wait for us!\" Dean shouted, and he also dashed towards the tigers with James and George.</p><p>The agility of Evan after using haste was too fast for a D-rank monster, so even before any tiger could react, Evan came before an E-rank tiger and slashed horizontally without using mana.</p><p>Swish!</p><p>Like a hot knife passing through butter, the head of the E-rank tiger was severed cleanly.</p><p>'The fifty thousand credits that I spent on this sword were worth it,' Evan thought when he saw how even without using his mana, the sword easily severed the head of the tiger.</p><p>Roar!</p><p>The remaining six tigers roared when they saw how Evan killed one of the tigers.</p><p>Swish!</p><p>Suddenly, a green aura appeared around all D-rank tigers, and they charged toward him with far greater agility than a D-rank monster.</p><p>When Evan saw the green aura, he remembered George telling him at the beginning of their journey that the forest tigers are famous for their agility.</p><p>'They are fast for a D-rank hunters, but for me.. ,' Evan thought and without much effort, jumped back and avoided the attack of three D-rank tigers.</p><p>With his D-rank monarch core and E-rank prime core, his agility was already much higher than a D-rank hunter, and with the help of the haste skill, his agility was in a completely different league when compared to D-rank monsters.</p><p>Even before the D-rank tigers could react, George came from behind and slashed at the back of one of the tigers.</p><p>James and Dean went to take care of the three remaining E-rank forest tigers.</p><p>Roar!</p><p>The forest tiger roared in pain when a deep wound appeared on its back because of George's attack.</p><p>All three D-rank tigers looked back at George when he suddenly attacked them, but it was a fatal mistake because Evan, who was standing in front of them, didn't miss this chance.</p><p>In a blink of an eye, he appeared before a forest tiger using his haste skill and slashed at the head of the tiger. Surprisingly, the forest tiger reacted quickly and with a quick movement, jumped back.</p><p>Because of its quick reaction, Evan wasn't able to kill it in a single move, but a large wound still appeared on its left shoulder.</p><p>Roar!</p><p>The tiger roared in pain, and Evan was about to finish it off while it was still trying to recover from his attack when one of the D-rank tigers opened its mouth and shot a dark green wind blade towards him.</p><p>'Shit,' Evan cursed when he saw he did not have enough time to dodge the blade. He quickly used his Nether Steel Sword and slashed at the incoming blade while imbuing his mana in the sword.</p><p>The flow of mana was a lot smoother than his previous sword, and when the Nether Steel Sword, covered in a light blue layer of mana and a faint layer of darkness, clashed against the dark green blade, it destroyed the dark green blade without any problem.</p><p>After destroying the green blade, Evan came before the forest tiger who shot the green blade at him earlier and with a swift motion, beheaded it even before it could react.</p><p>After killing the tiger, Evan didn't stop and quickly charged towards the other D-rank tiger and in just ten seconds, he killed it.</p><p>George also didn't take long, and after a minute, he also killed the last D-rank tiger.</p><p>Soon, Dean and James also finished the three E-rank tigers without any problem.</p><p>\"Let's look for cores and leave immediately,\" George said when he noticed other monsters would soon come here after smelling the blood.</p><p>But suddenly an arrow came out of nowhere and pierced the shoulder of George, and even before Evan and the others could react, three more arrows came towards them at lightning speed.</p>", "images": {}, "success": true, "cid": "67537592836488629"}