{"id": 30, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/oklima-city-(part-2)_67491072149865706", "title": "Oklima City (Part 2)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Oklima City (Part 2)</h1><p>\"Can you sell the core of that black ogre to me?\" Evan asked Dean and the others because he wanted to absorb the core of the black ogre using his monarch core.</p><p>\"Well, I don't mind since you also helped us take down that ogre,\" George said, looking at James and Dean. Both of them also didn't object, so George gave the core of the black ogre to Evan.</p><p>\"Let me know your account number; I will transfer the money,\" Evan said happily when he got the core.</p><p>George told his bank account number and said, \"just transfer forty-five thousand credits.\"</p><p>\"But D+ rank cores can be sold for sixty thousand credits without any problem,\" Evan said with a confused face because George was asking just forty-five thousand credits for a D+ rank core.</p><p>\"You also helped us take care of that ogre, so of course, we are not going to take your share,\" Dean said while waving his hands.</p><p>When Evan heard this, he smiled and transferred forty-five thousand credits to George, who will split it later.</p><p>He was happy that he didn't receive some trash hunters as a teammate who acts all mighty and tries to take the fortune of other people.</p><p>Even when Dean and the others found out Evan was just an E rank hunter at the start, they didn't mock him or say anything to him. At first, when Evan accepted this mission, he thought he would find some half-backed hunters who would try to do something stupid when they found out he was just an E rank hunter.</p><p>'Now I just have to advance my prime to D rank so I can once again absorb the cores through my monarch core,' Evan thought and put away the ogre core.</p><p>****</p><p>\"We should reach there in one hour,\" Dean said while looking outside.</p><p>\"Finally, I can sleep on a comfortable bed today,\" George said while yawning.</p><p>It has been two days since Evan and the others were attacked by the black ogres. Luckily, nothing major happened after the black ogre attack, and they were about to reach Oklima City.</p><p>During these two days, Evan was able to collect two more D-rank cores and five E-rank cores. Now he had three D-rank cores, five E-rank, and two D+ rank cores, but these are not enough to push his prime core to E+ rank.</p><p>On top of that, he is not going to use black ogre cores on his prime core.</p><p>'It went better than I expected,' Evan thought when he heard they would soon reach Oklima City.</p><p>One of the reasons he decided to do a mission instead of going to the dungeon was to gain some experience in missions because the practical exams for hunter academy students would be held soon.</p><p>Evan never participated in any practical exam because it requires showing your skills and strength, and Evan, who was nothing more than an F rank hunter, couldn't do anything during the practical exam.</p><p>Normally in practical exams, students receive a mission from the academy that they have to complete to get a better score. These missions can be anything like exterminating some monsters in a particular area, killing some bandits who rob the merchants, clearing a dungeon, and many more.</p><p>Now that Evan had enough strength, he also wanted to participate in the practical exams of the academy, which is why he decided to do a mission that would help him understand how everything works during a mission.</p><p>\"Look, we are about to reach there,\" Evan looked outside from the window after hearing Dean's voice and saw fifty meters high walls and a gate where two hunters were sitting, talking to each other.</p><p>\"I heard most of the cities are protected by a barrier, so why are there these high walls?\" Evan asked when he saw the fifty meters high walls.</p><p>\"Oklima City is also protected by a barrier, but it is pretty weak when you compare it to the barrier of Astrate City. Do you think a barrier of that magnitude can be installed everywhere?\" George said while looking at the high walls.</p><p>Evan nodded in understanding when he heard this; he also understands that a barrier that can repel every monster cannot be installed everywhere. After all, that kind of barrier must be very hard to create.</p><p>Soon, the van arrived near the city gate where two guards were sitting, both of them were C rank and looked quite bored.</p><p>Henry took out some papers and showed them to the guards, who allowed them to enter after checking the papers.</p><p>\"You guys can stay in the Four Seasons Hotel; I already booked your rooms there. Just show your hunter ID after going there. We will leave for Astrate City tomorrow when I am done with my business here,\" Henry said to Evan and the others after entering the city.</p><p>\"Let's go; I know where this hotel is located,\" Dean said and left with Evan and the others. Henry had to settle his cargo before he can go back to the hotel.</p><p>Evan looked around the city while following Dean. Unlike Astrate City, which is filled with modern buildings, most of the buildings in Oklima City were in the medieval style.</p><p>Evan felt like he came back in time when technology was not developed, but he knew only the look of the city was medieval style. There was every modern facility available in the city.</p><p>After ten minutes of walking, Evan and the others finally arrived before a large medieval-looking villa with the sign 'FOUR SEASON HOTEL' hanging on top of it.</p><p>They all went inside, and Evan was surprised when he saw how the floor was made of beautiful ivory wood that gave it a luxurious look.</p><p>'I wonder what is the cost of staying here for one night,' Evan thought when he saw how luxurious the hotel was. Even though Henry was the one who was paying, he couldn't help but think this because he spent most of his life being poor.</p><p>After entering the hotel, Dean and the others went to reception and showed their IDs.</p><p>Just like Henry said, after showing their IDs, the receptionist gave them the key to their room. Since all of them were pretty tired after guarding the cargo for two days without much sleep, all of them went to their rooms.</p>", "images": {}, "success": true, "cid": "67491072149865706"}