{"id": 39, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/who-is-this-guy_67699951458633395", "title": "Who Is This Guy", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Who Is This Guy</h1><p>\"If my charm continues to improve like this I think I will soon become mister world\" Evan said while rubbing his chin, Evan was standing before the mirror bare chest and his perfect body was on full display, his jet black hairs were little wet indicating that he just took a bath, if any girl sees him right now they will definitely get charmed by his devilish handsome look.</p><p>\"It's been a while since I last went into the class\" Evan said while wearing a black shirt that matched with his jet-black hair and deep black eyes.</p><p>Evan came out from his dorm room and left the boy's dormitory, after leaving the boy's dormitory Evan went towards his classroom.</p><p>\"Hey did you hear what happened last night?\" while walking Evan heard some students who were talking among themselves.</p><p>\"What happened?\" asked another student.</p><p>\"I don't know if it's true or not but I heard that trash Evan challenged Mike for a duel next Friday\"</p><p>\"Of course, it's not true how can that trash who is even afraid to enter a dungeon can challenge Mike\"</p><p>\"But I heard some students were talking about it, and apparently some time ago when Mike tried to pick a fight with him he even insulted Mike and his gang\"</p><p>\"Hey, look at this video\" suddenly one of the students showed a video to other students that was being viral in the hunter academy student's chat group.</p><p>\"Holy crap who is this guy\" the student who was talking about Evan's challenge a moment ago asked.</p><p>\"He completely crushed Lucas with just a slap\"</p><p>\"Isn't this guy looks like Evan\" another student said after seeing the face of the guy who slapped Lucas.</p><p>\"Don't jock around although he looks like him there is no way he is that guy, he looks more handsome and clearly he is at least C rank hunter if not above there is no way that trash can reach C rank\".</p><p>\"Can't you guys see he attacked Lucas when he was not paying attention it's clear that if Lucas was not careless he would have easily dodged that attack\".</p><p>'Who is this bastard who spread the video ' Evan thought in annoyness because he knew he will not be able to attend the class peacefully.</p><p>'I just hope no one will come to bother me' Evan thought when he arrived near his classroom.</p><p>Since the class was about to start most of the students were already present, when Evan entered the classroom students looked at him and were stunned to see a new student because most of the students didn't recognize Evan.</p><p>\"Isn't the same guy who slapped Lucas in the video?\"</p><p>\"Why he is in our class?\"</p><p>\"He looks like that trash Evan don't you think?\"</p><p>'He becomes more strong' James who was also present in class thought when he saw Evan.</p><p>'He changed once again' Valery who was also present in the class raised an eyebrow after seeing Evan, she saw him some days ago when Mike was picking a fight with him and was surprised when she saw how he changed completely.</p><p>Evan already expected this kind of reaction since he also know his look changed completely after he got his monarch's core so, he ignored them and went towards his seat at the back of the class where he usually sit.</p><p>\"Holy shit, that guy is really Evan he sat at the same seat where he usually sat\"</p><p>\"Did he do plastic surgery or something\".</p><p>'It's really annoying' Evan thought when he saw how all students were looking at him.</p><p>Mike and his gang were also present in class and they were staring daggers at him like they just want to rip him apart.</p><p>Evan ignored everything and started to browse the Internet.</p><p>After five minutes the professor finally came into class and Evan sighed in relief when students stopped looking at him.</p><p>\"Alright stop talking\" professor Elena said after entering the class.</p><p>Elena looked around twenty-five years old, she has long black hair light green eyes and she was wearing a knee-length skirt. She teaches students about the theory of monsters and most of the things that they need to know while facing monsters.</p><p>Elena looked around the class and when she saw Evan her eyes stopped on him for a moment but she didn't say anything.</p><p>\"Today I will teach you about the weaknesses of different types of monsters, it's important to know about the weaknesses of the monsters while facing them because it gets easy to kill a monster if you know its weakness'' Elena said and started the class.</p><p>She touched the screen that was present in class and an image of a snow-white tiger with deep blue eyes appeared on the screen.</p><p>\" As you all know it's a frost tiger one of the most common and at the same time dangerous monster that you can find in an icy environment. If you fight against it in an icy environment it will be very dangerous for you but if you know its weakness you can defeat it more easily\" Elena said after showing the picture.</p><p>\"Anyone knows how to deal with this monster properly\" Elena asked while looking at the students, some students raised their hands, Evan was also among them since during these two years he can't take any practical exam because of his low strength, he basically memorized most of the theory about monsters.</p><p>Elena looked around the class and pointed at a short hair boy, when the boy saw Elena was pointing at him he stood up and started to tell about the weaknesses of the frost tiger.</p><p>'I should ask about the practical exam after the class end' Evan thought with a bored look because he already knew most of the things that Elena was teaching.</p><p>\"Alright, that's it for today remember to revise what you learn today\" Elena said after her class ended and left the class.</p><p>Evan quickly stood up to go after Elena since he wanted to ask about the practical exam.</p><p>Just as Evan stood up to go after Elena someone came before him and said \"Oy, trash did you go through plastic surgery or something?\"</p>", "images": {}, "success": true, "cid": "67699951458633395"}