{"id": 35, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/loot_67607147936019922", "title": "Loot", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Loot</h1><p>\"Arghh!\" David screamed in pain and fell to the ground while holding his severed hand. Because of the pain he was feeling, David started to roll on the ground.</p><p>The severed hand of David fell two meters away from Evan, when he saw the severed hand of David, Evan's eyes trembled for a second, but they returned to normal very quickly like they never trembled.</p><p>\"Bastard, I will kill you,\" David shouted with blood-red eyes while trying to stop the blood that was coming out from his severed hand.</p><p>Evan did not say anything and slowly walked towards David, who was looking at him with blood-red eyes.</p><p>\"Didn't I tell you, you will die today,\" Evan said in an emotionless tone.</p><p>\"Die, you bastard,\" David shouted and suddenly the spikes that were coming out from his arm flew toward Evan like bullets.</p><p>\"Shadow Walk,\" Evan muttered and evaded the spikes by using the shadow walk skill. He appeared behind David using the shadow walk, and with a swift motion beheaded him even before he could react.</p><p>Thud!!!</p><p>A head rolled on the ground, and everything came to an end.</p><p>Evan looked at the headless corpse of David and took off the storage ring that he was wearing.</p><p>After taking David's storage ring, he went towards the body of Drew and picked up the barrier crystal as well.</p><p>After picking up the barrier crystal, he threw it toward Henry while saying \"deactivate the barrier.\"</p><p>After saying this, Evan silently went inside the van.</p><p>No matter what, it was the first time he killed a human, so although he wasn't feeling guilty because they were the first that tried to kill him, he still felt strange that he just killed two humans.</p><p>''Well, it was bound to happen someday after I was transmigrated into this world,'' Evan muttered to himself and stopped thinking about everything that just happened.</p><p>After ten minutes, George and others also came back into the van after Henry freed them from the barrier. George and others already killed Oliver when Evan threw him inside the barrier.</p><p>When George and the other hunters saw Evan, who was leaning back with his eyes closed, they didn't say anything and quietly sat down.</p><p>Soon the driver started the van once again. The effect of the black device that Drew used was canceled when he was killed by Evan since it requires mana in order to stop the functions of the van.</p><p>Time continued to pass, and soon night arrived. The driver stopped the van in a good area to spend the night and take some rest after what happened earlier.</p><p>During this entire time, no one talked about anything. Evan was busy with his thoughts, while George and the other hunters were also quite shocked because of the earlier event.</p><p>They knew that if not for Evan, they all would have died there without being able to do anything.</p><p>\"Let's spend the night here,\" Evan opened his eyes after hearing Henry. He came out of the van with George and others and stretched his stiff body a bit.</p><p>\"I will go look around our surroundings with James,\" George said and went to look around their surroundings for any monsters.</p><p>Henry and the driver also got to work and started to cook dinner after settling their signature outdoor barbecue.</p><p>George and James returned after twenty minutes and continued to monitor their surroundings before the dinner was cooked.</p><p>\"Dinner is ready,\" Henry shouted and called Evan and others for dinner.</p><p>\"You guys can eat; I will keep guarding,\" Evan said to the other hunters since he was not in the mood to eat anything.</p><p>George and the other hunters looked at each other and after shrugging their shoulders went to eat dinner.</p><p>When George and the others left, Evan took out the storage ring that he got from David and used a drop of his blood to link it to himself.</p><p>After linking the ring to himself, Evan looked inside to see what he got after killing those bandits.</p><p>When he saw the things inside the ring, a smile appeared on his face. 'At least they were not totally useless,' Evan thought after seeing ten D-rank cores and sixteen E-rank cores. There were some other things as well like healing potions, mana potions, and some other minor things.</p><p>'I should be able to push my prime core to E+ rank with all of these cores,' Evan thought happily after seeing the cores. One of the things that he hoped for before completing the mission was to gather enough cores to push his prime core to E+ rank , and because of bandits, his goal completed without any problem.</p><p>'I wonder what will happen when my monarch core will reach C rank,' Evan thought because whenever a person reaches at C rank they will get a job class.</p><p>Evan was not sure what will happen when his monarch core will reach C rank because other people only have prime core and they get a job class after reaching C rank.</p><p>'Will I get a job class when my monarch core will reach C rank?' Evan wondered while thinking about his monarch core 'but if I got a job class when my monarch core reaches C rank then what will happen when my prime core will reach at C rank?'</p><p>Evan had a lot of questions about his monarch core like the black energy that is mixed in his mana and his class and many more but he knew he will eventually get his answers when the time comes.</p><p>''Let's stop thinking about these things and focus on the things that are important for now,'' Evan muttered and his mood, which was a little down after killing those bandits, finally improved after seeing enough cores for his advancement.</p><p>'The next thing is the practical exam of the hunter academy,' Evan thought and looked at the half-moon in the sky.</p>", "images": {}, "success": true, "cid": "67607147936019922"}