{"id": 33, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/bandit-attack-(part-2)_67561049531931205", "title": "Bandit Attack (Part 2)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Bandit Attack (Part 2)</h1><p>Swish!</p><p>Evan heard the sound of an incoming arrow and, with sheer reflex, slashed with his sword in front of him.</p><p>Kachh!!</p><p>Evan's sword clashed against an arrow and cut it in two instantly. After cutting the arrow he quickly looked at Dean and James and saw that both of them were fine.</p><p>Dean was covered in earth armor, so the arrow wasn't able to pierce through it, and James also cut down the arrow using his spear before it could reach him.</p><p>\"What the hell is going on?\" Evan asked while looking around their surroundings.</p><p>Just as Evan asked, suddenly a light yellow barrier appeared around them.</p><p>\"Damm! It's a trap barrier, it must be the work of bandits,\" George said while taking out the arrow from his shoulder.</p><p>\"David, didn't I tell you the archery of this bastard is complete trash? Look, he wasn't even able to kill those trash hunters who were not aware of us,\" suddenly Evan and others heard a gruff voice and turned around.</p><p>When they looked behind them, they saw three men who were smiling like third-rate villains coming towards them. The man who just spoke was two meters tall, and his head was completely bald.</p><p>The man was holding a light yellow crystal that looked strangely similar to the color of the barrier in which they were trapped.</p><p>\"Whose archery is trash, you bald head? All of them are D-rank hunters, and I even managed to wound one of them,\" a short man who was holding a bow rebutted when he heard what the bald man said.</p><p>\"Hey, David, I don't think we need this bald head who just activates the trap barrier whenever we rob someone. We can do this on our own, why don't we just kick him out from our group?\" Oliver, the short archer, said.</p><p>\"Stop fighting and get back to work,\" David, the leader, said in a cold tone, and both Oliver and Drew shut their mouths.</p><p>Evan looked at the bandits with cold eyes because if he hadn't reacted on time earlier, the arrow would have pierced his head. He was sure that even with his current strength, it would have been very difficult for him to survive from that kind of injury. </p><p>Among the bandits, Oliver and Drew were D-rank, while David was D+ rank.</p><p>Evan came near the barrier and touched it. \"Shit!\" but just as he touched the barrier, he felt a electric shock and quickly removed his hand.</p><p>\"It's not going to work. We can't go out before the energy of the trap is exhausted, or they remove it using the controller,\" Evan heard Dean's voice who was looking at the bandits with grim expressions.</p><p>\"Quickly, turn back and move towards Oklima City.\" When Henry saw how Evan and others were trapped in a barrier by bandits, he decided to ditch them without hesitation because he knew there is nothing he can do to save them and he would die meaninglessly if he did not run away.</p><p>Just as the driver started the van to run away, Drew, the bald man, took out a strange black device and pointed it towards the van.</p><p>After pointing the device at the van, he clicked the only red button available on the device, and suddenly the barrier that was surrounding the van disappeared, and its engine also shut down.</p><p>\"Do they think we are stupid?\" Drew said while looking at the van with mocking expressions.</p><p>\"What happened?\" Henry asked in a panicked voice when the engine of the van suddenly shut down, and the barrier disappeared.</p><p>\"The engine is not working,\" the driver said in panic.</p><p>\"Oliver, bring them here,\" David said to the archer after Drew shut down the barrier of the van.</p><p>\"You bastard, remove this barrier and fight with me head-on,\" George shouted at the bandits while holding his shoulder that stopped bleeding after he drank a healing potion.</p><p>\"Are you stupid? We trapped you inside because we wanted to rob without a problem. Do you think we will remove the barrier just because you asked?\" Oliver, the short archer, said with a sneer and went towards the van.</p><p>\"Don't worry; we will remove the barrier soon. After all, it cost us too much energy to maintain it,\" Drew said with a sinister smile. When Evan and others saw his smile, an ominous feeling bloomed in their hearts.</p><p>\"But I don't think you guys will be able to see us remove this barrier,\" Drew took out a small bottle filled with dark green liquid.</p><p>\"Poison of the swamp python,\" James said with a dark look on his face when he saw the dark green liquid.</p><p>\"Oh, you know about this?\" Drew said in surprise when James recognized the poison. \"Then you should also know what I am going to do.\"</p><p>\"What kind of poison is that?\" Dean asked James since he didn't know about it.</p><p>\"The poison of the swamp python will turn into gas as soon as it comes into contact with air. If he throws that bottle inside this barrier, the air around us will become poisonous, and we will die,\" James said in a despair-filled voice because there is no way they will survive if the air around them becomes poisonous.</p><p>\"They will have to remove the barrier if they want to throw that bottle inside. Can't we go out at that moment?\" George asked when he heard this.</p><p>\"I don't think they need to remove this barrier. If my guess is correct, anyone can come inside the barrier from outside, but you can't go outside after entering the barrier,\" this time Dean answered with a helpless voice.</p><p>\"Please let us go; we don't have anything. You can check our van,\" Henry said while pleading when Oliver brought him.</p><p>\"We already know your van is empty, but I don't think your bank account is also empty. Just transfer two million credits into this bank account, and you can go,\" David said while showing a bank account number.</p><p>Henry's face turned white when he heard this and he said, \"I am just a normal merchant; how can I have two million credits in my bank account?\"</p><p>\"Do you think we are fools? Just by looking at your van, I can tell that you are not an ordinary merchant,\" David said in a cold voice after hearing Henry.</p><p>When Henry heard the cold voice of David, a chill ran down his spine, and he looked at Evan and the other hunters who were still trapped in the barrier.</p><p>\"Drew, kill them,\" David said when he saw Henry was looking at Evan and the other hunters.</p><p>When Drew heard this, he smiled sinisterly and looked at Evan and others.</p><p>\"Wait, I will transfer the money; don't kill them,\" Henry shouted when he heard what David said because if Evan and the other hunters died, there is no way he would be able to safely reach Astrate City.</p><p>\"Do it fast; my patience is limited,\" David said with an indifferent voice and showed the bank account number to Henry.</p><p>\"Ahrghh!\" Suddenly, David heard the scream of Drew and quickly looked back.</p><p>When David looked back, he saw one of the hunters who were trapped inside the barrier was looking at him coldly while his sword was plunged into the heart of Drew.</p>", "images": {}, "success": true, "cid": "67561049531931205"}