{"id": 31, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/new-sword_67514255309597122", "title": "New Sword", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>New Sword</h1><p>Evan and the others arrived in Oklima City in the afternoon. So, when Evan woke up after sleeping, it was already nighttime. He looked at the clock, and saw it was 7:30 p.m. He stood up and went to bathroom to wash his face.</p><p>\"I wanted to stay here for some time and relax a bit, after all, it is my first time coming out from Astrate City, but we are leaving tomorrow,\" Evan said with a sigh. He wanted to chill here before going back to the academy. Unfortunately, Henry will be going back tomorrow.</p><p>'I should visit the market and buy a sword,' Evan thought when he remembered the condition of his sword.</p><p>\"But first,\" Evan stood up with a bright smile, \"I am going to enjoy the most expensive dishes of this hotel,\" Evan said with a smile, knowing that Henry will be the one paying for the food he will eat here.</p><p>\"Since that guy is going back tomorrow, and I can't enjoy myself here by touring, I am going to plunder his money by eating every expensive dish here,\" Evan said to himself and ordered the most expensive dishes of the hotel through the landline phone of his room.</p><p>Just after ten minutes, someone knocked on the door of his room. When Evan opened the door, he saw a waiter with a trolley full of food. He allowed the waiter to enter the room, who left after putting all the food on the table.</p><p>\"Although I ordered everything in excitement, can I even eat all of this?\" Evan muttered to himself when he saw how many dishes he had ordered without even realizing it.</p><p>\"Well, I am in my growing phase; I should at least eat this much,\" Evan said and started to dig into the food.</p><p>\"I feel like I am a second-generation rich young master,\" Evan said while patting his round belly that became like a football after he was done eating everything.</p><p>\"Let's see if there is a weapon shop nearby,\" he said, taking out his phone.</p><p>After searching on the internet, he found some shops not so far away from his location. \"Alright, let's see if I can find something decent here,\" Evan said and left the hotel room.</p><p>After leaving the Four Seasons Hotel Evan went towards the market by following the map he got from the internet.</p><p>Many blacksmiths in the Arora world can create extremely powerful artifacts using various materials. Since Evan doesn't have much money currently, he wanted to buy a normal sword that he can use for the time being.</p><p>After ten minutes of walking, Evan came to a shop called \"Hoze Artifacts.\"</p><p>The things that blacksmiths create from monster body parts and other magical materials are called artifacts. Only extremely talented blacksmiths can create artifacts. The other way you can get an artifact is by clearing a dungeon. After clearing a dungeon, there is a high chance that you will receive an artifact as a reward.</p><p>\"Welcome,\" a male attendant said to Evan when he entered the shop, \"how can we help you?\"</p><p>\"I am looking for a sword,\" Evan said.</p><p>\"Please go to the second floor; most of the weapons are being sold there,\" the attendant said to Evan.</p><p>Evan nodded and went to the second floor. There were many weapons on the second floor, such as swords, spears, machetes, bows, and many others.</p><p>Evan went towards the section where most of the swords were placed. He ignored the E and F-rank swords and came into the D-rank sword section.</p><p>\"There are more than I expected,\" Evan said when he saw around fifty rank D swords.</p><p>He came before a light blue sword and looked at it.</p><p>---) Frost Sword (D-rank): A light sword created from the bones of a frost tiger; it can increase the power of your sword attack by 50%. The sword has ice attribute that can freeze the wounds of your enemy making them slower.</p><p>\"A 50% increase in sword attack is quite good,\" Evan thought and looked at another sword.</p><p>---) Moon Sword (D-rank): A sword made from the moonstone that absorbed the moonlight for twenty years. It does 10% extra damage to darkness-type monsters.</p><p>Evan continued to look at D-rank swords and eventually found a sword that he liked.</p><p>---) Nether Steel Sword (D-rank): A sword made from nether steel; it is very sharp and can cut through even the hardest metal. Because of nether steel, the flow of mana is improved by 20%.</p><p>Evan tried to imbue his mana into the sword and found it was flowing into the sword without any problem. Although this sword was normal when compared to other D-rank swords, Evan found this sword perfect because of its weight and size, which matched with his previous sword.</p><p>He went to the counter while holding the Nether Steel Sword, \"I want to buy this.\"</p><p>\"Nether Steel Sword, it will cost you 50,000 credits,\" the receptionist said after seeing the Nether Steel Sword.</p><p>Evan felt like his heart was bleeding, but he still purchased the sword. 'I just have five thousand credits left,' he thought.</p><p>Evan got one hundred and twenty thousand credits after selling the cores. He bought healing and mana potions along with some other things before coming on the mission. He spent twenty thousand credits on those potions. Then, he bought the core of a black ogre from George and others, and now this sword. In just a few days, he spent all of the money that he got after selling the cores.</p><p>'Sigh, I am dirt poor again,' Evan thought after leaving the shop.</p><p>He roamed around the city for some time after purchasing the sword and returned to the hotel after one hour.</p><p>When Evan came back, he met George and others who were talking to Henry.</p><p>\"You are back from your tour,\" Henry said when he saw Evan, \"we are going for dinner, want to join us?\"</p><p>\"Sorry, I already ate; you guys can go by yourselves,\" Evan said after hearing Henry.</p><p>\"Alright, remember we will leave early tomorrow morning, so take a good sleep,\" Henry said to Evan and went with George and the others.</p><p>Evan came back to his room and started watching a movie on his phone since he had nothing else to do.</p><p>The night passed away just like this, and the next day arrived.</p>", "images": {}, "success": true, "cid": "67514255309597122"}