{"id": 36, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/coming-back-to-academy_67630669324407018", "title": "Coming Back To Academy", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Coming Back To Academy</h1><p>\"Finally, it's over,\" Dean said while looking outside the window of the van. From the window, Evan and the other hunters could see the outline of Astrate city.</p><p>\"It was one of the hardest transport missions of my life,\" George said, recalling the black ogre and bandit attack.</p><p>\"Well, it doesn't matter now that we are back safely,\" Dean said and looked at Evan, who was still gazing out the window.</p><p>After the bandit attack, nothing major happened during their journey, and they all safely arrived at Astrate city.</p><p>They did encounter some monsters on their way back, but most of them were E and F rank, and Evan and the other hunters took care of them easily.</p><p>Evan did not get any high-rank cores, but he wasn't disappointed because he already had enough cores to push his prime corey to E+ rank.</p><p>After three minutes, the van finally entered the gate of Astrate city, and Evan saw the familiar city once again.</p><p>Upon entering the city, the driver parked the van where most of the transport vehicles were stationed.</p><p>When the driver parked the van, Evan and the other hunters came out. Henry also came out and walked towards them.</p><p>\"Thanks for your hard work. If not for you guys, I would have never come back here safely,\" Henry said to Evan and the other hunters as he approached them.</p><p>Evan and the other hunters just nodded; now that they were back in the city, they all wanted to finish everything quickly and get some rest.</p><p>Henry could see that all of them were quite tired after constantly fighting against monsters, so he didn't hold them back and gave them each a letter.</p><p>It was proof that they all completed their mission successfully.</p><p>Evan and the others took the letters and put them away in their storage rings. Evan and James could show this letter in the mission hall to receive their mission points, while George and Dean could show this letter at the association office to receive their payment.</p><p>After handing out the letters, Henry was about to walk away when Evan said, \"Aren't you forgetting something?\"</p><p>Upon hearing this, Henry's body stiffened for a moment, then he coughed and gave Evan a light yellow crystal and a black device, saying, \"I completely forgot about these.\"</p><p>Evan took the barrier crystal and the black device without any change in his expression.</p><p>Although he didn't know how to use them and left them in Henry's hands after killing the bandits because he was feeling off at that time, there is no way he would let Henry keep these precious artifacts.</p><p>'These two will fetch me a good amount of money,' Evan thought and put away both items in his storage ring.</p><p>\"It was a pleasure to work with you guys,\" Evan said to George and the other hunters after putting away the barrier crystal and black device. Evan was happy that his teammates were not some di*kheads who would try to kill the weakest member during the mission.</p><p>During the two years Evan spent in this world, he had often heard how some hunters killed their weakest member during the mission to rob their share and other things, so he was relieved not to have met those kinds of guys.</p><p>\"We were lucky you were doing this mission with us. Thanks for your help during all this time,\" George said with a grateful voice. Dean and James also nodded in agreement, as they knew that without Evan, this mission might have been their last.</p><p>\"Don't worry about it. Let's meet again in the future,\" Evan said with a smile after hearing George's words, and he started to walk away from them.</p><p>'Should I go directly to the academy?' Evan thought while walking. 'Let's go to a hotel and rent a room there. I will return to the academy after taking proper rest and having dinner.'</p><p>Evan hailed a taxi and asked the driver to take him to the Crown Hotel, which was pretty near to the academy, and he had heard that the food there was also quite good.</p><p>The driver nodded and started to drive towards the Crown Hotel. Evan closed his eyes and finally relaxed his tense muscles.</p><p>It was his first time doing a mission, so he was quite tired after not sleeping properly for the past few days.</p><p>Evan was so relaxed that he fell asleep while sitting in the taxi.</p><p>\"Wake up, young man. We arrived at the Crown Hotel,\" Evan woke up after hearing the shout of the old driver.</p><p>He looked outside and saw the Crown Hotel. \"Sorry, I fell asleep,\" Evan said to the driver and exited the taxi. He paid the taxi bill and looked at the grand building of the Crown Hotel.</p><p>'Just a few days ago, I couldn't even think about coming here,' Evan thought and entered the hotel.</p><p>He went to the reception and asked for a room. And just as usual, the receptionist was again a young man instead of beautiful big sister.</p><p>\"It will be 2000 credits,\" Evan's mouth twitched when he heard the hotel price, but he still paid.</p><p>The receptionist gave him the key to his room and told him to go to the third floor, where his room was located.</p><p>Evan entered his room, which was quite luxurious, and first decided to take a bath before doing anything else.</p><p>After taking a bath, Evan jumped onto the bed and lay down like a log. \"This mattress is quite soft. I can't even compare the mattress of my academy room with it,\" Evan said while rolling on the mattress.</p><p>'Should I steal this mattress using my shadow storage skill?' Evan thought with a wicked smile. His mentality was completely twisted after living like a beggar for two years.</p><p>Even though he could get hundreds of thousands of credits after selling the things he got after killing the bandits, he still couldn't change his mentality in just a few days.</p><p>Even before he decided what to do, the fatigue of his mission kicked in, and he fell asleep without even realizing.</p><p>When Evan woke up again, it was already 7:00 pm. Evan had arrived at the hotel around ten in the morning, so he had slept for around nine hours.</p><p>\"It's the first time I've slept for this long since coming to this world,\" Evan said while stretching his body after standing up.</p><p>Evan washed his face and ordered something to eat.</p><p>His food arrived in ten minutes, and Evan started to eat while cursing the hotel owner for the price of the food.</p><p>\"I will advance my prime core to E+ rank after going back to the academy,\" Evan said while taking a bite of the meat steak.</p><p>After eating, Evan headed out from his room and left the hotel to go to the academy.</p><p>The academy was quite close to the Crown Hotel, so he arrived there after ten minutes of walking.</p><p>When Evan entered the academy gate, someone bumped into him.</p><p>When he looked at the person who bumped into him, he saw a tall guy who looked like an orc, smiling at him.</p><p>'Again, this as*hole,' Evan sighed when he saw Mike and his gang.</p>", "images": {}, "success": true, "cid": "67630669324407018"}