{"id": 38, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/advancing-to-e-rank_67676806416747378", "title": "Advancing To E+ Rank", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Advancing To E+ Rank</h1><p>Evan took out a core and used a little mana to refine it. When Evan used his mana to refine the core its energy rushed toward his prime core and was absorbed by it.</p><p>Evan continued to refine one core after another since he was refining cores using his mana he wasn't able to absorb one hundred percent power of the core.</p><p>With each core that Evan absorbed he felt a little stronger and his prime core slowly started to move towards E+ rank.</p><p>There were around twenty D-rank cores that Evan got from David's storage ring.</p><p>When Evan absorbed the sixteenth core suddenly his prime core started to rotate and the mana from the surroundings started to rush toward him.</p><p>His prime core greedily absorbed the surrounding mana and Evan felt his power slowly increasing.</p><p>Evan also noticed that his prime core was absorbing less mana than his monarch core while advancing.</p><p>Evan still remembered when his monarch core advanced a mana vortex was formed near him because of how much mana his monarch core absorbed while advancing.</p><p>After one minute his prime core stopped rotating and mana from the surrounding also stopped rushing toward him.</p><p>Suddenly Evan felt a new wave of energy spreading all over his body and his power increased by another level.</p><p>Evan looked at his hand and closed his fist, the air around his fist trembled because of his sheer strength, when Evan saw this a smile appeared on his face.</p><p>Evan opened his status window and looked at it.</p><p>Name: Evan</p><p>Rank: E+</p><p>Monarch core rank: D</p><p>Strength: E+</p><p>Agility: E+</p><p>Mana: E+</p><p>Stamina: E+</p><p>Intelligence: E+</p><p>Luck: C</p><p>Charm: C+</p><p>Skill:- Shadow Walk, Haste, Shadow Bullet</p><p>Physique:- Shadow Monarch Physique</p><p>title:???</p><p>Job:- None</p><p>His prime core advanced to E+ rank, his luck become C and even his charm increased to C+ rank.</p><p>After confirming his status Evan closed his status window and put away the remaining cores because they were not enough to advance his prime core to D rank.</p><p>\"If I have enough cores I can advance to the next rank without any problem, I don't have to stabilize my core like other people after advancing to next rank\" Evan mumbled with a smile when he remembered another perk of his monarch core.</p><p>After advancing to the next rank people have to stabilize their core before they can once again absorb the energy from the core, if they absorb more energy without stabilizing their core there is a high chance that their prime core will break apart.</p><p>Evan never paid much attention to how people advanced their ranks before since he wasn't able to advance because of his shadow physique.</p><p>But now that he also started to advance using cores Evan suddenly found it weird that many hunters were stuck in the same rank for quite a long time, can't they just use more cores and advance their rank as much as they like.</p><p>When Evan looked on the internet about this issue he finally found hunters have to stabilize their prime core after advancing to the next rank.</p><p>How much time it takes to stabilize the core depends on the potential of the hunter, some people stabilize their core in a few days while some can take months.</p><p>There are even hunters who can't stabilize their cores for a lifetime after reaching to a certain rank because they don't have the potential to advance to the next rank.</p><p>When Evan found out about all this he was shocked because his prime core never destabilize even though he advanced from F rank to E+ rank in just mere days.</p><p>Unlike other hunters, he advanced three times in just mere days and his prime core is still as stable as Mount Tai.</p><p>Evan was confused why he don't need to stabilize his core after advancing. In the end when Evan didn't find anything he thought it must be another effect of his monarch core.</p><p>'If I am not wrong I don't have to stabilize my prime core as long as my monarch core's rank is higher than my prime core' Evan thought after seeing how his prime core is completely stable even after reaching E+ rank.</p><p>\"I will collect more cores and after advancing my prime core to D rank I can once again start advancing my monarch core\" Evan said out loud while thinking about his monarch core.</p><p>\"I can't wait to see what will happen when my monarch core will advance to C rank, will I get any class from my monarch core?, if I do get a class from my monarch core then what will happen when my prime core will advance to C rank\" just thinking about the possibility what will happen when his both cores will advance to C rank Evan can't help but want to collect enough cores right now and advance to C rank.</p><p>\"I have to sell the things I got from David's storage ring, my bank account is almost empty\" Evan said after remembering the balance in his bank account.</p><p>Evan has one barrier crystal, one black device, and some other things that he found in David's storage ring. Along with those things Evan was planning to sell the storage ring that he got from David and some E-rank cores that he collected during his mission.</p><p>Evan is not going to absorb the energy from E-rank cores because even after absorbing energy from E-rank cores he knew his prime core will barely able to move forward since it is already E+ rank.</p><p>So instead of wasting those E-rank cores by absorbing them, he decided to sell them and earn some money.</p><p>\"I also have to prepare for the practical exam since it's the first time I am going to take this exam\" Evan rubbed his temples just by thinking how many things he have to do.</p><p>\"Let's see what will happen in classes tomorrow I don't even know what am I supposed to do in practical exams hopefully I will get some information tomorrow\".</p>", "images": {}, "success": true, "cid": "67676806416747378"}