{"id": 37, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/challenge_67653428356119838", "title": "Challenge", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Challenge</h1><p>\"Can't you walk while watching in front of you?\" Evan said in an irritated tone because he was in good mood just by thinking about advancing his prime core to E+ rank, but he bumped into these morons who will surely try to pick a fight with him.</p><p>The person who bumped into Evan was Lucas who was looking at Evan with a cold smile.</p><p>\"Did you say something?\" Lucas asked while looking down at Evan since his height was around 210 cm.</p><p>Evan sighed when he saw this 'I might as well settle everything with them so I will not have to waste my time with them in the future'.</p><p>\"Hey, I ask you something did you say something to me?\" Lucas asked once again while grabbing the collar of Evan.</p><p>Mike was watching everything with a cold smile 'this bastard was saved by Valery last time, but let's see who will save him this time'.</p><p>Since they were at the gate of the academy there were not many students.</p><p>Only a few students were watching everything and they had no intention of intervening in this mess.</p><p>\"I warned you guys last time don't mess with me again\" Evan said while looking at Mike since he is the leader of their gang.</p><p>Currently of the four members of Mike's gang only Lucas and he was present the other two whose name Evan didn't bother to remember were not there.</p><p>Mike just showed a cold smile to Evan and sent a signal to Lucas.</p><p>When Lucas saw the signal Mike sent him he smiled coldly, Evan also saw how Mike sent a single from his eye to Lucas 'typical clinch plot of an old movie where third rate villain uses his eye to give order to his subordinate' Evan thought after seeing the signal that Mike gave.</p><p>'Let's finish this so I can advance my core to E+ rank' Evan thought and even before Lucas can do anything, he used his left hand to free his collar from the hand of Lucas, and while using more than half of his strength slapped Lucas using his right hand.</p><p>Since Lucas wasn't expecting Evan to attack him suddenly he wasn't able to do anything, with his strength Evan easily freed himself from Lucas.</p><p>And with his high moment speed because of his agility even before Lucas can react Evan's right hand arrived before his cheek.</p><p>Slap!!!</p><p>Thud!!!</p><p>A loud sound rang out Lucas's head was smashed against the cold ground of the academy floor.</p><p>The power behind Evan's slap was too much that Lucas's head was smashed against the ground because of the impact of his slap.</p><p>Lucas's jaw was dislocated, some of his teeth were broken and his mouth was bleeding, even his head was bleeding because of how hard his head smashed against the cold ground, Lucas's eyes rolled inside his head because of the sudden attack and he passed out.</p><p>Mike and the other students were shocked when they saw the condition of Lucas just after taking a slap from Evan.</p><p>They all looked at Evan with their eyes wide open and saw him looking at Mike with an expressionless face.</p><p>When Mike saw pitch-black eyes of Evan his heart trembled for a moment.</p><p>\"Let's have a spar next Friday, if I win stop bothering me with your nonsense again\" Evan said to Mike without any expression on his face and started to walk inside the academy leaving behind a dumbfounded Mike and some shocked students who were lucky enough to see everything.</p><p>Evan did not wait to hear Mike's response because he was 90% sure that Mike will accept his challenge.</p><p>If Mike refused his challenge he will not be able to control Lucas and the other members of his gang.</p><p>Mike watched the back of Evan while his back was drenched in cold sweat, he looked at the condition of Lucas and can't help but gulp down his saliva.</p><p>\"How the hell he can knock out a D-rank hunter just by a slap?\" some students who saw everything were shocked because they never expected something like this to happen.</p><p>Evan is known for being the weakest hunter in the academy so it was not surprising that most of the students who saw Evan knocking out Lucas with just a single slap were shocked.</p><p>\"I don't care how he did it, but do you think Mike will accept his challenge?\" some students wondered while looking at Mike who was trying to wake up Lucas.</p><p>Evan didn't care much about the challenge he just made, because he did all this so that Mike and his gang will not bother him again in the future.</p><p>Evan first went into the mission hall to receive his mission points.</p><p>Evan went to the reception of the mission hall and saw a different receptionist there.</p><p>\"How can I help you?\" the receptionist asked Evan when he was him.</p><p>\"I am here to submit my mission\" Evan said while giving the letter that Henry gave him to the receptionist.</p><p>The receptionist checked the letter and scanned it into the computer and after a minute when he didn't find anything wrong he nodded and said \"give me your academy hunter card I will transfer twenty mission points in it\".</p><p>Evan handed his hunter card and after a minute the receptionist returned him his card.</p><p>\"Do you want to accept another mission?\" the receptionist asked after transferring the mission points to Evan.</p><p>\"Not now\" Evan refused politely and left the mission hall and went towards his room.</p><p>\"Tomorrow is the sword manship class of professor Robert although I don't need to learn Sword manship now because I have enough power to protect myself even without a sword, I should at least inform him I will not come to his class anymore\" Evan mumbled to himself after sitting down on his bed.</p><p>Students of the academy can only skip classes if they are out on a mission or doing a dungeon raid, if they are not out on a mission or doing something important they can't skip classes at the academy.</p><p>Evan was able to skip classes this week because he was out on a mission and it is the first time since he joined the academy that he skipped classes.</p><p>Previously Evan can't accept the mission from mission hall because of his low strength so he never skipped a class before.</p><p>\"Let's advance to E+ rank\" Evan said and sat up crossed legs while taking out cores that he got after killing bandits.</p>", "images": {}, "success": true, "cid": "67653428356119838"}