{"id": 44, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/going-out-from-the-city_67792296208287460", "title": "Going Out From The City", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Going Out From The City</h1><p>'Since tomorrow is Sunday and I don't have to attend any class, I should leave for the wilderness now so that I can hunt for today and tomorrow' Evan thought after coming out from the city plaza.</p><p>Since Evan decided to hunt the monsters in the wilderness he did not wait and took a taxi and went towards the city entrance. He already has everything that he needs in the wilderness since he recently finished his mission.</p><p>Evan did not use his hoverboard in the city because he never used a hoverboard before and he was sure that if he use it in the city for the first time he will definitely crash against someone.</p><p>'I will practice with this hoverboard in the wilderness'.</p><p>After reaching the city gate Evan exit the taxi and paid the bill.</p><p>Evan went towards the city gate where two C+ rank guards were stationed.</p><p>When Evan reached near guards he showed them his hunter card and easily left the city. Instead of going on the trade route from which merchants and other people travel in the wilderness, Evan was planning to go deeper into the wilderness so he can hunt more monsters.</p><p>After coming out of the city Evan took out his hoverboard and stood up on it, after standing up on the hoverboard Evan channeled a little mana in it and the hoverboard started to lift upwards.</p><p>When the hoverboard reached three meters high from the ground Evan stopped channeling his mana in the hoverboard and it stopped going upwards.</p><p>Evan willed the hoverboard to move forward and suddenly the hoverboard moved forward like a bullet.</p><p>\"Holy mother stop\" Evan shouted in a scared voice when the hoverboard moved forward at the speed of around one hundred and fifty kilometers per hour.</p><p>When Evan shouted the hoverboard suddenly stopped, and Evan received a backslash because of how abruptly the hoverboard stopped, luckily because of the safety mechanisms of the hoverboard he didn't fall down from it.</p><p>\"Pukkk!\"</p><p>Unfortunately, he still spits out his breakfast because of the sudden backlash, and his head was spinning.</p><p>\"Damm, it's harder than I thought\" Evan muttered while massaging his head, he never thought that he won't be able to control the speed of the hoverboard.</p><p>Evan had to spend two hours before he was finally able to ride his hoverboard properly.</p><p>\"I heard kids use these hoverboards in this world instead of the bicycles are those kids some kind of lunatics how can they ride something so dangerous\" Evan muttered when he was finally able to control the hoverboard. His face was pale and his hairs were messy after he was done learning how to ride a hoverboard.</p><p>\"Let's forget about them, now that I can ride this bad boy properly I can finally move deeper into the wilderness\".</p><p>After confirming that he was going in the opposite direction of the trade route Evan finally set off to kill some monsters and get cores.</p><p>Since Evan is going deeper into the wilderness there is a chance that he can encounter monsters who are above D rank because the association only cleans the area around the trade route.</p><p>If Evan went too deep into the wilderness there is no guarantee that he will be able to come out safely, that is why although Evan was going in the opposite direction of the trade route he wasn't planning to go too deeper into the wilderness.</p><p>Another reason Evan decided to go in the opposite direction of the trade route was that he will have an easier time finding monsters if he go in the opposite direction of the trade route.</p><p>Evan traveled for two hours on his hoverboard and was now around one hundred kilometers deeper into the wilderness.</p><p>During these two hours, Evan saw some E-rank monsters but he ignored them because E-rank cores can't help him much so he didn't waste his time on them.</p><p>Suddenly Evan stopped his hoverboard when he saw two three meters tall bears in front of him both bears were covered in light brown fur and were releasing the aura of D+ rank.</p><p>\"Finely some useful monsters\" Evan said when he saw the bears, he put away his hoverboard in his storage ring and went towards the bears on his foot.</p><p>'Now that my prime core is E+ rank and my monarch core is D rank I should be able to easily kill any monster who is below C rank' Evan thought and arrived near bears.</p><p>Roar!!! Roar!!!</p><p>Both bears roared when they saw Evan and like an enraged bull charged toward him.</p><p>Evan also took out his nether steel sword and shot toward both bears without any fear, while charging towards bears Evan used haste skill and appeared before one of the charging bears like a ghost.</p><p>The bear who was charging towards Evan was startled when, Evan suddenly appeared before it, but even before it can do anything Evan closed his fist and with a warcry threw a punch at the face of the bear.</p><p>Evan wanted to test his physical strength after his prime core advanced to E+ rank, he knew that a normal E+ rank hunter will never be able to harm this bear with only his physical strength.</p><p>Evan knew that his body is far stronger than any D+ rank hunter because of his monarch core, but he wanted to know can he fight against this D+ rank bear with just his physical strength who is famous for its physical strength.</p><p>Evan used mana to enhance the strength of his punch and like a rocket, his punch landed in the face of the bear.</p><p>Boom!!</p><p>Roar!!!</p><p>A small explosion happened when Evan's punch landed in the face of the bear.</p><p>The bear roared in pain when Evan's punch landed on its face.</p><p>The momentum that the bear created while running towards Evan completely disappeared and it took three steps back while roaring in pain, the nose of the bear was broken and its face was dyed red because of the blood that was coming out from its nose.</p><p>\"Hahaha\" Evan burst into laughter when he saw the result of his punch because he was sure that even a C-rank hunter can't stop this bear with just a single punch.</p><p>The second bear also stopped running and was looking at Evan with its eyes wide open like it was looking at a monster.</p><p>\"Now, don't look at me like this because I am only getting started\" Evan said to the bear with a wide smile when he saw the shocked face of the bear.</p><p>When the bear saw the smile of Evan a chill run down its spine and it finally realizes the human in front of it is not someone it can mess with.</p>", "images": {}, "success": true, "cid": "67792296208287460"}