{"id": 40, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/tournament-between-academies-(part-1)_67722756912901925", "title": "Tournament Between Academies (Part 1)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Tournament Between Academies (Part 1)</h1><p>Evan looked at the person who stopped him and saw a 180cm tall boy standing before him.</p><p>\"What do you want Rio?\" Evan asked while looking at the boy.</p><p>Rio has brown spiky hair and his build is similar to Evan's.</p><p>\"What can a trash like you can give me, I am just curious what happened to you and why your look changed this much in just one week\" Rio said while putting one of his hand on Evan's shoulder.</p><p>\"I don't think I need to tell you what happened to me\" Evan said in an indifferent voice while removing Rio's hand from his shoulder \"and don't try to touch me again I am sick of people who always try to grab my collar or touch me without any reason\".</p><p>Rio looked at Evan closely and seeing his indifferent expression before him he suddenly burst into laughter.</p><p>\"Looks like rumors are true, you really grow some backbone\" Rio said while laughing, but he suddenly stopped laughing and said to Evan in a cold voice \"although it's good to show courage you should k..\" Rio wasn't able to finish what he was saying when Evan grabbed him by the throat.</p><p>After grabbing Rio's throat Evan lifted him up from the ground and said \"I don't care what you want to say so spare me your bullshit, and don't try to bother me anymore\".</p><p>Rio tried to free himself from Evan's clutches but found to his horror that no matter how much he tries he can't free himself from Evan's grasp.</p><p>When Rio tried to free himself he felt like he is a kid, who is trying to free himself from an adult.</p><p>\"If you got any problem with me you can also challenge me on Friday with that trash, but if you try to bother me again I will make sure that you regret not listening to my advice\" Evan clutched the throat of Rio with even more strength and his face turn purple because of the lack of oxygen.</p><p>Tears started to come out from Rio's eyes and he tried to speak something but because of how tightly Evan was holding his throat he wasn't able to say anything.</p><p>\"That's enough you should let him go now\" Valery came near Evan and said to him after seeing Rio's condition.</p><p>Evan also didn't want to waste his time anymore since he wanted to ask about the practical exam from professor Elena so he freed Rio.</p><p>When Evan freed Rio he fell to the floor of the academy while grasping for air his face was full of horror and his whole body was shaking.</p><p>After freeing Rio, Evan didn't even look at him and quickly left the classroom.</p><p>\"Is he really that weakling Evan?\" one of the students finally spoke when Evan left the classroom.</p><p>\"How the hell he become this strong in just a single week?\"</p><p>\"Was that guy hiding his strength all along?\" a student said while looking at Rio who was still gasping for air.</p><p>\"Now I can't wait to see his fight against Mike on Friday\" a student said and everyone looked at Mike who was sweating buckets while looking at the condition of Rio.</p><p>'I hope no one will bother me from now on after seeing this' Evan thought while quickly moving towards the staff room to catch up with professor Elena.</p><p>\"Professor Elena\" since Evan didn't waste too much time with Rio he was quickly able to catch up with professor Elena.</p><p>Elena looked back after hearing Evan's voice and saw him coming towards her with hurried steps.</p><p>\"Professor, I wanted to ask you something?\" Evan said after coming near Elena.</p><p>\"You want to know about the practical exam right?\" Elena said with a smile on her face.</p><p>Evan was taken aback after hearing this and asked with a surprised expression \"how do you know this?\".</p><p>\"Just after seeing you in class I understood that you somehow solved the problem of your physique, and now that you can improve your power just like other hunters I can guess that you will be taking practical exams with other students\" Elena said after seeing the surprised face of Evan.</p><p>Hearing Elena, Evan nodded and said \"you are right I also want to participate in the practical exam this time\".</p><p>\"Let's go to my office since it will take some time to explain everything to you, the practical exam this time is special\" Elena said and once again started walking towards her office.</p><p>Evan was not surprised that Elena know about his physique because most of the professors who taught Evan during his academy life know about his physique.</p><p>In order to not participate in practical exams students have to give a proper reason and since Evan missed the practical exam each year he had to tell about his physique to the professor each year.</p><p>Evan already prepared a good story about how he solved the problem of his physique so he was not afraid that someone else will find out about his shadow monarch physique.</p><p>\"Take a sit\" Elena said to Evan after they enter her office.</p><p>\"Can you first tell me how you solved the problem of your physique?\" Elena asked Evan after he sat down.</p><p>\"It happened last Sunday when I entered the shadow kingdom dungeon..\" Evan started to tell her a fake story that he created last night.</p><p>Evan told her that he entered the shadow kingdom dungeon and used an invisibility potion to hunt some D-rank shadow monsters. Everything went according to his plan and he successfully killed ten D-rank monsters before the effect of the invisibility potion ended and got three cores from those ten monsters.</p><p>\"When I absorbed those three shadow cores, I advanced from F rank to F+ rank and I felt my physique changed somehow after I advanced to F+ rank..\" Evan continues to tell Elena his fake story.</p><p>\"So after advancing F+ rank when you tried to absorb cores once again you found you can now absorb the cores just like everyone right? \" Elena asked after Evan told his fake story.</p><p>\"Yes\" Evan said while praying inwardly that Elena will believe in his fake story.</p>", "images": {}, "success": true, "cid": "67722756912901925"}