{"id": 42, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/sorry-i-prefer-woman_67769591668982928", "title": "Sorry I Prefer Woman", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Sorry I Prefer Woman</h1><p>The man who was coming towards Evan had narrow eyes, his ears were folded a little and he had a strange goat mustache, his beard was also trimmer in an irregular way and just from his face, Evan was sure that this guy is up to no good.</p><p>If Evan had to describe the man in a wuxia novel style he would say \"from his folded ears it looks like this guy sold his master after poisoning him, narrow eyes that are eager to peep at his junior sister who is about to take bath, goat mustache that he is rubbing while watching his senior brother who is being eaten by some ants, strange beard trimmed in an irregular way by his junior brother when he was in his late years\".</p><p>\"How can I help you sir?\" while Evan was evaluating the man in a strange way the man came near him and asked politely.</p><p>\"How can you do this to your own master?\" Evan asked absent-mindedly while still immense in his strange thoughts.</p><p>\"Master? What master?\" the man asked in a baffled voice after hearing Evan.</p><p>\"Huh!\" Evan came out from his thoughts after hearing the baffled voice of the man and saw he was looking at him strangely only now Evan realized he spoke out his mind loud cough* Evan coughed to change the topic and said \"nothing I was just asking I want to sell different things so where should I go\".</p><p>Although the suspicious-looking innocent man thought Evan was looking at him strangely he still nodded and said \"can you tell me what you want to sell?\"</p><p>Hearing the man Evan was hesitant a little because of the suspicious-looking face of the man but since he can tell that man was just a normal human he was sure that this man won't be able to do anything to him.</p><p>Evan told everything that he wanted to sell after hearing what Evan wanted to sell the man nodded and said \"alright please come with me I don't know much about these items so please wait In the waiting room for some time I will quickly inform someone, who will come to attend you\"</p><p>Evan nodded and followed the man, while following the man Evan realized the man is quite polite and seems to care about the customers it was just his face that make him suspicious.</p><p>'I shouldn't judge people by their appearance' Evan thought when he remembered how he created a strange picture of the man just because his face is quite strange.</p><p>'If the face of this guy is not like this I am sure with his manners and way he spoke with customers he could have easily become a manager of this place' Evan thought and looked at the man with eyes filled with pity.</p><p>When the man saw how Evan was looking at him he made a weird face and said while coughing \"sir, although you are quite handsome I still prefer women\".</p><p>Evan who was looking at the man with eyes filled with pity almost fell to the ground he looked at the man with his eyes wide open and asked \"what the hell are you talking about?\"</p><p>\"The way you are looking at me, with your eyes full of affection I am too familiar with this look most of the customers that I handle here give me the same look filled with affection. What can I do I know I was born with this face that attracts everyone who looks at me but I can't let you have me since I prefer women\" the man said with an apologetical smile like confronting Evan for being rejected by him.</p><p>'Is this guy gone senile? Evan was speechless after hearing what the man said,' 'I am looking at him with pity-filled eyes and this crazy bastard saying don't look at him with affection-filled eyes' the more Evan looked at the apologitcal smile of the man the higher his blood pressure rose.</p><p>Evan took out his nether steel sword and said \"crazy bastard if you say anything else I swear I will kill\".</p><p>When the man saw Evan taking out his sword he was scared shitless he quickly backed away and nodded while looking at Evan with wronged expression.</p><p>When Evan saw the wronged expression on the strange face of the man he tried his best not to behead him on the spot.</p><p>\"Just lead the way to the waiting room and bring the person who will inspect the things I want to sell\" Evan said while taking a deep breath to calm down.</p><p>The man nodded his head obediently and started walking towards the waiting room.</p><p>'Did my rejection hit him too hard' the man thought while leading the way, 'I should apologize to him properly later I don't want him to commit suicide because I rejected him'.</p><p>Evan was regretting his decision for showing pity for this bastard but how can he know this suspicious-looking innocent man will have a twisted mind 'I swear I am not going to look at anyone with pity, who knows when I will come across another lunatic' Evan swore and promised himself to never look at another human with pity.</p><p>\"Please wait here for some time someone will come to assist you soon\" the man said to Evan in an awkward tone after they reached the waiting room.</p><p>Evan went inside the room and sat on the expensive-looking sofa, the man didn't enter the room and said \"I will send someone quickly\" after saying this the man closed the door and left.</p><p>Evan sighed in relief when the lunatic left him alone but suddenly the door opened a little and he heard the voice of the man \"I know it's hard to overcome a rejection but I am sure with your handsome face you will be able to find someone better than me\".</p><p>Evan almost coughed out two liters of his blood when he heard what the man said \"I swear if this guy appeared before me I will kill him\".</p>", "images": {}, "success": true, "cid": "67769591668982928"}