{"id": 43, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/earning-a-fortune_67770034570712313", "title": "Earning A Fortune", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Earning A Fortune</h1><p>Five minutes after the lunatic left the door of the waiting room opened once again and a man entered the room.</p><p>The man was wearing a neat black suit and looked in his mid-thirties and Evan was glad his face doesn't look like someone who sold his sector.</p><p>\"Hello, thanks for waiting I am Ron\" the man introduced himself while extending his hand for a handshake.</p><p>\"I am Evan\" Evan shook his hand and nodded.</p><p>\"Dylan told me you want to sell some equipments, cores, and the body of the black ogre,\" Ron said and sat down in front of Evan.</p><p>\"Yes\" Evan said and took out thirteen E-rank cores, a storage ring that he got from David, barrier crystal, and the black device that bandits used along with these things Evan also took out an E-rank sword and armor that he found in David's storage ring.</p><p>\"You have some interesting things\" Ron said when he saw the barrier crystal and the black device.</p><p>Ron picked up the barrier crystal and inspected it closely after checking it for one minute he put down the barrier crystal and picked up the black device while saying.</p><p>\"Seeing you have both barrier crystal and interference device you must have gotten these things from bandits since they occasionally use these two things to attack people in wildernesses\" Ron said while looking at the black device.</p><p>Evan did not say anything after hearing Ron and just looked at him wondering how much he will offer him for these things.</p><p>\"Although these things are in good condition their model is quite old, there are better barrier crystals and interference devices available in the market\" Ron said after checking the barrier crystal and black device.</p><p>'Don't beat around the bush and just tell me can I become a rich young master or not' Evan shouted inside his mind after hearing Ron.</p><p>\"I can offer you two hundred thousand credits for barrier crystal and one hundred thousand credits for interference device\" Ron said calmly while looking at Evan.</p><p>Evan's facial expression did not change after hearing Ron but his heart was beating furiously just after hearing how much he will get 'I can finally say goodbye to cup noodles now this young master will only eat expensive meat every day'.</p><p>\"Can you tell me how much the new barrier crystal and an interference device cost?\" Evan asked not showing his happiness.</p><p>\"The model of these devices is quite old so these things don't cost much. A new barrier crystal cost around three hundred thousand credits and an interference device cost around one hundred and fifty thousand credits\" Ron said honestly without hiding anything.</p><p>'Don't cost much the money sense of this guy is completely twisted' Evan thought when he heard the price of new devices.</p><p>After hearing Ron, Evan was satisfied with the price Ron was giving him so he nodded.</p><p>When Evan accepted the price Ron looked at other things and said \"for these E rank cores I can give you ten thousand credits each, forty thousand for storage ring, twelve thousand for this armor, and eight thousand for sword so that will be one hundred and ninety thousand credits\".</p><p>Evan gulped down audibly just after hearing how much money he was getting.</p><p>\"Didn't you say you also have the body of a black ogre?\" Ron asked Evan since the body of a black ogre is quite rare.</p><p>Evan nodded and tapped his foot on the ground suddenly Ron saw the body of a black ogre start to emerge from the ground.</p><p>\"What a cool skill you can store monster's bodies inside the ground\" Ron said when he saw how a body suddenly emerged from the ground.</p><p>Evan didn't say anything and just waited to hear how much he will get for this body.</p><p>Ron inspected the body of the black ogre and was pleased to find out the body was in excellent condition because Evan killed it cleanly by destroying its brain using a shadow bullet.</p><p>\"The condition of the body is excellent I can offer you thirty thousand credits for this body\" Ron said after checking the body.</p><p>Evan was more than happy to sell black ogre at thirty thousand credits so he nodded.</p><p>\"Alright just wait a moment\" Ron said and calculated the entire sum.</p><p>After a minute Evan left the waiting room while looking at his phone which was showing the balance of his bank.</p><p>\"Finally I can say goodbye to being poor\" Evan said and instead of leaving the city plaza, he went to the sixth floor of the plaza.</p><p>'Professor Elena said not to enter the dungeon for some time, but I need cores to improve my power I can't wait until the situation with dungeons is solved' Evan thought and arrived at the sixth floor of the academy.</p><p>Since Evan can't go to the dungeon to gather cores he decided to hunt monsters in the wilderness but he need something to travel faster in the wilderness which is why he came to the sixth floor of the plaza.</p><p>Evan came to the reception on the sixth floor and said \"I want a C-rank hoverboard\"</p><p>The receptionist nodded and tapped at the table in front of him and a holographic screen appeared before Evan showing him different kinds of hoverboards.</p><p>\"These are the designs that are available in C rank hoverboards please choose one\" the receptionist said to Evan after showing him the holographic screen.</p><p>Evan didn't care much about the design and chose a navy blue hoverboard, soon a staff member brought the hoover border Evan selected.</p><p>Evan checked the hoverboard and nodded in satisfaction.</p><p>\"How much is this?\"</p><p>\"It will be one hundred and eighty thousand credits\".</p><p>Although Evan's heart bleed when he heard the price he still purchased the hoverboard because he will be using this thing for a long time.</p><p>\"Now that I have a hoverboard, I can easily move faster in the wilderness and search for monsters\" Evan mumbled to himself after leaving the city plaza.</p>", "images": {}, "success": true, "cid": "67770034570712313"}