{"id": 41, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/tournament-between-academies-(part-2)_67746448220934839", "title": "Tournament Between Academies (Part 2)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Tournament Between Academies (Part 2)</h1><p>\"What the hell you were thinking when you enter a D-rank dungeon alone?\" Elena asked Evan while glaring at him.</p><p>\"I was thinking about getting cores\" Evan said while laughing nervously.</p><p>\"You want me to beat you up?\" Elena said while smacking the head of Evan. It's been ten minutes since Evan finished telling his fake story and Elena is lecturing him for entering a D-rank dungeon alone while he was just an F-rank hunter.</p><p>\"I was just joking and I enter the dungeon because I had no other choice, I can't always be stuck at F rank\" Evan said while rubbing his head.</p><p>\"I know what you are talking about but still didn't I tell you before you can become a theory professor in the academy even if you are not a high-rank hunter, with your knowledge of beasts it would have been very easy for you to become a professor here\" Elena said.</p><p>\"I know but I did not want to become a professor that's why I enter the dungeon\" Evan said while shaking his head because he never wanted to become a professor.</p><p>\"Forget it I am glad you didn't die there and even solved the problem of your physique\" Elena said after hearing Evan.</p><p>'Actually, I almost died there' Evan said In his mind remembering how that bat almost killed him.</p><p>\"The practical exam will be held next month, I can't tell you details about the exam because the staff is still discussing what kind of test we should give you guys\".</p><p>\"But one thing is for sure you will have to work in a team to clear this exam, since this is your last year and after graduation, you will become an official hunter, you will have to work with other hunters occasionally so you can think of it as a training for working in a team\" Elena said and looked at Evan whose eyes were twitching after hearing the word team.</p><p>Elena ignored him and continued \"Don't worry too much there will only be one person in your team and you don't have to find your teammate by yourself because the teams will be created randomly by the lucky draw\".</p><p>After saying this Elena looked at Evan and said \"I know it will be your first time working with someone, but try your best to perform good because 'the all hunter academy tournament' will be held in four months and the result of your exam will greatly affect who will represent the Astrate academy in the tournament\".</p><p>\"I completely forget about the tournament\" Evan said when he heard Elena.</p><p>The all hunter academy tournament is the competition between the six major hunter academies.</p><p>Six major hunter academies including Astrate hunter academy will take part in this tournament.</p><p>This tournament is held every year and the students of different academies will compete against each other.</p><p>Only the students who are in their final year will take part in this competition and since this is Evan's last year he also has a chance to take part in this tournament.</p><p>The winner of the tournament will receive excellent rewards and if Evan remembered correctly last year Astrate academy came in third place in this tournament.</p><p>\"Only five students from each academy can take part in this tournament and since you just recovered it will be hard for you to compete for a position but try your best\" Elena said to Evan.</p><p>Evan nodded and asked \"do you know why the sword class was canceled today?\"</p><p>While telling his fake story Evan received a message that there will be no sword classes for the time being, although he was planning to stop going to sword classes, he was still curious why the class was suddenly canceled.</p><p>\" There have been some dungeon outbreaks recently and professor Robert is currently working with hunters to surpass these dungeon outbreaks so I don't think there will be sword classes for the time being\".</p><p>\"Also don't go into dungeons for some time because it's strange that many dungeon outbreaks happen at the same time\" Elena said to Evan in a serious voice.</p><p>\"Alright I will keep that in mind\" Evan said and stood up \"Thanks for telling me about the exam and tournament\".</p><p>\"Don't worry about it, just do your best in the upcoming exam\".</p><p>\"I will\" Evan said and left the office.</p><p>\"Now that I don't have anything else to do I should go and sell everything that I got from my last mission\" Evan mumbled and left the academy.</p><p>Evan took a taxi and went towards the city plaza where he can sell most of the things at a reasonable price.</p><p>'I will finally become rich after working like a fool for all those years' Evan thought while dreaming about the money he will receive after selling everything.</p><p>'I know about the price of most of the things but I don't know how much I will get for that barrier crystal and black device since those two are not new'.</p><p>Soon Evan reached at city plaza, he paid the taxi bill and went inside the building of the city plaza.</p><p>\"Now where should I go, I have so many different kinds of things that I want to sell\" Evan mumbled after coming inside the building.</p><p>Evan wants to sell cores, a storage ring, a crystal barrier, a black device, and even the corpse of the black ogre that he stored inside his shadow using his skill.</p><p>Evan was most surprised by the fact that time stopped for the things that he store inside his shadow. This was great news for Evan since he can store the corpses of monsters for a long time after killing them.</p><p>Suddenly Evan saw a guy in a staff dress coming towards him but just by looking at the face of the man Evan was sure that this guy is a villain.</p>", "images": {}, "success": true, "cid": "67746448220934839"}