{"id": 45, "url": "https://www.webnovel.com/pt/book/necromancer-of-the-shadows_24857334405021605/fighting-c-rank-monster-(part-1)_67815840128492970", "title": "Fighting C Rank Monster (Part 1)", "volume": 2, "volume_title": "Volume 1 : Introduction", "body": "<h1>Fighting C Rank Monster (Part 1)</h1><p>Thud!!!</p><p>With a loud sound a three meters tall brown bear fell to the ground motionless there were many wounds on the body of the bear but the most noticeable was the wound on its head.</p><p>There was a hole at the head of the bear like a bullet pierced through all way to its brain and even before it can do anything it was already dead.</p><p>\"I thought I will be able to kill this bear with just my physical strength\" Evan said while looking at the body of the dead bear.</p><p>Evan turned around and saw another bear who was also lying motionless on the ground but unlike the previous bear, there were many sword wounds on the body of this bear.</p><p>At first, Evan tried to kill both bears just by using his physical strength and he fought with them like a barbarian but because there were two bears he wasn't able to fight properly with them.</p><p>At last, Evan decided to kill one bear with his sword and fight against the second bear with just physical strength.</p><p>After killing one bear with sword Evan once again fought with his bare fist and surprisingly he was able to fight against the bear on even ground although it was a D+ rank bear who was even stronger than some C rank hunters when it come to physical strength.</p><p>Evan was also surprised when he find out how much his physical strength increased because of his monarch core, but even though he was able to fight against the bear with his physical strength and was able to evade its attack because of his high agility he still wasn't able to fatally wound the bear with just his physical strength.</p><p>The vitality of the bear was quite high so even though it was taking damage while fighting against Evan it was not enough to kill it, in the end, Evan used a shadow bullet and killed the bear with it.</p><p>Because his prime core advanced to E+ rank the power of his shadow bullet also increased quite a lot and he even used quite a lot of mana to create that bullet so he was able to one-shot the bear.</p><p>\"Maybe after my monarch core will advance to C rank I will be able to blow up the head of this kind of monsters with just a single punch\" Evan said out loud when he remembered how in some novels that he read in past life, some people can blow up the entire body of monsters with just single punch.</p><p>\"Damm! I really want to turn the bodies of the monsters in meat paste with just a single punch\" Evan shouted and started to look for cores.</p><p>Lucky for Evan he found one D+ rank core from the bear he killed using the shadow bullet.</p><p>After taking the cores Evan didn't leave to look for monsters instead he used the body of the bear as bait and spilled its blood all around the area.</p><p>After spilling the blood of the bears Evan climbed up a tree and waited for monsters to come here after smelling the blood.</p><p>Soon the smell of the blood spread all around the area and Evan waited for monsters to come near his location after smelling the blood.</p><p>******</p><p>Swish!!!</p><p>Evan swung his sword and the head of a horse-like monster dropped to the ground.</p><p>After killing the monster Evan quickly looked for the core.</p><p>\"Tch\" Evan clicked his tongue in irritation when he didn't find any core from the horse-type monster.</p><p>After seeing there was no core Evan once again walked towards the tree and climbed up on it.</p><p>Evan looked around him and now along with the bodies of two bears, there were around fifteen more bodies of the D and D+ rank monsters.</p><p>It has been three hours since Evan killed the bears and in these three hours around fifteen monsters came near the location where he was waiting for them.</p><p>After killing those fifteen monsters Evan received three D-rank cores and two D+ rank cores.</p><p>How!!!</p><p>Suddenly Evan heard the howl of a wolf, and a predatory smile appeared on his face.</p><p>\"Another one is coming\" Evan said while waiting above the tree.</p><p>Soon Evan saw a wolf coming towards the many corpses while drooling like a hungry beast, soon the wolf came near the body of an ape-like monster and started munching it.</p><p>The wolf was two meters tall and was covered in dark black fur, and when Evan saw the wolf he instinctively felt shadow power near it, which means the wolf was a shadow-type monster.</p><p>\"Good my prime core will advance even faster if I absorb the power of a shadow core\".</p><p>Evan said and was about to come down from the tree to kill the wolf when he saw two more wolves come out from the bushes and went towards the bodies of monsters to eat them.</p><p>Evan was more than happy when he saw two more shadow wolves, but before he can think anything else Evan felt another presence approaching his location.</p><p>Suddenly another wolf who looks similar to the previous three wolves came from the bushes, the only difference was that this wolf was three meters tall and its aura was stronger than the previous three wolves.</p><p>When Evan saw this wolf he stopped climbing down from the tree and his eyes opened wide.</p><p>\"C rank monster\" Evan muttered in low voice and gulp down his saliva.</p><p>\"How the hell it came here I am still in the outer zone of the wilderness where you don't find C rank monster\" Evan cursed his luck when he saw the c rank monster.</p><p>Evan was not sure about killing a C-rank monster because just like how humans get a class after reaching at C rank, monsters abilities also increased when they reach at C rank.</p><p>Evan was sure that he is physically stronger than this C-rank wolf but he was still not sure in defeating this wolf because C rank is completely different from all previous ranks.</p><p>'I shouldn't take the risk and just leave from here' Evan thought when he saw the wolf because there was no reason in risking his life. Evan just has to wait for some time and he will easily be able to kill these kinds of monsters.</p><p>Just as Evan thought about retreating the C rank wolf who just came looked at the tree he was hiding and slowly started to move towards him.</p><p>' Well Fu*k' Evan cursed when he saw the wolf was coming towards him.</p>", "images": {}, "success": true, "cid": "67815840128492970"}